{
  "PODD": {
    "name": "Insulet Corporation",
    "industry": "Medical Devices",
    "summary": "Insulet Corporation develops, manufactures, and sells insulin delivery systems for people with insulin-dependent diabetes in the United States and internationally. The company offers Omnipod platform products comprising Omnipod 5 automated insulin delivery system, which includes a proprietary AID al..."
  },
  "TMO": {
    "name": "Thermo Fisher Scientific Inc",
    "industry": "Diagnostics & Research",
    "summary": "Thermo Fisher Scientific Inc. provides life sciences solutions, analytical instruments, specialty diagnostics, and laboratory products and biopharma services in the North America, Europe, Asia-Pacific, and internationally. The company's Life Sciences Solutions segment offers reagents, instruments, a..."
  },
  "FIX": {
    "name": "Comfort Systems USA, Inc.",
    "industry": "Engineering & Construction",
    "summary": "Comfort Systems USA, Inc., together with its subsidiaries, provides mechanical and electrical installation, renovation, maintenance, repair, and replacement services for the mechanical and electrical services industry in the United States. It operates through two segments: Mechanical and Electrical...."
  },
  "AA": {
    "name": "Alcoa Corporation",
    "industry": "Aluminum",
    "summary": "Alcoa Corporation, together with its subsidiaries, engages in the bauxite mining, alumina refining, aluminum production, and energy generation business in Australia, Brazil, Canada, Iceland, Norway, Spain, the United States, and internationally. The company operates through two segments, Alumina and..."
  },
  "CENX": {
    "name": "Century Aluminum Company",
    "industry": "Aluminum",
    "summary": "Century Aluminum Company, together with its subsidiaries, produces and sells standard-grade and value-added primary aluminum products in the United States and Iceland. It also owns and operates a carbon anode production facility located in Vlissingen, the Netherlands, as well as engages in the bauxi..."
  },
  "SO": {
    "name": "Southern Company (The)",
    "industry": "Utilities - Regulated Electric",
    "summary": "The Southern Company, through its subsidiaries, engages in the generation, transmission, and distribution of electricity. The company develops, constructs, acquires, owns, and manages power generation assets, including renewable energy projects and sells electricity in the wholesale market; distribu..."
  },
  "TREX": {
    "name": "Trex Company, Inc.",
    "industry": "Building Products & Equipment",
    "summary": "Trex Company, Inc. manufactures and sells composite decking and railing products in the United States. The company offers decking products and accessories that can be used for protection against fading, staining, mold, and scratching, including Trex Transcend, which are decking products that can als..."
  },
  "CTRA": {
    "name": "Coterra Energy Inc.",
    "industry": "Oil & Gas E&P",
    "summary": "Coterra Energy Inc., an independent oil and gas company, engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. The company's properties include the Permian Basin with approximately 2,97,000 net acres in west Texas and southeast, Ne..."
  },
  "CC": {
    "name": "Chemours Company (The)",
    "industry": "Specialty Chemicals",
    "summary": "The Chemours Company provides performance chemicals in North America, the Asia Pacific, Europe, the Middle East, Africa, and Latin America. It operates through three segments: Thermal & Specialized Solutions, Titanium Technologies, and Advanced Performance Materials. The Thermal & Specialized Soluti..."
  },
  "LEA": {
    "name": "Lear Corporation",
    "industry": "Auto Parts",
    "summary": "Lear Corporation designs, develops, engineers, manufactures, assembles, and supplies automotive seating, and electrical distribution systems and related components for automotive original equipment manufacturers in North America, Europe, Africa, Asia, and South America. Its Seating segment offers se..."
  },
  "NOC": {
    "name": "Northrop Grumman Corporation",
    "industry": "Aerospace & Defense",
    "summary": "Northrop Grumman Corporation operates as an aerospace and defense technology company in the United States, Asia/Pacific, Europe, and internationally. It operates through four segments: Aeronautics Systems, Defense Systems, Mission Systems and Space Systems. The Aeronautics Systems segment designs, d..."
  },
  "T": {
    "name": "AT&T Inc.",
    "industry": "Telecom Services",
    "summary": "AT&T Inc. provides telecommunications and technology services worldwide. It operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carryin..."
  },
  "STLD": {
    "name": "Steel Dynamics, Inc.",
    "industry": "Steel",
    "summary": "Steel Dynamics, Inc., together with its subsidiaries, operates as a steel producer and metal recycler in the United States. It operates through four segments: Steel Operations, Metals Recycling Operations, Steel Fabrication Operations, and Aluminum Operations. The Steel Operations segment offers hot..."
  },
  "ALB": {
    "name": "Albemarle Corporation",
    "industry": "Specialty Chemicals",
    "summary": "Albemarle Corporation provides energy storage solutions worldwide. It operates through three segments: Energy Storage, Specialties, and Ketjen. The Energy Storage segment offers lithium compounds, including lithium carbonate, lithium hydroxide, and lithium chloride for use in lithium batteries used ..."
  },
  "BMNR": {
    "name": "BitMine Immersion Technologies,",
    "industry": "Capital Markets",
    "summary": "Bitmine Immersion Technologies, Inc. operates as a blockchain technology company primarily in the United States. The company engages in ETH treasury operations; BTC ecosystem services, including consulting and advisory engagements and equipment leasing; facilitation and optimization of third-party p..."
  },
  "MNDY": {
    "name": "monday.com Ltd.",
    "industry": "Software - Application",
    "summary": "monday.com Ltd., together with its subsidiaries, develops software applications in the United States, Europe, the Middle East, Africa, the United Kingdom, and internationally. The company provides Work Operating System (Work OS), a cloud-based visual work OS that consists of modular building blocks ..."
  },
  "LUMN": {
    "name": "Lumen Technologies, Inc.",
    "industry": "Telecom Services",
    "summary": "Lumen Technologies, Inc., a networking company, provides integrated products and services to business and mass customers in the United States and internationally. The company operates in two segments, Business and Mass Markets. It offers dark fiber and conduit, edge cloud, internet protocol (IP), vo..."
  },
  "ED": {
    "name": "Consolidated Edison, Inc.",
    "industry": "Utilities - Regulated Electric",
    "summary": "Consolidated Edison, Inc., through its subsidiaries, engages in the regulated electric, gas, and steam delivery businesses in the United States. The company offers electric services to approximately 3.7 million customers in New York City and Westchester County; gas to approximately 1.1 million custo..."
  },
  "SENT": {
    "name": "AdvisorShares Alpha DNA Equity ",
    "industry": "",
    "summary": "The fund is an actively managed exchange-traded fund (\"ETF\") that seeks to achieve its investment objective by investing in U.S. exchange listed equity securities, primarily consisting of common stock of large-, mid-, and small-capitalization U.S. companies, while hedging overall market exposure. Un..."
  },
  "CRWD": {
    "name": "CrowdStrike Holdings, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "CrowdStrike Holdings, Inc. provides cybersecurity solutions in the United States and internationally. Its unified platform provides cloud-delivered protection of endpoints, cloud workloads, identity, and data through a software as a service (SaaS) subscription-based model. The company offers corpora..."
  },
  "NMG": {
    "name": "Nouveau Monde Graphite Inc.",
    "industry": "Other Industrial Metals & Mining",
    "summary": "Nouveau Monde Graphite Inc. engages in the acquisition, exploration, development, and evaluation of mineral properties in Quebec, Canada. It primarily explores for graphite. The company's flagship property is the 100% owned Matawinie graphite property including 176 mining claims covering an area of ..."
  },
  "GT": {
    "name": "The Goodyear Tire & Rubber Comp",
    "industry": "Auto Parts",
    "summary": "The Goodyear Tire & Rubber Company, together with its subsidiaries, develops, manufactures, distributes, and sells tires and related products and services worldwide. It offers various lines of rubber tires for automobiles, trucks, buses, aircraft, motorcycles, earthmoving and mining equipment, farm ..."
  },
  "OUST": {
    "name": "Ouster, Inc.",
    "industry": "Electronic Components",
    "summary": "Ouster, Inc. provides lidar sensors for the automotive, industrial, robotics, and smart infrastructure industries in the Americas, the Asia-Pacific, Europe, the Middle East, and Africa. Its products include high-resolution scanning and solid-state digital lidar sensors, analog lidar sensors, and sof..."
  },
  "MTZ": {
    "name": "MasTec, Inc.",
    "industry": "Engineering & Construction",
    "summary": "MasTec, Inc., an infrastructure construction company, provides engineering, building, installation, maintenance, and upgrade services for communications, energy, utility, and other infrastructure primarily in the United States and Canada. It operates through five segments: Communications, Clean Ener..."
  },
  "AMCR": {
    "name": "Amcor plc",
    "industry": "Packaging & Containers",
    "summary": "Amcor plc, together with its subsidiaries, engages in the production and sale of packaging products in Europe, North America, Latin America, and the Asia Pacific. The company operates in two segments, Global Flexible Packaging Solutions and Global Rigid Packaging Solutions. The Global Flexible Packa..."
  },
  "CHWY": {
    "name": "Chewy, Inc.",
    "industry": "Internet Retail",
    "summary": "Chewy, Inc., together with its subsidiaries, engages in the e-commerce business in the United States. It offers pet food and treats, pet supplies and pet medications, and other pet-health products, as well as pet services. The company serves its customer through its retail websites and mobile applic..."
  },
  "LC": {
    "name": "LendingClub Corporation",
    "industry": "Banks - Regional",
    "summary": "LendingClub Corporation, operates as a bank holding company, that provides range of financial products and services in the United States. It offers deposit products, including savings accounts, checking accounts, and certificates of deposit. The company also provides loan products, such as consumer ..."
  },
  "SPIR": {
    "name": "Spire Global, Inc.",
    "industry": "Specialty Business Services",
    "summary": "Spire Global, Inc. provides subscription-based data, insights, predictive analytics, and related project-based services worldwide. The company offers satellite-based aircraft tracking data, drive decision making, and improve cost efficiencies; data, insights, and predictive analytics for highly accu..."
  },
  "CIFR": {
    "name": "Cipher Mining Inc.",
    "industry": "Capital Markets",
    "summary": "Cipher Mining Inc., together with its subsidiaries, develops and operates industrial-scale data centers in the United States. The company was founded in 2021 and is headquartered in New York, New York."
  },
  "CACI": {
    "name": "CACI International, Inc.",
    "industry": "Information Technology Services",
    "summary": "CACI International Inc, through its subsidiaries, provides expertise and technology solutions in the United States, the United Kingdom, rest of Europe, and internationally. The company offers control, communications, and intelligence technology and networks; cyber solutions for offensive and defensi..."
  },
  "HSAI": {
    "name": "Hesai Group",
    "industry": "Auto Parts",
    "summary": "Hesai Group, through with its subsidiaries, engages in the development, manufacture, and sale of three-dimensional light detection and ranging solutions (LiDAR) in Mainland China, Europe, North America, and internationally. The company offers gas detection products, validation services, solution ser..."
  },
  "SMH": {
    "name": "VanEck Semiconductor ETF",
    "industry": "",
    "summary": "The fund normally invests at least 80% of its total assets in securities that comprise the fund's benchmark index. The index includes common stocks and depositary receipts of U.S. exchange-listed companies in the semiconductor industry. Such companies may include medium-capitalization companies and ..."
  },
  "TROX": {
    "name": "Tronox Holdings plc",
    "industry": "Chemicals",
    "summary": "Tronox Holdings plc operates as a vertically integrated manufacturer of TiO2 pigment in North America, South and Central America, Europe, the Middle East, Africa, and the Asia Pacific. The company operates titanium-bearing mineral sand mines; and engages in beneficiation and smelting operations. It ..."
  },
  "DOCS": {
    "name": "Doximity, Inc.",
    "industry": "Health Information Services",
    "summary": "Doximity, Inc. operates as a digital platform for medical professionals in the United States. Its platform provides its members with digital tools built for medicine, that enables its members to collaborate with colleagues, stay up to date with the latest medical news and research, manage their care..."
  },
  "KGC": {
    "name": "Kinross Gold Corporation",
    "industry": "Gold",
    "summary": "Kinross Gold Corporation, together with its subsidiaries, engages in the acquisition, exploration, and development of gold properties principally in the United States, Brazil, Chile, Canada, and Mauritania. It is also involved in the extraction and processing of gold-containing ores; reclamation of ..."
  },
  "KNX": {
    "name": "Knight-Swift Transportation Hol",
    "industry": "Trucking",
    "summary": "Knight-Swift Transportation Holdings Inc., together with its subsidiaries, provides freight transportation services in the United States and Mexico. The company operates through four segments: Truckload, Less-than-truckload (LTL), Logistics, and Intermodal. The Truckload segment provides transportat..."
  },
  "XP": {
    "name": "XP Inc.",
    "industry": "Capital Markets",
    "summary": "XP Inc. provides financial products and services in Brazil. The company operates XP Platform, an open product platform that provides clients to access investment products in the market comprising brokerage securities, fixed income securities, mutual, hedge, and private equity funds; derivatives and ..."
  },
  "TMQ": {
    "name": "Trilogy Metals Inc.",
    "industry": "Other Industrial Metals & Mining",
    "summary": "Trilogy Metals Inc. engages in the exploration and development of mineral properties in the United States. It primarily explores for copper, cobalt, lead, zinc, gold, and silver properties. The company principally holds interests in the Upper Kobuk mineral projects that include the Arctic, which con..."
  },
  "CEG": {
    "name": "Constellation Energy Corporatio",
    "industry": "Utilities - Independent Power Producers",
    "summary": "Constellation Energy Corporation produces and sells energy products and services in the United States. It operates through five segments: Mid-Atlantic, Midwest, New York, ERCOT, and Other Power Regions. The company offers electricity, natural gas, energy-related products, and sustainable solutions. ..."
  },
  "DRI": {
    "name": "Darden Restaurants, Inc.",
    "industry": "Restaurants",
    "summary": "Darden Restaurants, Inc., together with its subsidiaries, owns and operates full-service restaurants in the United States and Canada. The company operates under Olive Garden, LongHorn Steakhouse, Cheddar's Scratch Kitchen, Chuy's, Yard House, Ruth's Chris Steak House, The Capital Grille, Seasons 52,..."
  },
  "BMY": {
    "name": "Bristol-Myers Squibb Company",
    "industry": "Drug Manufacturers - General",
    "summary": "Bristol-Myers Squibb Company discovers, develops, licenses, manufactures, markets, distributes, and sells biopharmaceutical products worldwide. It offers products for oncology, hematology, immunology, cardiovascular, neuroscience, and other areas. The company's products include Eliquis for reduction..."
  },
  "FRSH": {
    "name": "Freshworks Inc.",
    "industry": "Software - Application",
    "summary": "Freshworks Inc., a software development company, provides software-as-a-service products in North America, Europe, the Middle East, Africa, Asia Pacific, and internationally. The company's software-as-a-service solutions includes Customer Experience (CX) and Employee Experience (EX). Customer Experi..."
  },
  "ABBV": {
    "name": "AbbVie Inc.",
    "industry": "Drug Manufacturers - General",
    "summary": "AbbVie Inc., a research-based biopharmaceutical company, engages in the research and development, manufacture, commercialization, and sale of medicines and therapies worldwide. The company offers Humira, an injection for autoimmune and intestinal Behçet's diseases, generalized pustular psoriasis, an..."
  },
  "WIX": {
    "name": "Wix.com Ltd.",
    "industry": "Software - Infrastructure",
    "summary": "Wix.com Ltd., together with its subsidiaries, operates a cloud-based web development platform for registered users and creators worldwide. The company offers Wix Editor, a drag-and-drop visual development and website editing environment platform; and Wix Studio a unified website and application deve..."
  },
  "SHW": {
    "name": "Sherwin-Williams Company (The)",
    "industry": "Specialty Chemicals",
    "summary": "The Sherwin-Williams Company engages in the development, manufacture, distribution, and sale of paint, coatings, and related products to professional, industrial, commercial and retail customers. It operates through three segments: Paint Stores Group, Consumer Brands Group, and Performance Coatings ..."
  },
  "LLY": {
    "name": "Eli Lilly and Company",
    "industry": "Drug Manufacturers - General",
    "summary": "Eli Lilly and Company discovers, develops, and markets human pharmaceuticals in the United States, Europe, China, Japan, and internationally. The company offers Basaglar, Humalog, Humalog Mix 75/25, Humalog U-100, Humalog U-200, Humalog Mix 50/50, insulin lispro, insulin lispro protamine, insulin li..."
  },
  "PPL": {
    "name": "PPL Corporation",
    "industry": "Utilities - Regulated Electric",
    "summary": "PPL Corporation provides electricity and natural gas to approximately 3.5 million customers in the United States. It operates through three segments: Kentucky Regulated, Pennsylvania Regulated, and Rhode Island Regulated. The company delivers electricity to customers in Pennsylvania, Kentucky, Virgi..."
  },
  "NXE": {
    "name": "Nexgen Energy Ltd.",
    "industry": "Uranium",
    "summary": "NexGen Energy Ltd., an exploration and development stage company, engages in the acquisition, exploration, evaluation, and development of uranium properties in Canada. It holds a 100% interest in the Rook I project that consists of 32 contiguous mineral claims totaling an area of approximately 35,06..."
  },
  "F": {
    "name": "Ford Motor Company",
    "industry": "Auto Manufacturers",
    "summary": "Ford Motor Company develops, delivers, and services Ford trucks, sport utility vehicles, commercial vans and cars, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, Ford Pro, and Ford Credit segments. The company sells Ford and Lincoln internal combustion engine and..."
  },
  "ZS": {
    "name": "Zscaler, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Zscaler, Inc. operates as a cloud security company worldwide. The company offers cyberthreat protection products, including Zscaler Internet Access, which provides threat protection, cloud sandbox, and cloud browser isolation; Zscaler Private Access solution that includes cyberthreat and data protec..."
  },
  "STEM": {
    "name": "Stem, Inc.",
    "industry": "Utilities - Renewable",
    "summary": "Stem, Inc. provides artificial intelligence driven software and services that enable its customers to plan, deploy, and operate clean energy assets in the United States and internationally. The company offers OEM energy storage systems; and software and edge hardware devices services. It serves ener..."
  },
  "NU": {
    "name": "Nu Holdings Ltd.",
    "industry": "Banks - Regional",
    "summary": "Nu Holdings Ltd. provides digital banking platform in Brazil, Mexico, Colombia, the Cayman Islands, and the United States. It offers spending solutions comprising Nu credit and prepaid card, a digitally enabled card that acts as a credit and a prepaid card; Nubank+ Tier, an evolution of the Nu exper..."
  },
  "UAMY": {
    "name": "United States Antimony Corporat",
    "industry": "Other Industrial Metals & Mining",
    "summary": "United States Antimony Corporation produces and sells antimony, zeolite, and precious metals in the United States and Canada. It operates in two segments: Antimony and Zeolite. The company offers antimony oxide that is primarily used in conjunction with a halogen to form a synergistic flame retardan..."
  },
  "TME": {
    "name": "Tencent Music Entertainment Gro",
    "industry": "Internet Content & Information",
    "summary": "Tencent Music Entertainment Group operates online music entertainment platforms that provides music streaming, online karaoke, and live streaming services in the People's Republic of China. It offers QQ Music, Kugou Music, and Kuwo Music that enable users to discover, enjoy, and share music in perso..."
  },
  "D": {
    "name": "Dominion Energy, Inc.",
    "industry": "Utilities - Regulated Electric",
    "summary": "Dominion Energy, Inc. provides regulated electricity and natural gas services in the United States. It operates through Dominion Energy Virginia, Dominion Energy South Carolina, and Contracted Energy segments. The Dominion Energy Virginia segment engages in the generation, distribution, and transmis..."
  },
  "SRE": {
    "name": "DBA Sempra",
    "industry": "Utilities - Diversified",
    "summary": "Sempra operates as an energy infrastructure company in the United States and internationally. It operates through three segments: Sempra California, Sempra Texas Utilities, and Sempra Infrastructure. The Sempra California segment provides natural gas and electric services to Southern California and ..."
  },
  "GTX": {
    "name": "Garrett Motion Inc.",
    "industry": "Auto Parts",
    "summary": "Garrett Motion Inc., together with its subsidiaries, designs, manufactures, and sells turbocharging, air and fluid compression, and high-speed electric motor technologies for original equipment manufacturers and distributors in the United States, Europe, Asia, and internationally. The company offers..."
  },
  "BE": {
    "name": "Bloom Energy Corporation",
    "industry": "Electrical Equipment & Parts",
    "summary": "Bloom Energy Corporation designs, manufactures, sells, and installs solid oxide fuel cell systems for on-site power generation in the United States and internationally. It offers Bloom Energy Server, an energy server platform to convert fuel, such as natural gas, biogas, hydrogen, or a blend of thes..."
  },
  "MYRG": {
    "name": "MYR Group, Inc.",
    "industry": "Engineering & Construction",
    "summary": "MYR Group Inc., through its subsidiaries, provides electrical construction services in the United States and Canada. It operates through two segments: Transmission and Distribution, and Commercial and Industrial. The Transmission and Distribution segment offers a range of services on electric transm..."
  },
  "ILMN": {
    "name": "Illumina, Inc.",
    "industry": "Diagnostics & Research",
    "summary": "Illumina, Inc. provides sequencing- and array-based solutions for genetic and genomic analysis in the Americas, Europe, Greater China, the Asia Pacific, the Middle East, and Africa. The company offers sequencing- and array-based instruments and consumables, which include reagents, flow cells, and li..."
  },
  "CYBR": {
    "name": "CyberArk Software Ltd.",
    "industry": "Software - Infrastructure",
    "summary": "CyberArk Software Ltd. develops, markets, and sells software-based identity security solutions and services in the United States, Israel, the United Kingdom, Europe, the Middle East, Africa, and internationally. Its solutions include Privileged Access Manager and Privilege Cloud, which offers risk-b..."
  },
  "GFI": {
    "name": "Gold Fields Limited",
    "industry": "Gold",
    "summary": "Gold Fields Limited operates as a gold producer with reserves and resources in Australia, South Africa, Ghana, Peru, Chile, and Canada. It also explores for copper and silver deposits. Gold Fields Limited was founded in 1887 and is based in Sandton, South Africa."
  },
  "SUZ": {
    "name": "Suzano S.A.",
    "industry": "Paper & Paper Products",
    "summary": "Suzano S.A. manufactures and sells pulp and paper products in Brazil and internationally. It operates in two segments, Pulp, and Paper and Consumer Goods. The company offers coated and uncoated printing and writing papers, paperboards, tissue papers, and market and fluff pulps. It also engages in th..."
  },
  "FINX": {
    "name": "Global X FinTech ETF",
    "industry": "",
    "summary": "The fund invests at least 80% of its total assets in the securities of the underlying index. The underlying index is designed to provide exposure to exchange-listed companies in developed markets that provide financial technology products and services, including companies involved in mobile payments..."
  },
  "HOOD": {
    "name": "Robinhood Markets, Inc.",
    "industry": "Capital Markets",
    "summary": "Robinhood Markets, Inc. operates financial services platform in the United States. Its platform allows users to invest in stocks, exchange-traded funds (ETFs), American depository receipts, options, gold, and cryptocurrencies. The company offers fractional trading, recurring investments, fully-paid ..."
  },
  "QMMM": {
    "name": "QMMM Holdings Limited",
    "industry": "Advertising Agencies",
    "summary": "QMMM Holdings Limited, through its subsidiaries, provides digital media advertising and marketing production services primarily in Hong Kong. The company provides content and production services for ad campaigns, TV commercials, online video, 360 video and animation, VR/AR/MR technology, 3D scanning..."
  },
  "XOP": {
    "name": "State Street SPDR S&P Oil & Gas",
    "industry": "",
    "summary": "In seeking to track the performance of the S&P Oil & Gas Exploration & Production Select Industry Index, the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the oil and gas ex..."
  },
  "VRAR": {
    "name": "The Glimpse Group, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "The Glimpse Group, Inc., an immersive technology company provides enterprise focused virtual reality (VR), augmented reality (AR), and spatial computing software and services in the United States. It offers Brightline Interactive, an immersive and interactive experience, training scenarios, and simu..."
  },
  "MDT": {
    "name": "Medtronic plc.",
    "industry": "Medical Devices",
    "summary": "Medtronic plc develops, manufactures, and sells device-based medical therapies to healthcare systems, physicians, clinicians, and patients in the United States, Ireland, and internationally. The Cardiovascular Portfolio segment offers implantable cardiac pacemakers, cardioverter defibrillators, and ..."
  },
  "CELC": {
    "name": "Celcuity Inc.",
    "industry": "Biotechnology",
    "summary": "Celcuity Inc., a clinical-stage biotechnology company, focuses on the development of targeted therapies for the treatment of various solid tumors in the United States. The company's lead drug candidate includes Gedatolisib, which selectively targets various Class I isoforms of phosphatidylinositol-3..."
  },
  "AN": {
    "name": "AutoNation, Inc.",
    "industry": "Auto & Truck Dealerships",
    "summary": "AutoNation, Inc., through its subsidiaries, operates as an automotive retailer in the United States. The company operates through four segments: Domestic, Import, Premium Luxury, and AutoNation Finance. It offers a range of automotive products and services, including new and used vehicles; and parts..."
  },
  "DOCN": {
    "name": "DigitalOcean Holdings, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "DigitalOcean Holdings, Inc., through its subsidiaries, operates a cloud computing platform in North America, Europe, Asia, and internationally. The company provides on-demand infrastructure and platform tools for developers at growing technology companies. It also offers infrastructure-as-a-service ..."
  },
  "BKR": {
    "name": "Baker Hughes Company",
    "industry": "Oil & Gas Equipment & Services",
    "summary": "Baker Hughes Company provides a portfolio of technologies and services to energy and industrial value chain. Its Oilfield Services & Equipment segment designs and manufactures exploration, appraisal, development, production, rejuvenation, and decommissioning products and related services for onshore..."
  },
  "GD": {
    "name": "General Dynamics Corporation",
    "industry": "Aerospace & Defense",
    "summary": "General Dynamics Corporation operates as an aerospace and defense company worldwide. It operates through four segments: Aerospace, Marine Systems, Combat Systems, and Technologies. The Aerospace segment produces and sells business jets; and offers aircraft maintenance and repair, management, aircraf..."
  },
  "GSAT": {
    "name": "Globalstar, Inc.",
    "industry": "Telecom Services",
    "summary": "Globalstar, Inc. provides mobile satellite services in the United States, Canada, Europe, Central and South America, and internationally. The company offers duplex two-way voice and data products, including mobile voice and data satellite communications services and equipment for remote business con..."
  },
  "HII": {
    "name": "Huntington Ingalls Industries, ",
    "industry": "Aerospace & Defense",
    "summary": "Huntington Ingalls Industries, Inc. designs, builds, overhauls, and repairs military ships in the United States. It operates through three segments: Ingalls, Newport News, and Mission Technologies. The company is involved in the design and construction of non-nuclear ships comprising amphibious assa..."
  },
  "THC": {
    "name": "Tenet Healthcare Corporation",
    "industry": "Medical Care Facilities",
    "summary": "Tenet Healthcare Corporation operates as a diversified healthcare services company in the United States. The company operates through two segments: Hospital Operations and Services, and Ambulatory Care. Its general hospitals offer acute care services, operating and recovery rooms, radiology and resp..."
  },
  "POET": {
    "name": "POET Technologies Inc.",
    "industry": "Semiconductors",
    "summary": "POET Technologies Inc., together with its subsidiaries, designs, develops, manufactures, and sells semiconductor products and services for commercial applications in the United States, Canada, Singapore, and China. The company offers photonic integrated packaging solutions based on the POET Optical ..."
  },
  "PDYN": {
    "name": "Palladyne AI Corp.",
    "industry": "Software - Infrastructure",
    "summary": "Palladyne AI Corp., a software company, focuses on delivering software that enhances the utility and functionality of third-party stationary and mobile robotic systems in the United States. Its Artificial Intelligence (AI)/ Machine Learning (ML) Foundational Technology enables robots to observe, lea..."
  },
  "CAN": {
    "name": "Canaan Inc.",
    "industry": "Computer Hardware",
    "summary": "Canaan Inc. engages in the research and development, design, and sale of integrated circuits (IC), and lease of final mining equipment by integrating IC products for bitcoin mining and related components in the People's Republic of China. It is also involved in the assembly and distribution of minin..."
  },
  "LIN": {
    "name": "Linde plc",
    "industry": "Specialty Chemicals",
    "summary": "Linde plc operates as an industrial gas company in the United States, China, Germany, the United Kingdom, Australia, Mexico, Brazil, and internationally. It offers atmospheric gases, including oxygen, nitrogen, argon, and rare gases; and process gases, such as hydrogen, helium, carbon dioxide, carbo..."
  },
  "GLOB": {
    "name": "Globant S.A.",
    "industry": "Information Technology Services",
    "summary": "Globant S.A., together with its subsidiaries, provides technology services worldwide. The company offers studio products comprising AI Studios Network, a network for AI adaptation for media and entertainment, finance, healthcare and life sciences, airlines, sports, automotive, games, hospitality and..."
  },
  "ALHC": {
    "name": "Alignment Healthcare, Inc.",
    "industry": "Healthcare Plans",
    "summary": "Alignment Healthcare, Inc. operates a consumer-centric healthcare platform for seniors in the United States. It delivers customized healthcare experience to meet the needs of seniors through its Medicare Advantage plans. The company was founded in 2013 and is based in Orange, California."
  },
  "TXG": {
    "name": "10x Genomics, Inc.",
    "industry": "Health Information Services",
    "summary": "10x Genomics, Inc., a life science technology company, develops and sells instruments, consumables, and software for analyzing biological systems in the Americas, Europe, the Middle East, Africa, China, and the Asia Pacific. It offers Chromium platform that enables analysis of individual biological ..."
  },
  "VIXY": {
    "name": "VIX Short-Term Futures ETF",
    "industry": "",
    "summary": "The index seeks to offer exposure to market volatility through publicly traded futures markets and is designed to measure the implied volatility of the S&P 500 over 30 days in the future."
  },
  "AMGN": {
    "name": "Amgen Inc.",
    "industry": "Drug Manufacturers - General",
    "summary": "Amgen Inc. discovers, develops, manufactures, and delivers human therapeutics worldwide. The company's principal products include Enbrel for the treatment of rheumatoid arthritis, plaque psoriasis, and psoriatic arthritis; Otezla for the treatment of adult patients with plaque psoriasis, psoriatic a..."
  },
  "JCI": {
    "name": "Johnson Controls International ",
    "industry": "Building Products & Equipment",
    "summary": "Johnson Controls International plc, together with its subsidiaries, engages in engineering, manufacturing, commissioning, and retrofitting building products and systems in the United States, Europe, the Asia Pacific, and internationally. It operates through four segments: Building Solutions North Am..."
  },
  "CAMT": {
    "name": "Camtek Ltd.",
    "industry": "Semiconductor Equipment & Materials",
    "summary": "Camtek Ltd., together with its subsidiaries, develops, manufactures, and sells inspection and metrology equipment for semiconductor industry in the United States, China, Korea, Europe, and the Asia Pacific. The company offers Hawk, a platform engineered for advanced packaging; Eagle G5 for enhanced ..."
  },
  "MDB": {
    "name": "MongoDB, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "MongoDB, Inc., together with its subsidiaries, provides general purpose database platform worldwide. The company provides MongoDB Atlas, a hosted multi-cloud database-as-a-service solution; MongoDB Enterprise Advanced, a commercial database server for enterprise customers to run in the cloud, on-pre..."
  },
  "SOFI": {
    "name": "SoFi Technologies, Inc.",
    "industry": "Credit Services",
    "summary": "SoFi Technologies, Inc. provides various financial services in the United States, Latin America, Canada, and Hong Kong. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to ..."
  },
  "NET": {
    "name": "Cloudflare, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Cloudflare, Inc. operates as a cloud services provider that delivers a range of services to businesses worldwide. The company provides an integrated cloud-based security solution to secure a range of combination of platforms, including public cloud, private cloud, on-premises, software-as-a-service ..."
  },
  "ASAN": {
    "name": "Asana, Inc.",
    "industry": "Software - Application",
    "summary": "Asana, Inc., together with its subsidiaries, operates a work management software platform for individuals, team leads, and executives in the United States and internationally. Its platform helps organizations to orchestrate work from daily tasks to cross-functional strategic initiatives; manage work..."
  },
  "HWM": {
    "name": "Howmet Aerospace Inc.",
    "industry": "Aerospace & Defense",
    "summary": "Howmet Aerospace Inc. provides advanced engineered solutions for the aerospace and transportation industries in the United States, Japan, France, Germany, the United Kingdom, Mexico, Italy, Canada, Poland, China, and internationally. It operates through four segments: Engine Products, Fastening Syst..."
  },
  "PEG": {
    "name": "Public Service Enterprise Group",
    "industry": "Utilities - Regulated Electric",
    "summary": "Public Service Enterprise Group Incorporated, through its subsidiaries, operates in electric and gas utility, and nuclear generation businesses in the United States. It operates through PSE&G and PSEG Power segments. The PSE&G segment transmits electricity; distributes electricity and natural gas to..."
  },
  "GEN": {
    "name": "Gen Digital Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Gen Digital Inc. engages in the provision of cyber safety solutions for individuals, families, and small businesses. It offers security and performance management, identity protection, and online privacy, as well as technology platform. The company offers its products under the Norton, Avast, LifeLo..."
  },
  "BALL": {
    "name": "Ball Corporation",
    "industry": "Packaging & Containers",
    "summary": "Ball Corporation supplies aluminum packaging products for the beverage, personal care, and household products industries in the United States, Brazil, and internationally. The company manufactures and sells aluminum beverage containers to fillers of carbonated soft drinks, beer, energy drinks, and o..."
  },
  "AR": {
    "name": "Antero Resources Corporation",
    "industry": "Oil & Gas E&P",
    "summary": "Antero Resources Corporation, an independent oil and natural gas company, engages in the development, production, exploration, and acquisition of natural gas, natural gas liquids (NGLs), and oil properties in the United States. It operates in three segments: Exploration and Production; Marketing; an..."
  },
  "TRMD": {
    "name": "TORM plc",
    "industry": "Oil & Gas Midstream",
    "summary": "TORM plc, a shipping company, owns and operates a fleet of product tankers in the United Kingdom. It operates in two segments, Tanker and Marine Engineering. The Tanker segment transports refined oil products, such as gasoline, jet fuel, kerosene, naphtha, and gas oil, as well as dirty petroleum pro..."
  },
  "CAT": {
    "name": "Caterpillar, Inc.",
    "industry": "Farm & Heavy Construction Machinery",
    "summary": "Caterpillar Inc. manufactures and sells construction and mining equipment, off-highway diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives in the United States and internationally. Its Construction Industries segment offers asphalt pavers, cold planers, compactor..."
  },
  "HON": {
    "name": "Honeywell International Inc.",
    "industry": "Conglomerates",
    "summary": "Honeywell International Inc. engages in the aerospace technologies, industrial automation, building automation, and energy and sustainable solutions businesses in the United States, Europe, and internationally. The company's Aerospace Technologies segment offers auxiliary power units, propulsion eng..."
  },
  "W": {
    "name": "Wayfair Inc.",
    "industry": "Internet Retail",
    "summary": "Wayfair Inc. engages in the e-commerce business in the United States and internationally. It offers online selections of furniture, décor, housewares, and home improvement products through its sites comprising Wayfair, Joss & Main, AllModern, Birch Lane, Perigold, and Wayfair Professional. The compa..."
  },
  "TXT": {
    "name": "Textron Inc.",
    "industry": "Aerospace & Defense",
    "summary": "Textron Inc. operates in the aircraft, defense, industrial, and finance businesses worldwide. It operates in six segments: Textron Aviation, Bell, Textron Systems, Industrial, Textron eAviation, and Finance. The Textron Aviation segment manufactures, sells, and services business jets, turboprop and ..."
  },
  "ABT": {
    "name": "Abbott Laboratories",
    "industry": "Medical Devices",
    "summary": "Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceut..."
  },
  "QS": {
    "name": "QuantumScape Corporation",
    "industry": "Auto Parts",
    "summary": "QuantumScape Corporation, together with its subsidiaries, focuses on the development and commercialization of solid-state lithium-metal batteries for electric vehicles and other applications in the United States. The company was founded in 2010 and is headquartered in San Jose, California."
  },
  "DD": {
    "name": "DuPont de Nemours, Inc.",
    "industry": "Specialty Chemicals",
    "summary": "DuPont de Nemours, Inc. provides technology-based materials and solutions in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. It operates through two segments, ElectronicsCo and IndustrialsCo. The company supplies materials and solutions for the fabric..."
  },
  "COIN": {
    "name": "Coinbase Global, Inc. - 3",
    "industry": "Financial Data & Stock Exchanges",
    "summary": "Coinbase Global, Inc. operates platform for crypto assets in the United States and internationally. It offers the primary financial account in the crypto economy for consumers; a brokerage platform with a pool of liquidity across the crypto marketplace for institutions; and a suite of products grant..."
  },
  "JD": {
    "name": "JD.com, Inc.",
    "industry": "Internet Retail",
    "summary": "JD.com, Inc. operates as a supply chain-based technology and service provider in the People's Republic of China. It operates through three segments: JD Retail, JD Logistics, and New Businesses. The company offers computers, communication, and consumer electronics products, as well as home appliances..."
  },
  "XPO": {
    "name": "XPO, Inc.",
    "industry": "Trucking",
    "summary": "XPO, Inc., together with its subsidiaries, provides freight transportation services in the United States, North America, France, the United Kingdom, and rest of Europe. The company operates in two segments, North American Less-Than-Truckload (LTL) and European Transportation. The North American LTL ..."
  },
  "WING": {
    "name": "Wingstop Inc.",
    "industry": "Restaurants",
    "summary": "Wingstop Inc., together with its subsidiaries, franchises and operates restaurants under the Wingstop brand in United States, Australia, Bahrain, Kuwait, Puerto Rico, Saudi Arabia, and The Netherlands. Its restaurants offer classic wings, boneless wings, tenders, and hand-sauced-and-tossed in variou..."
  },
  "NCLH": {
    "name": "Norwegian Cruise Line Holdings ",
    "industry": "Travel Services",
    "summary": "Norwegian Cruise Line Holdings Ltd., together with its subsidiaries, operates as a cruise company in North America, Europe, the Asia-Pacific, and internationally. It operates the Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises brands. The company's brands provide accommodations..."
  },
  "TDC": {
    "name": "Teradata Corporation",
    "industry": "Software - Infrastructure",
    "summary": "Teradata Corporation, together with its subsidiaries, provides a connected hybrid cloud analytics and data platform in the United States and internationally. The company operates in two segments, Product Sales and Consulting Services. It offers Teradata Vantage, an open and connected platform design..."
  },
  "HUT": {
    "name": "Hut 8 Corp.",
    "industry": "Capital Markets",
    "summary": "Hut 8 Corp. operates as a vertically integrated operator of energy infrastructure and Bitcoin miners in North America. The company operates through four segments: Power, Digital Infrastructure, Compute, and Other. It also offers managed services for energy infrastructure development, such as site de..."
  },
  "VRTX": {
    "name": "Vertex Pharmaceuticals Incorpor",
    "industry": "Biotechnology",
    "summary": "Vertex Pharmaceuticals Incorporated, a biotechnology company, engages in developing and commercializing therapies for treating cystic fibrosis (CF). It markets TRIKAFTA/KAFTRIO for people with CF with at least one F508del mutation for 2 years of age and older; ALYFTREK for the treatment for people w..."
  },
  "LVMUY": {
    "name": "LVMH-Moet Hennessy Louis Vuitto",
    "industry": "Luxury Goods",
    "summary": "LVMH Moët Hennessy - Louis Vuitton, Société Européenne, together with its subsidiaries, operates as a luxury goods company worldwide. The company offers wine and spirit products under the Ao Yun, Ardbeg, Armand de Brignac, Belvedere, Bodega Numanthia, Chandon, Cheval des Andes, Château Cheval Blanc,..."
  },
  "EXPI": {
    "name": "eXp World Holdings, Inc.",
    "industry": "Real Estate Services",
    "summary": "eXp World Holdings, Inc., together with its subsidiaries, provides cloud-based real estate brokerage services for residential homeowners and homebuyers. It operates through three segments: North American Realty, International Realty, and Other Affiliated Services. The company acts as a licensed brok..."
  },
  "MRVL": {
    "name": "Marvell Technology, Inc.",
    "industry": "Semiconductors",
    "summary": "Marvell Technology, Inc., together with its subsidiaries, provides data infrastructure semiconductor solutions, spanning the data center core to network edge. The company develops and scales system-on-a-chip architectures, integrating analog, mixed-signal, and digital signal processing functionality..."
  },
  "EOSE": {
    "name": "Eos Energy Enterprises, Inc.",
    "industry": "Electrical Equipment & Parts",
    "summary": "Eos Energy Enterprises, Inc. designs, develops, manufactures, and markets energy storage solutions for utility-scale, microgrid, and commercial and industrial applications in the United States. The company offers Znyth technology battery energy storage system (BESS), which provides the operating fle..."
  },
  "TAP": {
    "name": "Molson Coors Beverage Company",
    "industry": "Beverages - Brewers",
    "summary": "Molson Coors Beverage Company manufactures, markets, and sells beer and other malt beverage products in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers flavored malt beverages including hard seltzers, craft, spirits, and ready to drink beverages. It provides i..."
  },
  "TER": {
    "name": "Teradyne, Inc.",
    "industry": "Semiconductor Equipment & Materials",
    "summary": "Teradyne, Inc. designs, develops, manufactures, and sells automated test systems and robotics products in the United States, Asia Pacific, Europe, the Middle East, and Africa. It operates through Semiconductor Test, Robotics, and Other segments. The Semiconductor Test segment offers products and ser..."
  },
  "GNRC": {
    "name": "Generac Holdlings Inc.",
    "industry": "Specialty Industrial Machinery",
    "summary": "Generac Holdings Inc. designs, manufactures, and distributes energy technology products and solution worldwide. The company offers residential automatic standby generators, automatic transfer switch, air-cooled engine residential standby generators, and liquid-cooled engine generators; Mobile Link, ..."
  },
  "DVA": {
    "name": "DaVita Inc.",
    "industry": "Medical Care Facilities",
    "summary": "DaVita Inc. provides kidney dialysis services for patients suffering from chronic kidney failure in the United States. The company operates kidney dialysis centers and provides related lab services in outpatient dialysis centers. It also offers outpatient, hospital inpatient, and home-based hemodial..."
  },
  "ALMS": {
    "name": "Alumis Inc.",
    "industry": "Biotechnology",
    "summary": "Alumis Inc., a clinical stage biopharmaceutical company, focuses on the development and commercialization of medicines for autoimmune disorders. The company's clinical asset comprises ESK-001, an allosteric tyrosine kinase 2 (TYK2) inhibitor for the treatment of plaque psoriasis and systemic lupus e..."
  },
  "STX": {
    "name": "Seagate Technology Holdings PLC",
    "industry": "Computer Hardware",
    "summary": "Seagate Technology Holdings plc engages in the provision of data storage technology and infrastructure solutions in Singapore, the United States, the Netherlands, and internationally. The company offers mass capacity storage products, including enterprise nearline hard disk drives (HDDs), enterprise..."
  },
  "FLY": {
    "name": "Firefly Aerospace Inc.",
    "industry": "Aerospace & Defense",
    "summary": "Firefly Aerospace Inc. operates as a space and defense technology company and provides mission solutions for national security, government, and commercial customers. The company offers integrated launch and space services technology that is committed to enabling launch, transit, and operations in sp..."
  },
  "CSGP": {
    "name": "CoStar Group, Inc.",
    "industry": "Real Estate Services",
    "summary": "CoStar Group, Inc. provides information, analytics, and online marketplace services in the United States, Canada, Europe, the Asia Pacific, and Latin America. It offers CoStar Property that provides inventory of office, industrial, retail, multifamily, hospitality, and student housing properties and..."
  },
  "AEO": {
    "name": "American Eagle Outfitters, Inc.",
    "industry": "Apparel Retail",
    "summary": "American Eagle Outfitters, Inc. operates as a multi-brand specialty retailer in the United States and internationally. The company provides jeans, apparel and accessories, and personal care products for women and men under the American Eagle brand; and intimates, apparel, activewear, and swim collec..."
  },
  "BIRK": {
    "name": "Birkenstock Holding plc",
    "industry": "Footwear & Accessories",
    "summary": "Birkenstock Holding plc engages in the manufacture and sale of footwear products in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It offers footbed-based products, including sandals and closed-toe shoes; and skincare products and accessories. The company sells its products thr..."
  },
  "BOTZ": {
    "name": "Global X Robotics & Artificial ",
    "industry": "",
    "summary": "The fund invests at least 80% of its total assets in the securities of the underlying index. The underlying index is designed to provide exposure to exchange-listed companies in developed markets that are involved in the development of robotics and/or artificial intelligence as defined by Indxx, the..."
  },
  "JOBY": {
    "name": "Joby Aviation, Inc.",
    "industry": "Airports & Air Services",
    "summary": "Joby Aviation, Inc., a vertically integrated air mobility company, engages in building an electric vertical takeoff and landing aircraft optimized to deliver air transportation as a service in the United States and Dubai. The company intends to build an aerial ridesharing service, as well as develop..."
  },
  "EBAY": {
    "name": "eBay Inc.",
    "industry": "Internet Retail",
    "summary": "eBay Inc., together with its subsidiaries, operates marketplace platforms that connect buyers and sellers in the United States, the United Kingdom, China, Germany, and internationally. The company's marketplace platform includes its online marketplace at ebay.com, off-platform businesses, and the eB..."
  },
  "MTA": {
    "name": "Metalla Royalty & Streaming Ltd",
    "industry": "Other Precious Metals & Mining",
    "summary": "Metalla Royalty & Streaming Ltd., a precious metals royalty and streaming company, engages in the acquisition and management of gold, silver, copper royalties, streams, and related production-based interests in Canada. The company operates in Australia, Argentina, Mexico, Canada, Tanzania, Ecuador, ..."
  },
  "AES": {
    "name": "The AES Corporation",
    "industry": "Utilities - Diversified",
    "summary": "The AES Corporation, together with its subsidiaries, operates as a power generation and utility company in the United States and internationally. The company owns and/or operates power plants to generate and sell power to customers, such as utilities, industrial users, and other intermediaries; owns..."
  },
  "SE": {
    "name": "Sea Limited",
    "industry": "Internet Retail",
    "summary": "Sea Limited, through its subsidiaries, operates as a consumer internet company in Southeast Asia, Latin America, the rest of Asia, and internationally. The company operates through E-commerce, Digital financial services, and Digital entertainment segments. It offers Garena, a digital entertainment p..."
  },
  "CCJ": {
    "name": "Cameco Corporation",
    "industry": "Uranium",
    "summary": "Cameco Corporation provides uranium for the generation of electricity. It operates through three segments: Uranium, Fuel Services, and Westinghouse. The Uranium segment engages in the exploration for, mining, milling, purchase, and sale of uranium concentrate. The Fuel Services segment is involved i..."
  },
  "MAS": {
    "name": "Masco Corporation",
    "industry": "Building Products & Equipment",
    "summary": "Masco Corporation provides home improvement and building products in North America, Europe, and internationally. The company's Plumbing Products segment offers faucets, showerheads, handheld showers, valves, bath hardware and accessories, bathing units, shower bases and enclosures, shower drains, st..."
  },
  "BIIB": {
    "name": "Biogen Inc.",
    "industry": "Drug Manufacturers - General",
    "summary": "Biogen Inc. discovers, develops, manufactures, and delivers therapies in the United States, Europe, Germany, Asia, and internationally. The company provides TECFIDERA, VUMERITY, AVONEX, PLEGRIDY, and TYSABRI for multiple sclerosis (MS); SPINRAZA for spinal muscular atrophy; SKYCLARYS to treat Friedr..."
  },
  "SNDK": {
    "name": "Sandisk Corporation",
    "industry": "Computer Hardware",
    "summary": "Sandisk Corporation develops, manufactures, and sells data storage devices and solutions using NAND flash technology in the United States, Europe, the Middle East, Africa, Asia, and internationally. The company offers solid state drives for desktop and notebook PCs, gaming consoles, and set top boxe..."
  },
  "ZIM": {
    "name": "ZIM Integrated Shipping Service",
    "industry": "Marine Shipping",
    "summary": "ZIM Integrated Shipping Services Ltd., together with its subsidiaries, provides container shipping and related services in Israel and internationally. The company offers door-to-door and port-to-port transportation services for various types of customers, including end-users, consolidators, and frei..."
  },
  "APP": {
    "name": "Applovin Corporation",
    "industry": "Advertising Agencies",
    "summary": "AppLovin Corporation engages in building a software-based platform for advertisers to enhance the marketing and monetization of their content in the United States and internationally. It operates through two segments, Advertising and Apps. The company offers AppDiscovery, an advertising solution, wh..."
  },
  "NEM": {
    "name": "Newmont Corporation",
    "industry": "Gold",
    "summary": "Newmont Corporation engages in the production and exploration of gold properties. It also explores for copper, silver, zinc, lead, and other metals. The company has operations and/or assets in the United States, Canada, Mexico, Dominican Republic, Peru, Suriname, Argentina, Chile, Australia, Papua N..."
  },
  "IBM": {
    "name": "International Business Machines",
    "industry": "Information Technology Services",
    "summary": "International Business Machines Corporation, together with its subsidiaries, provides integrated solutions and services in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It operates through Software, Consulting, Infrastructure, and Financing segments. The Software segment offer..."
  },
  "CVX": {
    "name": "Chevron Corporation",
    "industry": "Oil & Gas Integrated",
    "summary": "Chevron Corporation, through its subsidiaries, engages in the integrated energy and chemicals operations in the United States and internationally. The company operates in two segments, Upstream and Downstream. The Upstream segment engages in the exploration, development, production, and transportati..."
  },
  "TRP": {
    "name": "TC Energy Corporation",
    "industry": "Oil & Gas Midstream",
    "summary": "TC Energy Corporation operates as an energy infrastructure company in North America. It operates through four segments: Canadian Natural Gas Pipelines; U.S. Natural Gas Pipelines; Mexico Natural Gas Pipelines; and Power and Energy Solutions. The company builds and operates a network of 93,700 kilome..."
  },
  "CRCL": {
    "name": "Circle Internet Group, Inc.",
    "industry": "Capital Markets",
    "summary": "Circle Internet Group, Inc. operates as a platform, network, and market infrastructure for stablecoin and blockchain applications. The company provides a suite of stablecoins and related products that include a network utility and application platform for organizations to benefit from stablecoins an..."
  },
  "BRKR": {
    "name": "Bruker Corporation",
    "industry": "Medical Devices",
    "summary": "Bruker Corporation, together with its subsidiaries, develops, manufactures, and distributes scientific instruments, and analytical and diagnostic solutions in the United States, Europe, the Asia Pacific, and internationally. The company operates through four segments: Bruker Scientific Instruments (..."
  },
  "UAL": {
    "name": "United Airlines Holdings, Inc.",
    "industry": "Airlines",
    "summary": "United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in the United States, Canada, Atlantic, the Pacific, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers ground handling, flight academy, fre..."
  },
  "DIOD": {
    "name": "Diodes Incorporated",
    "industry": "Semiconductors",
    "summary": "Diodes Incorporated, together with its subsidiaries, manufactures and supplies application-specific standard products in the broad discrete, logic, analog, and mixed-signal semiconductor markets in Asia, Europe, and the Americas. The company offers discrete semiconductor products, such as MOSFETs, S..."
  },
  "MCHP": {
    "name": "Microchip Technology Incorporat",
    "industry": "Semiconductors",
    "summary": "Microchip Technology Incorporated develops, manufactures, and sells smart, connected, and secure embedded control solutions in the Americas, Europe, and Asia. It operates through two segments, Semiconductor Products and Technology Licensing. The company offers general purpose 8-bit, 16-bit, 32-bit, ..."
  },
  "APH": {
    "name": "Amphenol Corporation",
    "industry": "Electronic Components",
    "summary": "Amphenol Corporation, together with its subsidiaries, designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect an..."
  },
  "AUR": {
    "name": "Aurora Innovation, Inc.",
    "industry": "Information Technology Services",
    "summary": "Aurora Innovation, Inc. operates as a self-driving technology company in the United States. It focuses on developing Aurora Driver, a platform that brings a suite of self-driving hardware, software, and data services together to adapt and interoperate various vehicle types and applications. The comp..."
  },
  "DIS": {
    "name": "Walt Disney Company (The)",
    "industry": "Entertainment",
    "summary": "The Walt Disney Company operates as an entertainment company in Americas, Europe, and the Asia Pacific. It operates in three segments: Entertainment, Sports, and Experiences. The company produces and distributes film and television content under the ABC Television Network, Disney, Freeform, FX, Fox,..."
  },
  "TTD": {
    "name": "The Trade Desk, Inc.",
    "industry": "Advertising Agencies",
    "summary": "The Trade Desk, Inc. operates as a technology company in the United States and internationally. The company offers a self-service cloud-based ad-buying platform that allows buyers to plan, manage, optimize, and measure data-driven digital advertising campaigns across various ad formats and channels,..."
  },
  "MPLX": {
    "name": "MPLX LP",
    "industry": "Oil & Gas Midstream",
    "summary": "MPLX LP owns and operates midstream energy infrastructure and logistics assets primarily in the United States. It operates in two segments, Crude Oil and Products Logistics; and Natural Gas and NGL Services. The company is involved in the gathering, processing, and transportation of natural gas; gat..."
  },
  "PLSE": {
    "name": "Pulse Biosciences, Inc",
    "industry": "Medical Instruments & Supplies",
    "summary": "Pulse Biosciences, Inc. operates as a novel bioelectric medicine company. It offers CellFX System, a novel Nanosecond Pulsed-Field Ablation delivery platform to treat benign lesions of the skin; CellFX nsPFA Percutaneous Electrode system for soft tissue ablation in surgical setting; CellFX nsPFA Car..."
  },
  "NXPI": {
    "name": "NXP Semiconductors N.V.",
    "industry": "Semiconductors",
    "summary": "NXP Semiconductors N.V. provides semiconductor products in China, the United States, Germany, Japan, Singapore, South Korea, Mexico, the Netherlands, Taiwan, and internationally. The company's product portfolio includes microcontrollers; application processors; communication processors; wireless con..."
  },
  "TSCO": {
    "name": "Tractor Supply Company",
    "industry": "Specialty Retail",
    "summary": "Tractor Supply Company operates as a rural lifestyle retailer in the United States. The company offers various merchandise, including livestock and equine feed and equipment, poultry, fencing, and sprayers and chemicals; companion animal products, such as food, treats, and equipment for dogs, cats, ..."
  },
  "ALK": {
    "name": "Alaska Air Group, Inc.",
    "industry": "Airlines",
    "summary": "Alaska Air Group, Inc., through its subsidiaries, operates airlines. It operates through three segments: Alaska Airlines, Hawaiian Airlines, and Regional. The company offers scheduled air transportation services on Boeing jet aircraft for passengers and cargo in the United States, and in parts of Ca..."
  },
  "BMRN": {
    "name": "BioMarin Pharmaceutical Inc.",
    "industry": "Biotechnology",
    "summary": "BioMarin Pharmaceutical Inc., a biotechnology company, engages in the development and commercialization of therapies for life-threatening rare diseases and medical conditions in the United States, Europe, Latin America, the Middle East, the Asia Pacific, and internationally. The company's products i..."
  },
  "FCX": {
    "name": "Freeport-McMoRan, Inc.",
    "industry": "Copper",
    "summary": "Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita..."
  },
  "COP": {
    "name": "ConocoPhillips",
    "industry": "Oil & Gas E&P",
    "summary": "ConocoPhillips explores for, produces, transports, and markets crude oil, bitumen, natural gas, liquefied natural gas (LNG), and natural gas liquids. The company operates in six segments: Alaska; Lower 48; Canada; Europe, Middle East and North Africa; Asia Pacific; and Other International. The compa..."
  },
  "MO": {
    "name": "Altria Group, Inc.",
    "industry": "Tobacco",
    "summary": "Altria Group, Inc., through its subsidiaries, manufactures and sells smokeable and oral tobacco products in the United States. The company offers cigarettes primarily under the Marlboro brand; large cigars and pipe tobacco under the Black & Mild brand; moist smokeless tobacco and oral tobacco produc..."
  },
  "XPEV": {
    "name": "XPeng Inc.",
    "industry": "Auto Manufacturers",
    "summary": "XPeng Inc. designs, develops, manufactures, and markets smart electric vehicles (EVs) in the People's Republic of China. The company offers P7 and P7i, a four-door sports sedan; G9, a smart EV and a mid- to large-sized sport utility vehicle (SUV); G6, a smart EV and a coupe SUV; X9, Smart EV and a l..."
  },
  "FNF": {
    "name": "Fidelity National Financial, In",
    "industry": "Insurance - Specialty",
    "summary": "Fidelity National Financial, Inc., together with its subsidiaries, provides various insurance products in the United States. The company operates through Title, F&G, and Corporate and Other segments. It offers title insurance, escrow, and other title related services, including trust activities, tru..."
  },
  "ASML": {
    "name": "ASML Holding N.V. - New York Re",
    "industry": "Semiconductor Equipment & Materials",
    "summary": "ASML Holding N.V. provides lithography solutions for the development, production, marketing, sales, upgrading, and servicing of advanced semiconductor equipment systems. It offers lithography, metrology, and inspection systems. The company also provides extreme ultraviolet lithography systems; and d..."
  },
  "UUUU": {
    "name": "Energy Fuels Inc",
    "industry": "Uranium",
    "summary": "Energy Fuels Inc., together with its subsidiaries, engages in the exploration, recovery, recycling, exploration, operation, development, permitting, evaluation, and sale of uranium mineral properties in the United States. It produces and sells vanadium pentoxide, rare earth elements, carbonate, and ..."
  },
  "TFPM": {
    "name": "Triple Flag Precious Metals Cor",
    "industry": "Other Precious Metals & Mining",
    "summary": "Triple Flag Precious Metals Corp., a precious metals streaming and royalty company, engages in acquiring and managing precious metals, streams, royalties, and other mineral interests in Australia, Canada, Colombia, Cote d'Ivoire, Honduras, Mexico, Mongolia, Peru, South Africa, and the United States...."
  },
  "KVUE": {
    "name": "Kenvue Inc.",
    "industry": "Household & Personal Products",
    "summary": "Kenvue Inc. operates as a consumer health company in the United States, Europe, the Middle East, Africa, Asia-Pacific, and Latin America. It operates through three segments: Self Care, Skin Health and Beauty, and Essential Health. The Self Care segment offers cough, cold and allergy, pain care, dige..."
  },
  "DLO": {
    "name": "DLocal Limited",
    "industry": "Software - Infrastructure",
    "summary": "DLocal Limited, together with its subsidiaries, operates a payment processing platform worldwide. The company offers a robust pay-in solution that allows businesses to get paid for their products and services through various payment methods, including international and local cards, online bank trans..."
  },
  "GOLD": {
    "name": "Gold.com, Inc.",
    "industry": "Capital Markets",
    "summary": "Gold.com, Inc., together with its subsidiaries, operates as a precious metals company. It operates through three segments: Wholesale Sales & Ancillary Services, Direct-to-Consumer, and Secured Lending. The Wholesale Sales & Ancillary Services segment sells gold, silver, platinum, and palladium in th..."
  },
  "QMCO": {
    "name": "Quantum Corporation",
    "industry": "Computer Hardware",
    "summary": "Quantum Corporation provides products for storing and managing digital video and unstructured data in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers Myriad All-Flash File and Object Storage for enterprise unstructured data applications such as AI, machine lea..."
  },
  "CRM": {
    "name": "Salesforce, Inc.",
    "industry": "Software - Application",
    "summary": "Salesforce, Inc. provides customer relationship management technology that connects companies and customers together worldwide. The company offers Agentforce, an agentic layer of the salesforce platform; Data Cloud, a data engine; Industries AI for creating industry-specific AI agents with Agentforc..."
  },
  "ES": {
    "name": "Eversource Energy (D/B/A)",
    "industry": "Utilities - Regulated Electric",
    "summary": "Eversource Energy, a public utility holding company, engages in the energy delivery business. The company operates through Electric Distribution, Electric Transmission, Natural Gas Distribution, and Water Distribution segments. It is involved in the transmission and distribution of electricity; sola..."
  },
  "SOUN": {
    "name": "SoundHound AI, Inc.",
    "industry": "Software - Application",
    "summary": "SoundHound AI, Inc. develops independent voice artificial intelligence (AI) solutions that enables businesses across automotive, TV, and IoT, and to customer service industries to deliver high-quality conversational experiences to their customers in the United States, Korea, France, Japan, Germany, ..."
  },
  "XHB": {
    "name": "State Street SPDR S&P Homebuild",
    "industry": "",
    "summary": "In seeking to track the performance of the S&P Homebuilders Select Industry Index (the \"index\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the homebuilders segment o..."
  },
  "DHR": {
    "name": "Danaher Corporation",
    "industry": "Diagnostics & Research",
    "summary": "Danaher Corporation designs, manufactures, and markets professional, medical, research, and industrial products and services in the United States, China, and internationally. It operates through Biotechnology, Life Sciences, and Diagnostics segments. The Biotechnology segment provides bioprocessing ..."
  },
  "TGB": {
    "name": "Taseko Mines, Ltd.",
    "industry": "Copper",
    "summary": "Taseko Mines Limited, a mining company, acquires, develops, and operates mineral properties. It explores for copper, molybdenum, gold, niobium, and silver deposits. The company's principal assets consist of 100% owned the Gibraltar mine located in central British Columbia; and the Florence Copper pr..."
  },
  "CLPT": {
    "name": "ClearPoint Neuro Inc.",
    "industry": "Medical Devices",
    "summary": "ClearPoint Neuro, Inc. operates as a medical device company primarily in the United States. It develops and commercializes platforms for performing minimally invasive surgical procedures in the brain under magnetic resonance imaging guided interventions. The company offers ClearPoint system, an inte..."
  },
  "CF": {
    "name": "CF Industries Holdings, Inc.",
    "industry": "Agricultural Inputs",
    "summary": "CF Industries Holdings, Inc., together with its subsidiaries, engages in the manufacture and sale of hydrogen and nitrogen products for energy, fertilizer, emissions abatement, and other industrial activities in North America, Europe, and internationally. The company operates through Ammonia, Granul..."
  },
  "XLP": {
    "name": "State Street Consumer Staples S",
    "industry": "",
    "summary": "In seeking to track the performance of the index, the fund employs a replication strategy. It generally invests substantially all, but at least 95%, of its total assets in the securities comprising the index. The index includes companies that have been identified as Consumer Staples companies by the..."
  },
  "ROST": {
    "name": "Ross Stores, Inc.",
    "industry": "Apparel Retail",
    "summary": "Ross Stores, Inc., together with its subsidiaries, operates off-price retail apparel and home fashion stores under the Ross Dress for Less and dd's DISCOUNTS brands in the United States. The company offers apparel, accessories, footwear, and home fashions products. It sells its products to middle in..."
  },
  "NSC": {
    "name": "Norfolk Southern Corporation",
    "industry": "Railroads",
    "summary": "Norfolk Southern Corporation, together with its subsidiaries, engages in the rail transportation of raw materials, intermediate products, and finished goods in the United States. The company transports agriculture, forest, and consumer products comprising soybeans, wheat, corn, fertilizers, livestoc..."
  },
  "UEC": {
    "name": "Uranium Energy Corp.",
    "industry": "Uranium",
    "summary": "Uranium Energy Corp., together with its subsidiaries, engages in exploration, pre-extraction, extraction, and processing of uranium and titanium concentrates properties in the United States, Canada, and the Republic of Paraguay. The company was formerly known as Carlin Gold Inc. and changed its name..."
  },
  "PATH": {
    "name": "UiPath, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "UiPath, Inc. provides an end-to-end automation platform that offers a range of robotic process automation (RPA) solutions primarily in the United States, Romania, the United Kingdom, the Netherlands, and internationally. The company delivers software robots that emulate human actions with precision ..."
  },
  "BWA": {
    "name": "BorgWarner Inc.",
    "industry": "Auto Parts",
    "summary": "BorgWarner Inc., together with its subsidiaries, provides solutions for combustion, hybrid, and electric vehicles worldwide. It offers turbochargers, eBoosters, eTurbos, emissions systems, thermal systems, gasoline ignition technology, smart remote actuators, powertrain sensors, cabin heaters, and b..."
  },
  "BAH": {
    "name": "Booz Allen Hamilton Holding Cor",
    "industry": "Consulting Services",
    "summary": "Booz Allen Hamilton Holding Corporation, a technology company, provides technology solutions using artificial intelligence, cyber, and other technologies for government's cabinet-level departments and commercial customers in the United States and internationally. The company offers artificial intell..."
  },
  "PAGS": {
    "name": "PagSeguro Digital Ltd.",
    "industry": "Software - Infrastructure",
    "summary": "PagSeguro Digital Ltd., together with its subsidiaries, engages in the provision of financial and payment solutions for consumers, individual entrepreneurs, micro-merchants, and small and medium-sized companies in Brazil and internationally. It provides digital banking solutions, including deposits,..."
  },
  "OKE": {
    "name": "ONEOK, Inc.",
    "industry": "Oil & Gas Midstream",
    "summary": "ONEOK, Inc. operates as a midstream service provider of gathering, processing, fractionation, transportation, storage, and marine export services in the United States. It operates in four segments: Natural Gas Gathering and Processing; Natural Gas Liquids; Natural Gas Pipelines; and Refined Products..."
  },
  "DDOG": {
    "name": "Datadog, Inc.",
    "industry": "Software - Application",
    "summary": "Datadog, Inc. operates an observability and security platform for cloud applications in the United States and internationally. The company's products comprise infrastructure and application performance monitoring, log management, digital experience monitoring, continuous profiler, database monitorin..."
  },
  "FCEL": {
    "name": "FuelCell Energy, Inc.",
    "industry": "Electrical Equipment & Parts",
    "summary": "FuelCell Energy, Inc., together with its subsidiaries, engages in the design, development, production, construction, operation, and servicing of high temperature fuel cells for clean electric power generation. The company engages in the provision of carbonate fuel cell technology; and commercializat..."
  },
  "KMI": {
    "name": "Kinder Morgan, Inc.",
    "industry": "Oil & Gas Midstream",
    "summary": "Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and st..."
  },
  "LYFT": {
    "name": "Lyft, Inc.",
    "industry": "Software - Application",
    "summary": "Lyft, Inc. operates a peer-to-peer marketplace for on-demand ridesharing in the United States and Canada. The company operates multimodal transportation networks that offer access to various transportation options through the Lyft platform and mobile-based applications. Its platform provides a rides..."
  },
  "AOS": {
    "name": "A.O. Smith Corporation",
    "industry": "Specialty Industrial Machinery",
    "summary": "A. O. Smith Corporation manufactures and markets residential and commercial gas and electric water heaters, boilers, heat pumps, tanks, and water treatment products in North America, China, Europe, and India. The company offers water heaters for residences, restaurants, hotels, office buildings, lau..."
  },
  "URI": {
    "name": "United Rentals, Inc.",
    "industry": "Rental & Leasing Services",
    "summary": "United Rentals, Inc., through its subsidiaries, operates as an equipment rental company in the United States, Canada, Europe, Australia, and New Zealand. It operates through two segments, General Rentals and Specialty. The General Rentals segment rents general construction and industrial equipment, ..."
  },
  "IPX": {
    "name": "IperionX Limited",
    "industry": "Other Industrial Metals & Mining",
    "summary": "IperionX Limited engages in the development of its mineral properties in the United States. It holds a 100% interest in the critical minerals Titan project, which has resources of titanium, zircon, and rare earth mineral resources in Tennessee, the United States. The company also engages in the prod..."
  },
  "GNOM": {
    "name": "Global X Genomics & Biotechnolo",
    "industry": "",
    "summary": "The fund invests at least 80% of its total assets in the securities of the underlying index. The underlying index is designed to provide exposure to exchange-listed companies that are positioned to benefit from further advances in the field of genomic science and biotechnology, as well as applicatio..."
  },
  "IHI": {
    "name": "iShares U.S. Medical Devices ET",
    "industry": "",
    "summary": "The fund seeks to track the investment results of the Dow Jones U.S. Select Medical Equipment Index, which measures the performance of the medical equipment sector of the U.S. equity market, as defined by S&P Dow Jones Indices LLC. The index includes medical equipment companies, including manufactur..."
  },
  "GTLB": {
    "name": "GitLab Inc.",
    "industry": "Software - Infrastructure",
    "summary": "GitLab Inc., together with its subsidiaries, develops software for the software development lifecycle in the United States, Europe, and the Asia Pacific. The company provides GitLab that covers various stages of the DevSecOps lifecycle, including project planning, source code management, integration..."
  },
  "GLD": {
    "name": "SPDR Gold Shares",
    "industry": "",
    "summary": "The Trust holds gold bars and from time to time, issues Baskets in exchange for deposits of gold and distributes gold in connection with redemptions of Baskets. The investment objective of the Trust is for the Shares to reflect the performance of the price of gold bullion, less the Trust’s expenses...."
  },
  "TTE": {
    "name": "TotalEnergies SE",
    "industry": "Oil & Gas Integrated",
    "summary": "TotalEnergies SE, a multi-energy company, produces and markets oil and biofuels, natural and green gas, biogas and low-carbon hydrogen, renewables, and electricity in France, rest of Europe, North America, Africa, and internationally. It operates through five segments: Exploration & Production, Inte..."
  },
  "LULU": {
    "name": "lululemon athletica inc.",
    "industry": "Apparel Retail",
    "summary": "lululemon athletica inc., together with its subsidiaries, designs, distributes, and retails technical athletic apparel, footwear, and accessories for women and men under the lululemon brand in the United States, Canada, Mexico, China Mainland, Hong Kong, Taiwan, Macau, and internationally. The compa..."
  },
  "FTNT": {
    "name": "Fortinet, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Fortinet, Inc. provides cybersecurity and convergence of networking and security solutions worldwide. The company offers secure networking solutions that focus on the convergence of networking and security; network firewall solutions, which consist of FortiGate data centers, hyperscale, and distribu..."
  },
  "NVDA": {
    "name": "NVIDIA Corporation",
    "industry": "Semiconductors",
    "summary": "NVIDIA Corporation, a computing infrastructure company, provides graphics and compute and networking solutions in the United States, Singapore, Taiwan, China, Hong Kong, and internationally. The Compute & Networking segment includes its Data Centre accelerated computing platforms and artificial inte..."
  },
  "NVR": {
    "name": "NVR, Inc.",
    "industry": "Residential Construction",
    "summary": "NVR, Inc. operates as a homebuilder in the United States. The company operates through, Homebuilding and Mortgage Banking segments. It engages in the construction and sale of single-family detached homes, townhomes, and condominium buildings under the Ryan Homes, NVHomes, and Heartland Homes names. ..."
  },
  "TLT": {
    "name": "iShares 20+ Year Treasury Bond ",
    "industry": "",
    "summary": "The fund will invest at least 80% of its assets in the component securities of the underlying index, and it will invest at least 90% of its assets in U.S. Treasury securities that the advisor believes will help the fund track the underlying index. The underlying index measures the performance of pub..."
  },
  "CFLT": {
    "name": "Confluent, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Confluent, Inc. operates a data streaming platform in the United States and internationally. The company provides platforms that allow customers to connect their applications, systems, and data layers comprising Confluent Cloud, a managed cloud-native software-as-a-service (SaaS); and Confluent Plat..."
  },
  "LEVI": {
    "name": "Levi Strauss & Co",
    "industry": "Apparel Manufacturing",
    "summary": "Levi Strauss & Co. designs, markets, and sells apparels and related accessories for men, women, and children in the United States and internationally. The company offers jeans, casual and dress pants, activewears, tops, shorts, skirts, dresses, jumpsuits, shirts, sweaters, jackets, footwear, and rel..."
  },
  "UPWK": {
    "name": "Upwork Inc.",
    "industry": "Internet Content & Information",
    "summary": "Upwork Inc., together with its subsidiaries, operates a work marketplace that connects businesses with various independent professionals and agencies in the United States, India, the Philippines, and internationally. The company's work marketplace provides access to talent with various skills across..."
  },
  "VFC": {
    "name": "V.F. Corporation",
    "industry": "Apparel Manufacturing",
    "summary": "V.F. Corporation, together with its subsidiaries, offers branded apparel, footwear, and accessories for men, women, and children in the Americas, Europe, and the Asia-Pacific. It operates through three segments: Outdoor, Active, and Work. The company provides outdoor apparel, footwear, equipment, ac..."
  },
  "AVAV": {
    "name": "AeroVironment, Inc.",
    "industry": "Aerospace & Defense",
    "summary": "AeroVironment, Inc. designs, develops, produces, delivers, and supports a portfolio of robotic systems and related services for government agencies and businesses in the United States and internationally. It operates in two segments, Autonomous Systems; and Space, Cyber and Directed Energy. The comp..."
  },
  "HAL": {
    "name": "Halliburton Company",
    "industry": "Oil & Gas Equipment & Services",
    "summary": "Halliburton Company provides products and services to the energy industry worldwide. It operates in two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; c..."
  },
  "STZ": {
    "name": "Constellation Brands, Inc.",
    "industry": "Beverages - Brewers",
    "summary": "Constellation Brands, Inc., together with its subsidiaries, produces, imports, markets, and sells beer, wine, and spirits in the United States, Canada, Mexico, New Zealand, and Italy. The company offers beer under the Corona Extra, Corona Familiar, Corona Hard Seltzer, Corona Light, Corona Non-Alcoh..."
  },
  "FIS": {
    "name": "Fidelity National Information S",
    "industry": "Information Technology Services",
    "summary": "Fidelity National Information Services, Inc. engages in the provision of financial services technology solutions for financial institutions, businesses, and developers worldwide. It operates through Banking Solutions, Capital Market Solutions, and Corporate and Other segments. The company provides c..."
  },
  "LHX": {
    "name": "L3Harris Technologies, Inc.",
    "industry": "Aerospace & Defense",
    "summary": "L3Harris Technologies, Inc. provides mission-critical solutions for government and commercial customers worldwide. It operates through Space & Mission Systems (SMS), Communications & Spectrum Dominance (CSD), and Missile Solutions (MSL) segments. The SMS segment integrates satellite and payload capa..."
  },
  "TTWO": {
    "name": "Take-Two Interactive Software, ",
    "industry": "Electronic Gaming & Multimedia",
    "summary": "Take-Two Interactive Software, Inc. develops, publishes, and markets interactive entertainment solutions for consumers worldwide. The company develops and publishes action/adventure products under the Grand Theft Auto, LA Noire, Max Payne, Midnight Club, and Red Dead Redemption names, as well as oth..."
  },
  "CROX": {
    "name": "Crocs, Inc.",
    "industry": "Footwear & Accessories",
    "summary": "Crocs, Inc., together with its subsidiaries, designs, develops, manufactures, markets, distributes, and sells casual lifestyle footwear and accessories for men, women, and children under the Crocs and HEYDUDE Brands in the United States and internationally. The company offers various footwear produc..."
  },
  "OPEN": {
    "name": "Opendoor Technologies Inc",
    "industry": "Real Estate Services",
    "summary": "Opendoor Technologies Inc. operates a digital platform for residential real estate transactions in the United States. It buys and sells homes. The company offers sell to opendoor product that enables homeowners to sell their home directly to it and resell the home to a home buyer; list with opendoor..."
  },
  "CAG": {
    "name": "ConAgra Brands, Inc.",
    "industry": "Packaged Foods",
    "summary": "Conagra Brands, Inc., together with its subsidiaries, operates as a consumer packaged goods food company primarily in the United States. The company operates in four segments: Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice. The Grocery & Snacks segment primarily offers shelf..."
  },
  "SOLS": {
    "name": "Solstice Advanced Materials Inc",
    "industry": "Specialty Chemicals",
    "summary": "Solstice Advanced Materials, Inc. operates as a specialty chemicals and advanced materials company in the United States and internationally. It operates in two segments: Refrigerants & Applied Solutions (RAS), and Electronic & Specialty Materials (ESM). The RAS segment manufactures and sells low glo..."
  },
  "CSX": {
    "name": "CSX Corporation",
    "industry": "Railroads",
    "summary": "CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services in the United States and Canada. It operates through two segments: rail and trucking. The company offers rail services; and transportation of intermodal containers and trailers, as well as other tran..."
  },
  "HL": {
    "name": "Hecla Mining Company",
    "industry": "Other Precious Metals & Mining",
    "summary": "Hecla Mining Company, together with its subsidiaries, provides precious and base metals in the United States, Canada, Japan, Korea, and China. The company mines for silver, gold, lead, and zinc concentrates, as well as carbon material containing silver and gold for custom smelters, metal traders, an..."
  },
  "EPD": {
    "name": "Enterprise Products Partners L.",
    "industry": "Oil & Gas Midstream",
    "summary": "Enterprise Products Partners L.P. provides midstream energy services to producers and consumers of natural gas, natural gas liquids (NGLs), crude oil, petrochemicals, and refined products. It operates in four segments: NGL Pipelines & Services, Crude Oil Pipelines & Services, Natural Gas Pipelines &..."
  },
  "AI": {
    "name": "C3.ai, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "C3.ai, Inc. operates as an enterprise artificial intelligence application software company. The company offers C3 agentic AI platform, an application development and runtime environment that enables customers to design, develop, and deploy enterprise AI applications; C3 AI CRM Suite, a customer rela..."
  },
  "ONON": {
    "name": "On Holding AG",
    "industry": "Footwear & Accessories",
    "summary": "On Holding AG engages in the development and distribution of sports products worldwide. The company offers athletic footwear, apparel, and accessories for high-performance running, outdoor, training, all-day activities, and tennis. It offers its products through independent retailers and distributor..."
  },
  "SDGR": {
    "name": "Schrodinger, Inc.",
    "industry": "Health Information Services",
    "summary": "Schrödinger, Inc., together with its subsidiaries, develops physics-based computational platform that enables discovery of novel molecules for drug development and materials applications. The company operates in two segments, Software and Drug Discovery. The Software segment sells its software to tr..."
  },
  "GNTX": {
    "name": "Gentex Corporation",
    "industry": "Auto Parts",
    "summary": "Gentex Corporation designs, develops, manufactures, markets, and supplies digital vision, connected car, dimmable glass, and fire protection products in the United States, China, Germany, Japan, Mexico, the Republic of Korea, and internationally. It operates through Automotive Products and Other seg..."
  },
  "TEM": {
    "name": "Tempus AI, Inc.",
    "industry": "Health Information Services",
    "summary": "Tempus AI, Inc. operates as a healthcare technology company. It engages in providing next generation sequencing diagnostics, polymerase chain reaction profiling, molecular genotyping, and other anatomic and molecular pathology testing to healthcare providers, pharmaceutical companies, biotechnology ..."
  },
  "ODFL": {
    "name": "Old Dominion Freight Line, Inc.",
    "industry": "Trucking",
    "summary": "Old Dominion Freight Line, Inc. operates as a less-than-truckload motor carrier in the United States and North America. The company offers regional, inter-regional, and national less-than-truckload services, as well as expedited transportation. It also provides various value-added services, includin..."
  },
  "KR": {
    "name": "Kroger Company (The)",
    "industry": "Grocery Stores",
    "summary": "The Kroger Co. operates as a food and drug retailer in the United States. The company operates combination food and drug stores, multi-department stores, marketplace stores, and price impact warehouses. Its combination food and drug stores offer natural food and organic sections, pharmacies, general..."
  },
  "DG": {
    "name": "Dollar General Corporation",
    "industry": "Discount Stores",
    "summary": "Dollar General Corporation, a discount retailer, provides various merchandise products in the southern, southwestern, midwestern, and eastern United States. The company offers consumable products, including paper towels, bath tissues, paper dinnerware, trash and storage bags, disinfectants, and laun..."
  },
  "HIMS": {
    "name": "Hims & Hers Health, Inc.",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "summary": "Hims & Hers Health, Inc. operates a telehealth platform that connects consumers to licensed healthcare professionals in the United States, the United Kingdom, Canada, and internationally. The company offers a range of curated prescription and non-prescription health and wellness products and service..."
  },
  "QFIN": {
    "name": "Qfin Holdings, Inc.",
    "industry": "Credit Services",
    "summary": "Qfin Holdings, Inc., together with its subsidiaries, operate AI- driven credit-tech platform under the Qifu Jietiao brand in the People's Republic of China. The company provides credit-driven services that match borrowers with financial institutions to conduct borrower acquisition, credit assessment..."
  },
  "HIVE": {
    "name": "HIVE Digital Technologies Ltd",
    "industry": "Capital Markets",
    "summary": "HIVE Digital Technologies Ltd., a technology company, engages in the building and operating data centers powered by green energy in Bermuda and Paraguay. The Company operates the mining and sale of digital currencies and performance computing hosting. It also provides infrastructure solutions, such ..."
  },
  "RL": {
    "name": "Ralph Lauren Corporation",
    "industry": "Apparel Manufacturing",
    "summary": "Ralph Lauren Corporation designs, markets, and distributes lifestyle products in North America, Europe, Asia, and internationally. It offers apparel, including a range of men's, women's, and children's clothing; footwear and accessories, which comprise casual shoes, dress shoes, boots, sneakers, san..."
  },
  "ZM": {
    "name": "Zoom Communications, Inc.",
    "industry": "Software - Application",
    "summary": "Zoom Communications, Inc. provides an Artificial Intelligence-first work platform for human connection in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. The company offers Zoom Meetings that offers HD video, voice, chat, and content sharing through mobile devices, desktops, lap..."
  },
  "USAR": {
    "name": "USA Rare Earth, Inc.",
    "industry": "Other Industrial Metals & Mining",
    "summary": "USA Rare Earth, Inc. engages in mining, processing, and supplying rare earths and other critical minerals in the United States. It explores for neodymium, dysprosium, terbium, gallium, beryllium, lithium, and other critical minerals. The company holds interests in the Round Top Mountain located near..."
  },
  "SW": {
    "name": "Smurfit WestRock plc",
    "industry": "Packaging & Containers",
    "summary": "Smurfit Westrock Plc, together with its subsidiaries, manufactures, distributes, and sells containerboard, corrugated containers, and other paper-based packaging products. The company produces containerboard; packaging of corrugated containers; consumer packaging; and offers solid board, kraft paper..."
  },
  "USAS": {
    "name": "Americas Gold and Silver Corpor",
    "industry": "Other Industrial Metals & Mining",
    "summary": "Americas Gold and Silver Corporation, together with its subsidiaries, engages in the exploration, development, and production of mineral properties in the Americas. The company explores for gold, silver, zinc, lead, and other by-products. The company was formerly known as Americas Silver Corporation..."
  },
  "EOG": {
    "name": "EOG Resources, Inc.",
    "industry": "Oil & Gas E&P",
    "summary": "EOG Resources, Inc., together with its subsidiaries, explores for, develops, produces, and markets crude oil, natural gas liquids, and natural gas in producing basins in the United States, the Republic of Trinidad and Tobago, and internationally. The company was formerly known as Enron Oil & Gas Com..."
  },
  "BETA": {
    "name": "Beta Technologies, Inc.",
    "industry": "Aerospace & Defense",
    "summary": "BETA Technologies, Inc. designs, develops, and manufactures electric aircraft platform and propulsion systems for the aviation industry in the United States. The company's products include electric aircraft, advanced electric propulsion systems, charging systems, and components. It offers aircraft, ..."
  },
  "ARLO": {
    "name": "Arlo Technologies, Inc.",
    "industry": "Building Products & Equipment",
    "summary": "Arlo Technologies, Inc., together with its subsidiaries, provides cloud-based platform services in the Americas, Europe, the Middle East, Africa, and the Asia Pacific regions. The company offers Arlo Essential Cameras and Doorbells (2nd Generation) delivers smart home protection, including automated..."
  },
  "HIMX": {
    "name": "Himax Technologies, Inc.",
    "industry": "Semiconductors",
    "summary": "Himax Technologies, Inc., a fabless semiconductor company, provides display imaging processing technologies in China, Taiwan, Korea, Japan, the United States, and internationally. The company operates in two segments, Driver IC and Non-Driver Products. It offers display driver integrated circuits (I..."
  },
  "MMM": {
    "name": "3M Company",
    "industry": "Conglomerates",
    "summary": "3M Company provides diversified technology services in the America, the Asia Pacific, Europe, the Middle East, Africa, and internationally. It operates through three segments: Safety and Industrial, Transportation and Electronics, and Consumer. The Safety and Industrial segment provides industrial a..."
  },
  "TECK": {
    "name": "Teck Resources Ltd",
    "industry": "Other Industrial Metals & Mining",
    "summary": "Teck Resources Limited engages in research, exploration, development, processing, smelting, refining, and reclamation of mineral properties in Asia, the Americas, and Europe. The company operates through Copper and Zinc segments. It offers copper, zinc, and lead concentrates, as well as refined zinc..."
  },
  "nan": {
    "name": "Nuveen New York Quality Municip",
    "industry": "Asset Management",
    "summary": "Nuveen New York Quality Municipal Income Fund is a closed ended fixed income mutual fund launched by Nuveen Investments, Inc. The fund is co-managed by Nuveen Fund Advisors LLC and Nuveen Asset Management, LLC. It invests in the fixed income markets of New York. The fund invests in municipal bonds, ..."
  },
  "WPP": {
    "name": "WPP plc",
    "industry": "Advertising Agencies",
    "summary": "WPP plc, a creative transformation company, provides communications, experience, commerce, and technology services in North America, the United Kingdom, Western Continental Europe, the Asia Pacific, Latin America, Africa, the Middle East, and Central and Eastern Europe. The company operates through ..."
  },
  "HCA": {
    "name": "HCA Healthcare, Inc.",
    "industry": "Medical Care Facilities",
    "summary": "HCA Healthcare, Inc., through its subsidiaries, owns and operates hospitals and related healthcare entities in the United States. It operates general and acute care hospitals that offers medical and surgical services, including inpatient care, intensive care, cardiac care, diagnostic, and emergency ..."
  },
  "CLSK": {
    "name": "CleanSpark, Inc.",
    "industry": "Capital Markets",
    "summary": "CleanSpark, Inc. operates as a bitcoin mining company in the Americas. The company owns, leases, and operates data centers and power assets. Its infrastructure supports Bitcoin, a digital commodity. The company was formerly known as Stratean Inc. and changed its name to CleanSpark, Inc. in November ..."
  },
  "TSLA": {
    "name": "Tesla, Inc.",
    "industry": "Auto Manufacturers",
    "summary": "Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive; and Energy Generation and Storage. The company offers electric vehicles, as ..."
  },
  "BITF": {
    "name": "Bitfarms Ltd.",
    "industry": "Capital Markets",
    "summary": "Bitfarms Ltd. operates integrated bitcoin data centers in Canada, the United States, Paraguay, and Argentina. It primarily owns and operates data centers housing computers to validate transactions on the bitcoin blockchain, as well as sells computational power used for hashing calculations for crypt..."
  },
  "HLT": {
    "name": "Hilton Worldwide Holdings Inc.",
    "industry": "Lodging",
    "summary": "Hilton Worldwide Holdings Inc., a hospitality company, engages in managing, franchising, owning, and leasing hotels and resorts. It operates in two segments, Management and Franchise, and Ownership. The company engages in the hotel management and licensing of its brand names, trademarks, and service..."
  },
  "IREN": {
    "name": "IREN LIMITED",
    "industry": "Capital Markets",
    "summary": "IREN Limited operates in the vertically integrated data center business in Australia and Canada. The company owns and operates computing hardware, as well as electrical infrastructure and data centers. It also mines Bitcoin, a scarce digital asset that is created and transmitted through the operatio..."
  },
  "LYSDY": {
    "name": "Lynas Rare Earths Limited",
    "industry": "Other Industrial Metals & Mining",
    "summary": "Lynas Rare Earths Limited, together with its subsidiaries, engages in the exploration, development, mining, extraction, and processing of rare earth minerals in Australia and Malaysia. The company holds interests in the Mt Weld rare earths mine and concentration plant near Laverton in Western Austra..."
  },
  "FIGR": {
    "name": "Figure Technology Solutions, In",
    "industry": "Capital Markets",
    "summary": "Figure Technology Solutions, Inc., a financial technology company, provides blockchain-based products and solutions in the United States. The company offers a suite of blockchain-based solutions for its marketplaces, including lending, trading, and investing activities in areas, such as consumer cre..."
  },
  "CVS": {
    "name": "CVS Health Corporation",
    "industry": "Healthcare Plans",
    "summary": "CVS Health Corporation provides health solutions in the United States. It operates through Health Care Benefits, Health Services, and Pharmacy & Consumer Wellness segments. The Health Care Benefits segment offers traditional, voluntary, and consumer-directed health insurance products and related ser..."
  },
  "SMR": {
    "name": "NuScale Power Corporation",
    "industry": "Specialty Industrial Machinery",
    "summary": "NuScale Power Corporation provides small modular reactor technology solutions. It offers NuScale Power Module (NPM), a water reactor that can generate 77 megawatts of electricity (MWe). The company was founded in 2007 and is headquartered in Corvallis, Oregon."
  },
  "AG": {
    "name": "First Majestic Silver Corp.",
    "industry": "Silver",
    "summary": "First Majestic Silver Corp. engages in the acquisition, exploration, development, and production of mineral properties in North America. The company explores for silver and gold deposits. Its projects include the San Dimas silver/gold mine covering an area of approximately 71,867 hectares located in..."
  },
  "MOS": {
    "name": "Mosaic Company (The)",
    "industry": "Agricultural Inputs",
    "summary": "The Mosaic Company, through its subsidiaries, produces and markets concentrated phosphate and potash crop nutrients. It operates in three segments: Phosphates, Potash, and Mosaic Fertilizantes. The company owns and operates mines and production facilities, which produce concentrated phosphate crop n..."
  },
  "CNI": {
    "name": "Canadian National Railway Compa",
    "industry": "Railroads",
    "summary": "Canadian National Railway Company, together with its subsidiaries, engages in the rail, intermodal, trucking, and related transportation businesses in Canada and the United States. The company provides rail services, which include equipment, customs brokerage, transloading and warehousing, business ..."
  },
  "VRNS": {
    "name": "Varonis Systems, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Varonis Systems, Inc. provides software products and services that continuously discover and classify critical data, remediate exposures, and detect advanced threats with AI-powered technology in North America, Europe, APAC, and rest of worlds. The company offers Varonis Data Security Platform, a So..."
  },
  "RIG": {
    "name": "Transocean Ltd (Switzerland)",
    "industry": "Oil & Gas Drilling",
    "summary": "Transocean Ltd., together with its subsidiaries, provides offshore contract drilling services for oil and gas wells in Switzerland and internationally. The company contracts mobile offshore drilling rigs, related equipment, and work crews to drill oil and gas wells. It also operates a fleet of mobil..."
  },
  "TMHC": {
    "name": "Taylor Morrison Home Corporatio",
    "industry": "Residential Construction",
    "summary": "Taylor Morrison Home Corporation, together with its subsidiaries, operates as a land developer and homebuilder in the United States. It designs, builds, and sells single and multi-family detached and attached homes; and develops lifestyle and master-planned communities. The company also develops and..."
  },
  "FOUR": {
    "name": "Shift4 Payments, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Shift4 Payments, Inc. engages in the provision of software and payment processing solutions in the United States and internationally. The company offers payments platform, which provides omni channel card acceptance; and processing solutions across multiple payment types, including credit, debit, co..."
  },
  "TEVA": {
    "name": "Teva Pharmaceutical Industries ",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "summary": "Teva Pharmaceutical Industries Limited develops, manufactures, markets, and distributes generic and other medicines, and biopharmaceutical products in the United States, Europe, Israel, and internationally. It offers generic medicines in various dosage forms, such as tablets, capsules, injectables, ..."
  },
  "PDD": {
    "name": "PDD Holdings Inc.",
    "industry": "Internet Retail",
    "summary": "PDD Holdings Inc., a multinational commerce group that owns and operates a portfolio of businesses. It operates Pinduoduo platform which provides various product categories, including agricultural produce, apparel, shoes, bags, mother and childcare products, food and beverages, consumer electronics,..."
  },
  "BKKT": {
    "name": "Bakkt, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Bakkt, Inc. engages in building financial infrastructure. The company provides solutions that enable institutional participation in the digital asset economy  spanning Bitcoin, tokenization, stablecoin payments, and AI-driven finance. It serves client, such as financial institutions, fintechs, brok..."
  },
  "SHAK": {
    "name": "Shake Shack, Inc.",
    "industry": "Restaurants",
    "summary": "Shake Shack Inc. owns, operates, and licenses Shake Shack restaurants (Shacks) in the United States and internationally. Its Shacks offer burgers, chicken, hot dogs, crinkle cut fries, shakes, frozen custard, beer, wine, and other products. The company was founded in 2001 and is based in New York, N..."
  },
  "YMM": {
    "name": "Full Truck Alliance Co. Ltd.",
    "industry": "Software - Application",
    "summary": "Full Truck Alliance Co. Ltd., together with its subsidiaries, operates a digital freight platform that connects shippers with truckers to facilitate shipments across distance ranges, cargo weights, and types in the People's Republic of China and Hong Kong. The company offers freight matching service..."
  },
  "CPRI": {
    "name": "Capri Holdings Limited",
    "industry": "Luxury Goods",
    "summary": "Capri Holdings Limited engages in the design, marketing, distribution, and retail of branded women's and men's apparel, footwear, and accessories in the United States, Canada, Latin America, Europe, the Middle East, Africa, Asia, and the Oceania. It operates through three segments: Versace, Jimmy Ch..."
  },
  "ZBRA": {
    "name": "Zebra Technologies Corporation",
    "industry": "Communication Equipment",
    "summary": "Zebra Technologies Corporation, together with its subsidiaries, provides enterprise asset intelligence solutions in the automatic identification and data capture solutions industry worldwide. It operates in two segments, Asset Intelligence & Tracking, and Enterprise Visibility & Mobility. The compan..."
  },
  "CRH": {
    "name": "CRH PLC",
    "industry": "Building Materials",
    "summary": "CRH plc, together with its subsidiaries, provides building materials solutions in Ireland, the United States, the United Kingdom, rest of Europe, and internationally. It operates through three segments: Americas Materials Solutions, Americas Building Solutions, and International Solutions. The compa..."
  },
  "SLB": {
    "name": "SLB Limited",
    "industry": "Oil & Gas Equipment & Services",
    "summary": "SLB N.V. engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon managemen..."
  },
  "LVS": {
    "name": "Las Vegas Sands Corp.",
    "industry": "Resorts & Casinos",
    "summary": "Las Vegas Sands Corp., together with its subsidiaries, owns, develops, and operates integrated resorts in Macao and Singapore. It owns and operates The Venetian Macao Resort Hotel, The Londoner Macao, The Parisian Macao, The Plaza Macao and Four Seasons Hotel Macao, and The Sands Macao in Macao, the..."
  },
  "GILD": {
    "name": "Gilead Sciences, Inc.",
    "industry": "Drug Manufacturers - General",
    "summary": "Gilead Sciences, Inc., a biopharmaceutical company, discovers, develops, and commercializes medicines in the areas of unmet medical need in the United States, Europe, and internationally. The company provides Biktarvy, Genvoya, Descovy, Odefsey, Truvada, Complera/ Eviplera, Stribild, Sunlencs, and A..."
  },
  "DVN": {
    "name": "Devon Energy Corporation",
    "industry": "Oil & Gas E&P",
    "summary": "Devon Energy Corporation, an independent energy company, engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. It operates in Delaware Basin located in southeast New Mexico and west Texas, Eagle Ford located in North America, Anada..."
  },
  "VIPS": {
    "name": "Vipshop Holdings Limited",
    "industry": "Internet Retail",
    "summary": "Vipshop Holdings Limited operates online platforms in the People's Republic of China. It operates in Vip.com, Shan Shan Outlets, and Others segments. The company provides womenswear, menswear, sportswear and sporting goods, shoes and bags, accessories, baby and children products, skincare and cosmet..."
  },
  "MILN": {
    "name": "Global X Millennial Consumer ET",
    "industry": "",
    "summary": "The fund invests more than 80% of its total assets in the securities of the underlying index. The underlying index is designed to measure the performance of U.S. listed companies that provide exposure to the millennial generation consumption trends, (collectively, \"Millennial Companies\"), as defined..."
  },
  "RGLD": {
    "name": "Royal Gold, Inc.",
    "industry": "Gold",
    "summary": "Royal Gold, Inc., together with its subsidiaries, acquires and manages precious metal streams, royalties, and related interests. The company engages in acquiring stream and royalty interests or to finance projects that are in production, development, or in the exploration stage in exchange for strea..."
  },
  "GLW": {
    "name": "Corning Incorporated",
    "industry": "Electronic Components",
    "summary": "Corning Incorporated operates in optical communications, display technologies, environmental technologies, specialty materials, and life sciences businesses. The company provides optical fibers and cables; and hardware and equipment products, such as cable assemblies, fiber optic hardware and connec..."
  },
  "SIDU": {
    "name": "Sidus Space, Inc.",
    "industry": "Aerospace & Defense",
    "summary": "Sidus Space, Inc. engages in the design, manufacture, launch, and data collection of commercial satellite worldwide. The company's space services include satellite design and manufacturing, such as LizzieSat, LizzieSat-XL, and Lunar Lizzie. It also offers technology hosting and mission management AI..."
  },
  "ASTS": {
    "name": "AST SpaceMobile, Inc.",
    "industry": "Communication Equipment",
    "summary": "AST SpaceMobile, Inc., together with its subsidiaries, designs and develops the constellation of BlueBird satellites in the United States. The company provides a cellular broadband network in space to be accessible directly by smartphones for commercial use and other applications, as well as for gov..."
  },
  "SBUX": {
    "name": "Starbucks Corporation",
    "industry": "Restaurants",
    "summary": "Starbucks Corporation, together with its subsidiaries, operates as a roaster, marketer, and retailer of coffee internationally. The company operates through three segments: North America, International, and Channel Development. Its stores offer coffee, tea, and other beverages, roasted whole beans a..."
  },
  "DAL": {
    "name": "Delta Air Lines, Inc.",
    "industry": "Airlines",
    "summary": "Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Detroit, Minneapolis-St. Paul, and Salt Lake City, as..."
  },
  "LSCC": {
    "name": "Lattice Semiconductor Corporati",
    "industry": "Semiconductors",
    "summary": "Lattice Semiconductor Corporation, together with its subsidiaries, develops and sells semiconductor, silicon-based and silicon-enabling, evaluation boards, and development hardware products in Asia, Europe, and the Americas. The company offers field programmable gate arrays (FPGA), which are regular..."
  },
  "APA": {
    "name": "APA Corporation",
    "industry": "Oil & Gas E&P",
    "summary": "APA Corporation, an independent energy company, explores for, develops, and produces natural gas, crude oil, and natural gas liquids. It has oil and gas operations in the United States, Egypt, and North Sea. The company also has exploration and appraisal activities in Suriname, as well as holds inte..."
  },
  "DOW": {
    "name": "Dow Inc.",
    "industry": "Chemicals",
    "summary": "Dow Inc., through its subsidiaries, provides various materials science solutions for packaging, infrastructure, mobility, and consumer applications in the United States, Canada, Europe, the Middle East, Africa, India, the Asia Pacific, and Latin America. The company operates through Packaging & Spec..."
  },
  "NOW": {
    "name": "ServiceNow, Inc.",
    "industry": "Software - Application",
    "summary": "ServiceNow, Inc. provides cloud-based solution for digital workflows in the North America, Europe, the Middle East and Africa, Asia Pacific, and internationally. The company provides asset management, integrated risk management, IT service management, Operational Technology management, Security Oper..."
  },
  "SQM": {
    "name": "Sociedad Quimica y Minera S.A.",
    "industry": "Specialty Chemicals",
    "summary": "Sociedad Química y Minera de Chile S.A. produces and sells specialty plant nutrients, and iodine and its derivatives worldwide. The company offers sodium potassium nitrate, specialty blends, and other specialty fertilizers under Ultrasol, Qrop, Speedfol, Allganic, Ultrasoline, Prop, and Prohydric br..."
  },
  "CORZ": {
    "name": "Core Scientific, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Core Scientific, Inc. provides digital asset mining services in the United States. It operates through three segments: Digital Asset Self-Mining; Digital Asset Hosted Mining; and HPC Hosting. The company offers digital infrastructure, software solutions, and services; and operates licensing data cen..."
  },
  "BRBR": {
    "name": "BellRing Brands, Inc.",
    "industry": "Packaged Foods",
    "summary": "BellRing Brands, Inc., together with its subsidiaries, provides various nutrition products in the United States. The company offers ready-to-drink (RTD) protein shakes, other RTD beverages, protein powders, nutrition bars, and other products primarily under the Premier Protein and Dymatize brands. I..."
  },
  "MSFT": {
    "name": "Microsoft Corporation",
    "industry": "Software - Infrastructure",
    "summary": "Microsoft Corporation develops and supports software, services, devices, and solutions worldwide. The Productivity and Business Processes segment offers Microsoft 365 commercial, enterprise mobility + security, windows commercial, power BI, exchange, sharepoint, Microsoft teams, security and complia..."
  },
  "IOT": {
    "name": "Samsara Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Samsara Inc. provides solutions to connect physical operations data to its connected operations platform in the United States and internationally. The company's Connected Operations Platform includes Data Platform, which ingests, aggregates, and enriches data from its IoT devices and a growing ecosy..."
  },
  "SLAB": {
    "name": "Silicon Laboratories, Inc.",
    "industry": "Semiconductors",
    "summary": "Silicon Laboratories Inc., a fabless semiconductor company, provides analog-intensive mixed-signal solutions in the United States, China, Taiwan, and internationally. The company's products include wireless microcontrollers and sensor products. Its products are used in various electronic products in..."
  },
  "OKTA": {
    "name": "Okta, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Okta, Inc. operates as an identity partner in the United States and internationally. The company offers Okta's suite of products and services used to manage and secure identities, such as Single Sign-On that enables users to access applications in the cloud or on-premises from various devices; Adapt..."
  },
  "CRWV": {
    "name": "CoreWeave, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "CoreWeave, Inc. operates a cloud platform that provides scaling, support, and acceleration for GenAI. The company builds the infrastructure that supports compute workloads for enterprises. Its products include GPU compute, CPU compute, storage services, networking services, managed services, and vir..."
  },
  "DKNG": {
    "name": "DraftKings Inc.",
    "industry": "Gambling",
    "summary": "DraftKings Inc. operates as a digital sports entertainment and gaming company in the United States and internationally. It provides online sports betting, daily fantasy sports, media, digital lottery courier, media, and other products, as well as retails sportsbooks. The company also offers iGaming,..."
  },
  "SMCI": {
    "name": "Super Micro Computer, Inc.",
    "industry": "Computer Hardware",
    "summary": "Super Micro Computer, Inc., together with its subsidiaries, develops and sells server and storage solutions based on modular and open-standard architecture in the United States, Asia, Europe, and internationally. The company offers liquid and air-cooled AI servers for training and inferencing with i..."
  },
  "MLM": {
    "name": "Martin Marietta Materials, Inc.",
    "industry": "Building Materials",
    "summary": "Martin Marietta Materials, Inc., a natural resource-based building materials company, supplies aggregates and heavy-side building materials to the construction industry in the United States and internationally. It offers crushed stone, sand, and gravel products; ready mixed concrete and asphalt; pav..."
  },
  "RDW": {
    "name": "Redwire Corporation",
    "industry": "Aerospace & Defense",
    "summary": "Redwire Corporation provides critical space solutions and space infrastructure for government and commercial customers in the United States, Europe, and internationally. The company offers avionics and sensors, including star trackers and sun sensors, which are critical for navigation and control of..."
  },
  "CLOU": {
    "name": "Global X Cloud Computing ETF",
    "industry": "",
    "summary": "The fund invests at least 80% of its total assets in the securities of the underlying index and in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\") based on the securities in the underlying index. The underlying index is designed to provide exposure to exchange-listed co..."
  },
  "ARRY": {
    "name": "Array Technologies, Inc.",
    "industry": "Solar",
    "summary": "Array Technologies, Inc. manufactures and sells solar tracking technology products in the United States, Spain, Brazil, Australia, and internationally. The company operates through two segments, Array Legacy Operations and STI Operations. Its products portfolio includes DuraTrack HZ v3, a single axi..."
  },
  "EQT": {
    "name": "EQT Corporation",
    "industry": "Oil & Gas E&P",
    "summary": "EQT Corporation engages in the production, gathering, and transmission of natural gas. The company sells natural gas and natural gas liquids to marketers, utilities, and industrial customers located in the Appalachian Basin. It also provides marketing services and contractual pipeline capacity manag..."
  },
  "GPN": {
    "name": "Global Payments Inc.",
    "industry": "Specialty Business Services",
    "summary": "Global Payments Inc. provides payment technology and software solutions for card, check, and digital-based payments in the Americas, Europe, and the Asia-Pacific. It operates through two segments, Merchant Solutions and Issuer Solutions. The Merchant Solutions segment offers authorization, settlemen..."
  },
  "HBM": {
    "name": "Hudbay Minerals Inc.",
    "industry": "Copper",
    "summary": "Hudbay Minerals Inc., a diversified mining company, focuses on the exploration, development, operation, and optimization of properties in North and South America. It produces and sells copper concentrates containing copper, gold, and silver; silver/gold doré; zinc concentrates containing zinc and go..."
  },
  "PM": {
    "name": "Philip Morris International Inc",
    "industry": "Tobacco",
    "summary": "Philip Morris International Inc. operates as a tobacco company. The company offers cigarettes and smoke-free products, including heat-not-burn, e-vapor, and oral nicotine products under the IQOS, VEEV, and ZYN brands; and consumer accessories, such as lighters and matches. It also offers wellness pr..."
  },
  "KHC": {
    "name": "The Kraft Heinz Company",
    "industry": "Packaged Foods",
    "summary": "The Kraft Heinz Company, together with its subsidiaries, manufactures and markets food and beverage products in North America and internationally. Its products include condiments and sauces, cheese and dairy products, meals, meats, refreshment beverages, coffee, and other grocery products under the ..."
  },
  "LEU": {
    "name": "Centrus Energy Corp.",
    "industry": "Uranium",
    "summary": "Centrus Energy Corp. supplies nuclear fuel components for the nuclear power industry in the United States, Belgium, Japan, the Netherlands, and internationally. The company operates in two segments, Low-Enriched Uranium (LEU) and Technical Solutions. The LEU segment sells separative work units (SWU)..."
  },
  "TEX": {
    "name": "Terex Corporation",
    "industry": "Farm & Heavy Construction Machinery",
    "summary": "Terex Corporation provides materials processing machinery and mobile elevating work platform worldwide. The MP segment offers crushers, washing systems, screens, trommels, apron feeders, material handlers, pick and carry cranes, rough terrain cranes, tower cranes, wood processing, biomass and recycl..."
  },
  "WMT": {
    "name": "Walmart Inc.",
    "industry": "Discount Stores",
    "summary": "Walmart Inc. engages in the operation of retail and wholesale stores and clubs, eCommerce websites, and mobile applications worldwide. The company operates through three segments: Walmart U.S., Walmart International, and Sam's Club. It operates supercenters, supermarkets, warehouse clubs, cash and c..."
  },
  "TOL": {
    "name": "Toll Brothers, Inc.",
    "industry": "Residential Construction",
    "summary": "Toll Brothers, Inc., together with its subsidiaries, designs, builds, markets, sells, and arranges finance for a range of detached and attached homes in luxury residential communities in the United States. It designs, builds, markets, and sells condominiums through Toll Brothers City Living. The com..."
  },
  "IDR": {
    "name": "Idaho Strategic Resources, Inc.",
    "industry": "Gold",
    "summary": "Idaho Strategic Resources, Inc., a resource-based company, engages in the exploration, development, and extraction of gold, silver, and base metal mineral resources in the North Idaho. The company's portfolio of mineral properties includes the Golden Chest Mine, a producing gold mine located in the ..."
  },
  "INTC": {
    "name": "Intel Corporation",
    "industry": "Semiconductors",
    "summary": "Intel Corporation designs, develops, manufactures, markets, sells, and services computing and related end products and services in the United States, Ireland, Israel, and internationally. It operates through three segments: CCG, DCAI, and Intel Foundry. The company offers client computing group prod..."
  },
  "GRND": {
    "name": "Grindr Inc.",
    "industry": "Software - Application",
    "summary": "Grindr Inc. operates a social networking and dating application for the lesbian, gay, bisexual, transgender, and queer (LGBTQ) communities worldwide. It operates Grindr platform, a social networking platform serving and addressing the needs of gay, bisexual, and sexually explorative adults worldwide..."
  },
  "HMC": {
    "name": "Honda Motor Company, Ltd.",
    "industry": "Auto Manufacturers",
    "summary": "Honda Motor Co., Ltd. develops, manufactures, and distributes motorcycles, automobiles, and power products in Japan, North America, Europe, Asia, and internationally. It operates through four segments: Motorcycle Business, Automobile Business, Financial Services Business, and Power Product and Other..."
  },
  "PL": {
    "name": "Planet Labs PBC",
    "industry": "Aerospace & Defense",
    "summary": "Planet Labs PBC engages in the design, construction, and launch constellations of satellites with the intent of providing high cadence geospatial data delivered to customers through an online platform the United States and internationally. The company's platform offers planet monitoring, tasking, ar..."
  },
  "ZTS": {
    "name": "Zoetis Inc.",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "summary": "Zoetis Inc. engages in the discovery, development, manufacture, and commercialization of animal health medicines, vaccines, diagnostic products and services, biodevices, genetic tests, and precision animal health products in the United States and internationally. The company commercializes products ..."
  },
  "TMC": {
    "name": "TMC the metals company Inc.",
    "industry": "Other Industrial Metals & Mining",
    "summary": "TMC the metals company Inc., a deep-sea minerals exploration company, focuses on the collection, processing, and refining of polymetallic nodules found on the seafloor in California. It primarily explores for nickel, cobalt, copper, and manganese products. The company holds exploration and commercia..."
  },
  "Z": {
    "name": "Zillow Group, Inc.",
    "industry": "Internet Content & Information",
    "summary": "Zillow Group, Inc. operates real estate brands in mobile applications and Websites in the United States. The company offers premier agent and rentals marketplaces, new construction marketplaces, advertising, display advertising, and business technology solutions, as well as dotloop, a real estate tr..."
  },
  "MGM": {
    "name": "MGM Resorts International",
    "industry": "Resorts & Casinos",
    "summary": "MGM Resorts International, through its subsidiaries, operates as a gaming and entertainment company in the United States, China, and internationally. The company operates through four segments: Las Vegas Strip Resorts, Regional Operations, MGM China, and MGM Digital. It operates casino resorts that ..."
  },
  "PVH": {
    "name": "PVH Corp.",
    "industry": "Apparel Manufacturing",
    "summary": "PVH Corp., together with its subsidiaries, operates as an apparel company in the United States and internationally. The company operates through Tommy Hilfiger North America, Tommy Hilfiger International, Calvin Klein North America, Calvin Klein International, and Heritage Brands Wholesale segments...."
  },
  "DHI": {
    "name": "D.R. Horton, Inc.",
    "industry": "Residential Construction",
    "summary": "D.R. Horton, Inc. operates as a homebuilding company in East, North, Southeast, South Central, Southwest, and Northwest regions in the United States. It engages in the acquisition and development of land; and construction and sale of residential homes in 126 markets across 36 states under the names ..."
  },
  "ROK": {
    "name": "Rockwell Automation, Inc.",
    "industry": "Specialty Industrial Machinery",
    "summary": "Rockwell Automation, Inc., together with its subsidiaries, provides industrial automation and digital transformation solutions in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. It operates in three segments: Intelligent Devices, Software & Control, and Lifecycle..."
  },
  "TOST": {
    "name": "Toast, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Toast, Inc. operates a cloud-based digital technology platform for the restaurant industry in the United States, Ireland, India, and internationally. The company offers software products for restaurant operations and point of sale, such as Toast POS, team and vendor management, multi-location manage..."
  },
  "IRDM": {
    "name": "Iridium Communications Inc",
    "industry": "Telecom Services",
    "summary": "Iridium Communications Inc. provides mobile voice and data communications services and products to businesses, the United States and international governments, non-governmental organizations, and consumers worldwide. The company offers mobile satellite communications services for land mobile end use..."
  },
  "EXK": {
    "name": "Endeavour Silver Corporation",
    "industry": "Silver",
    "summary": "Endeavour Silver Corp., a silver mining company, engages in the acquisition, exploration, development, extraction, processing, refining, and reclamation of mineral properties in Mexico, Chile, Peru, and the United States. It explores for gold and silver deposits, and precious metals, as well as poly..."
  },
  "CDNS": {
    "name": "Cadence Design Systems, Inc.",
    "industry": "Software - Application",
    "summary": "Cadence Design Systems, Inc. provides software, hardware, and other services worldwide. The company offers functional verification services, such as Jasper, a formal verification platform; Xcelium, a parallel logic simulation platform; Palladium, an enterprise emulation platform; and Protium, a prot..."
  },
  "PFE": {
    "name": "Pfizer, Inc.",
    "industry": "Drug Manufacturers - General",
    "summary": "Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular and migraine under the Eliquis, Nurtec ODT/Vydura, Zavz..."
  },
  "PCAR": {
    "name": "PACCAR Inc.",
    "industry": "Farm & Heavy Construction Machinery",
    "summary": "PACCAR Inc designs, manufactures, and distributes light, medium, and heavy-duty commercial trucks in the United States, Canada, Europe, Mexico, South America, Australia, and internationally. It operates through three segments: Truck, Parts, and Financial Services. The Truck segment designs, manufact..."
  },
  "UBER": {
    "name": "Uber Technologies, Inc.",
    "industry": "Software - Application",
    "summary": "Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. It operates through three segments: Mobility, Delivery, and Freight. The Mobility segment connects consumers with a ra..."
  },
  "BILL": {
    "name": "BILL Holdings, Inc.",
    "industry": "Software - Application",
    "summary": "BILL Holdings, Inc. provides financial operations platform for small and midsize businesses worldwide. It provides software-as-a-service, cloud-based payments, and spend management products, which allow users to automate accounts payable and accounts receivable transactions, as well as enable busine..."
  },
  "DELL": {
    "name": "Dell Technologies Inc.",
    "industry": "Computer Hardware",
    "summary": "Dell Technologies Inc. designs, develops, manufactures, markets, sells, and supports various comprehensive and integrated solutions, products, and services in the Americas, Europe, the Middle East, Asia, and internationally. The company operates in two segments, Infrastructure Solutions Group (ISG) ..."
  },
  "PEP": {
    "name": "Pepsico, Inc.",
    "industry": "Beverages - Non-Alcoholic",
    "summary": "PepsiCo, Inc. engages in the manufacture, marketing, distribution, and sale of various beverages and convenient foods worldwide. The company operates through six segments: PepsiCo Foods North America; PepsiCo Beverages North America; International Beverages Franchise; Europe, Middle East and Africa;..."
  },
  "ABVX": {
    "name": "Abivax SA",
    "industry": "Biotechnology",
    "summary": "ABIVAX Société Anonyme, a clinical-stage biotechnology company, focuses on developing therapeutics that harness the body's natural regulatory mechanisms to stabilize the immune response in patients with chronic inflammatory diseases. Its lead drug candidate includes obefazimod that is in Phase 3 cli..."
  },
  "LAC": {
    "name": "Lithium Americas Corp.",
    "industry": "Other Industrial Metals & Mining",
    "summary": "Lithium Americas Corp. focuses on developing, building, and operating of lithium deposits and chemical processing facilities in the United States and Canada. Its flagship asset is the Thacker Pass project located in the McDermitt Caldera in Humboldt County, northern Nevada, as well as invests in exp..."
  },
  "SFM": {
    "name": "Sprouts Farmers Market, Inc.",
    "industry": "Grocery Stores",
    "summary": "Sprouts Farmers Market, Inc., together with its subsidiaries, engages in the retailing of fresh, natural, and organic food products in the United States. The company offers perishable product categories, including produce, meat and meat alternatives, seafood, deli, bakery, floral, and dairy and dair..."
  },
  "NIO": {
    "name": "NIO Inc.",
    "industry": "Auto Manufacturers",
    "summary": "NIO Inc. designs, develops, manufactures, and sells smart electric vehicles in China, Europe, and internationally. It offers five and six-seater electric SUVs, as well as smart electric sedans. The company also offers power solutions, including Power Home, a home charging solution; Power Swap, a bat..."
  },
  "AU": {
    "name": "AngloGold Ashanti PLC",
    "industry": "Gold",
    "summary": "AngloGold Ashanti plc operates as a gold mining company in Africa, Australia, and the Americas. It primarily explores for gold, as well as by-products, including silver and sulphuric acid. The company's flagship property includes 100% owned the Geita mine located in the Lake Victoria goldfields of t..."
  },
  "TRIP": {
    "name": "TripAdvisor, Inc.",
    "industry": "Travel Services",
    "summary": "TripAdvisor, Inc., an online travel company, engages in the provision of travel guidance products and services worldwide. The company operates through three segments: Brand Tripadvisor, Viator, and TheFork. The Brand Tripadvisor segment offers travel guidance platforms for travelers to discover, gen..."
  },
  "LCID": {
    "name": "Lucid Group, Inc.",
    "industry": "Auto Manufacturers",
    "summary": "Lucid Group, Inc., a technology company, designs, engineers, manufactures, and sells electric vehicles (EV), EV powertrains, and battery systems. It also designs and develops proprietary software in-house for Lucid vehicles. The company sells vehicles directly to consumers through its retail sales n..."
  },
  "TLN": {
    "name": "Talen Energy Corporation",
    "industry": "Utilities - Independent Power Producers",
    "summary": "Talen Energy Corporation, an independent power producer and infrastructure company, produces and sells electricity, capacity, and ancillary services into wholesale power markets in the United States. The company operates nuclear, fossil, oil, natural gas, and coal power plants. The company owns and ..."
  },
  "CMG": {
    "name": "Chipotle Mexican Grill, Inc.",
    "industry": "Restaurants",
    "summary": "Chipotle Mexican Grill, Inc., together with its subsidiaries, owns and operates Chipotle Mexican Grill restaurants. It sells food and beverages, such as burritos, burrito bowls, quesadillas, tacos, and salads, as well as kids's meals, chips, and sides. It offers Mexican-inspired meals using responsi..."
  },
  "META": {
    "name": "Meta Platforms, Inc.",
    "industry": "Internet Content & Information",
    "summary": "Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality (VR) headsets, and AI glasses in the United States, Canada, Europe, Asia-Pacific, and internationally. It operates t..."
  },
  "SHOP": {
    "name": "Shopify Inc.",
    "industry": "Software - Application",
    "summary": "Shopify Inc., a commerce technology company, provides tools to start, scale, market, and run a business of various sizes in Canada, the United States, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. The Company offers Shopify platform that enables merchants to manage products a..."
  },
  "LMT": {
    "name": "Lockheed Martin Corporation",
    "industry": "Aerospace & Defense",
    "summary": "Lockheed Martin Corporation, an aerospace and defense company, engages in the research, design, development, manufacture, integration, and sustainment of technology systems, products, and services in the United States, Europe, Asia, the Middle East, and internationally. The company operates through ..."
  },
  "KO": {
    "name": "Coca-Cola Company (The)",
    "industry": "Beverages - Non-Alcoholic",
    "summary": "The Coca-Cola Company, a beverage company, manufactures and sells various nonalcoholic beverages in the United States and internationally. The company provides sparkling soft drinks and flavors; water, sports, coffee, and tea; juice, value-added dairy, and plant-based beverages; and other beverages...."
  },
  "CGNX": {
    "name": "Cognex Corporation",
    "industry": "Scientific & Technical Instruments",
    "summary": "Cognex Corporation provides machine vision products that capture and analyze visual information to automate manufacturing and distribution tasks worldwide. Its machine vision products are used to automate the manufacturing and tracking of discrete items, including mobile phones, automotive component..."
  },
  "VUZI": {
    "name": "Vuzix Corporation",
    "industry": "Consumer Electronics",
    "summary": "Vuzix Corporation designs, manufactures, and markets artificial intelligence (AI)-powered smart glasses, waveguides, and augmented reality (AR) technologies in North America, Europe, the Asia Pacific, and internationally. The company offers smart glasses that include M Series, Vuzix Blade, Vuzix Shi..."
  },
  "COPX": {
    "name": "Global X Copper Miners ETF",
    "industry": "",
    "summary": "The fund invests at least 80% of its total assets in the securities of the underlying index and in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\") based on the securities in the underlying index. The underlying index is designed to measure broad-based equity market perf..."
  },
  "BBD": {
    "name": "Banco Bradesco Sa",
    "industry": "Banks - Regional",
    "summary": "Banco Bradesco S.A., together with its subsidiaries, provides various banking products and services in Brazil and internationally. The company operates in two segments, Banking and Insurance. It engages in banking operations, including investment, national, international, and private banking, as wel..."
  },
  "COST": {
    "name": "Costco Wholesale Corporation",
    "industry": "Discount Stores",
    "summary": "Costco Wholesale Corporation, together with its subsidiaries, engages in the operation of membership warehouses in the United States, Puerto Rico, Canada, Mexico, Japan, the United Kingdom, Korea, Australia, Taiwan, China, Spain, France, Iceland, New Zealand, and Sweden. It offers merchandise, inclu..."
  },
  "U": {
    "name": "Unity Software Inc.",
    "industry": "Software - Application",
    "summary": "Unity Software Inc. operates a platform to create and grow games and interactive experiences for mobile phones, PCs, consoles, and extended reality devices in the United States, China, Hong Kong, Taiwan, Europe, the Middle East, Africa, the Asia Pacific, Canada, and Latin America. The company's plat..."
  },
  "EXP": {
    "name": "Eagle Materials Inc",
    "industry": "Building Materials",
    "summary": "Eagle Materials Inc., through its subsidiaries, manufactures and sells heavy construction products and light building materials in the United States. The company operates in four segments: Cement, Concrete and Aggregates, Gypsum Wallboard, and Recycled Paperboard. It engages in the mining of limesto..."
  },
  "ARM": {
    "name": "Arm Holdings plc",
    "industry": "Semiconductors",
    "summary": "Arm Holdings plc architects, develops, and licenses central processing unit products and related technologies for semiconductor companies and original equipment manufacturers. The company is involved in the licensing, marketing, research, and development of microprocessors, systems intellectual prop..."
  },
  "PLTR": {
    "name": "Palantir Technologies Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Palantir Technologies Inc. builds and deploys software platforms for the intelligence community to assist in counterterrorism investigations and operations in the United States, the United Kingdom, and internationally. It provides Palantir Gotham, a software platform, which enables users to identify..."
  },
  "BA": {
    "name": "Boeing Company (The)",
    "industry": "Aerospace & Defense",
    "summary": "The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through three segments: Commerc..."
  },
  "RXRX": {
    "name": "Recursion Pharmaceuticals, Inc.",
    "industry": "Biotechnology",
    "summary": "Recursion Pharmaceuticals, Inc. operates as a clinical-stage biotechnology company, engages in the decoding biology and chemistry by integrating technological innovations across biology, chemistry, automation, data science, and engineering to industrialize drug discovery in the United States. The co..."
  },
  "BJ": {
    "name": "BJ's Wholesale Club Holdings, I",
    "industry": "Discount Stores",
    "summary": "BJ's Wholesale Club Holdings, Inc., together with its subsidiaries, operates membership warehouse clubs on the eastern half of the United States. The company offers groceries, fresh food, general merchandise, gasoline and other ancillary services, coupon books, and promotions. It sells its products ..."
  },
  "ETSY": {
    "name": "Etsy, Inc.",
    "industry": "Internet Retail",
    "summary": "Etsy, Inc., together with its subsidiaries, operates two-sided online marketplaces that connect buyers and sellers worldwide. The company operates through three segments: Etsy, Reverb, and Depop. It primarily operates Etsy marketplace that connects artisans and entrepreneurs with various consumers. ..."
  },
  "FSM": {
    "name": "Fortuna Mining Corp.",
    "industry": "Gold",
    "summary": "Fortuna Mining Corp. engages in the precious and base metal mining and related activities in Argentina, Burkina Faso, Côte d'Ivoire, Mexico, Peru, and Senegal. The company operates through Mansfield, Sanu, Sango, Cuzcatlan, and Bateas segments. It operates the Lindero gold mine, the Yaramoko gold mi..."
  },
  "MAR": {
    "name": "Marriott International",
    "industry": "Lodging",
    "summary": "Marriott International, Inc. engages in operation, franchising, and licensing of hotel, residential, timeshare, and other lodging properties worldwide. It operates its properties under the JW Marriott, The Ritz-Carlton, The Luxury Collection, W Hotels, St. Regis, EDITION, Bvlgari, Marriott Hotels, S..."
  },
  "KD": {
    "name": "Kyndryl Holdings, Inc.",
    "industry": "Information Technology Services",
    "summary": "Kyndryl Holdings, Inc. operates as a technology services company and IT infrastructure services provider in the United States, Japan, and internationally. The company offers cloud services; core enterprise and zCloud services; application, data, and artificial intelligence services; digital workplac..."
  },
  "APTV": {
    "name": "Aptiv PLC",
    "industry": "Auto Parts",
    "summary": "Aptiv PLC, an industrial technology company, provides hardware and software solutions to support automotive and other industries in North America, Europe, the Middle East, Africa, the Asia Pacific, and South America. It operates through three segments: Advanced Safety and User Experience, Engineered..."
  },
  "EU": {
    "name": "enCore Energy Corp.",
    "industry": "Uranium",
    "summary": "enCore Energy Corp. engages in the acquisition, exploration, development, and extraction of uranium resource properties in the United States. It holds interest in the Alta Mesa project located in Brooks County, Texas; the Gas Hills project located in the Riverton, Wyoming; the Juniper Ridge project ..."
  },
  "KSS": {
    "name": "Kohl's Corporation",
    "industry": "Department Stores",
    "summary": "Kohl's Corporation operates as an omnichannel retailer in the United States. It offers apparel, footwear, accessories, beauty products, and home products through its stores and website. The company provides its products primarily under the brand names of Apt. 9, Croft & Barrow, Jumping Beans, SO, So..."
  },
  "LUNR": {
    "name": "Intuitive Machines, Inc.",
    "industry": "Aerospace & Defense",
    "summary": "Intuitive Machines, Inc. designs, manufactures, and operates space products and services in the United States. The company provides delivery services for the transportation and delivery of payloads, such as satellites, scientific instruments, and cargo to various destinations in space, rideshare del..."
  },
  "HESAY": {
    "name": "Hermes International SA",
    "industry": "Luxury Goods",
    "summary": "Hermès International Société en commandite par actions engages in the production, wholesale, and retail of various goods. The company offers leather goods and saddlery, such as bags for men and women, travel articles, small leather goods and accessories, saddles, bridles, and a various equestrian pr..."
  },
  "QRVO": {
    "name": "Qorvo, Inc.",
    "industry": "Semiconductors",
    "summary": "Qorvo, Inc. engages in development and commercialization of technologies and products for wireless, wired, and power markets in the United States, China, rest of Asia, Taiwan, and Europe. It operates through three segments: High Performance Analog (HPA), Connectivity and Sensors Group (CSG), and Adv..."
  },
  "SNAP": {
    "name": "Snap Inc.",
    "industry": "Internet Content & Information",
    "summary": "Snap Inc. operates as a technology company in North America, Europe, and internationally. The company offers Snapchat, a visual messaging application with various tabs, such as camera, visual messaging, snap map, stories, and spotlight that enable people to communicate visually through short videos ..."
  },
  "SPOT": {
    "name": "Spotify Technology S.A.",
    "industry": "Internet Content & Information",
    "summary": "Spotify Technology S.A., together with its subsidiaries, provides audio streaming subscription services worldwide. It operates through two segments, Premium and Ad-Supported. The Premium segment offers unlimited online and offline streaming access to its catalog of music and podcasts without commerc..."
  },
  "ESTC": {
    "name": "Elastic N.V.",
    "industry": "Software - Application",
    "summary": "Elastic N.V., a search artificial intelligence (AI) company, provides software platforms to run in hybrid, public or private clouds, and multi-cloud environments in the United States and internationally. It primarily offers Elastic's Search AI Platform, a set of software products that ingest and sto..."
  },
  "PHYS": {
    "name": "\"Sprott Physical Gold Trust\"",
    "industry": "",
    "summary": ""
  },
  "DOV": {
    "name": "Dover Corporation",
    "industry": "Specialty Industrial Machinery",
    "summary": "Dover Corporation provides equipment and components, consumable supplies, aftermarket parts, software and digital solutions, and support services worldwide. The company's Engineered Products segment provides various equipment, component, software, solution, and services that are used in vehicle afte..."
  },
  "PAAS": {
    "name": "Pan American Silver Corp.",
    "industry": "Gold",
    "summary": "Pan American Silver Corp. engages in the exploration, mine development, extraction, processing, refining, and reclamation of mines in Canada, Mexico, Peru, Bolivia, Argentina, Chile, and Brazil. It explores for silver, gold, zinc, lead, and copper deposits. The company was formerly known as Pan Amer..."
  },
  "NVS": {
    "name": "Novartis AG",
    "industry": "Drug Manufacturers - General",
    "summary": "Novartis AG researches, develops, manufactures, distributes, markets, and sells pharmaceutical medicines in Switzerland and internationally. The company offers Entresto, an angiotensin receptorneprilysin inhibitor to treat symptomatic chronic heart failure with reduced ejection fraction (HFrEF); Cos..."
  },
  "GVA": {
    "name": "Granite Construction Incorporat",
    "industry": "Engineering & Construction",
    "summary": "Granite Construction Incorporated operates as an infrastructure contractor in the United States. It operates through two segments: Construction and Materials segments. The Construction segment engages in the construction and rehabilitation of roads, pavement preservation, bridges, rail lines, airpor..."
  },
  "NTDOY": {
    "name": "Nintendo Co., Ltd.",
    "industry": "Electronic Gaming & Multimedia",
    "summary": "Nintendo Co., Ltd., together with its subsidiaries, develops, manufactures, and sells home entertainment products in Japan, the Americas, Europe, and internationally. It offers home console gaming hardware, software, accessories, and other products. The company also provides various services, such a..."
  },
  "BYDDY": {
    "name": "BYD Co., Ltd.",
    "industry": "Auto Manufacturers",
    "summary": "BYD Company Limited, together with its subsidiaries, engages in automobiles and batteries business in the People's Republic of China, Hong Kong, Macau, Taiwan, and internationally. It operates in two segments, Mobile Handset Components, Assembly Service and Other Products; and Automobiles and Relate..."
  },
  "ALNY": {
    "name": "Alnylam Pharmaceuticals, Inc.",
    "industry": "Biotechnology",
    "summary": "Alnylam Pharmaceuticals, Inc. discovers, develops, and commercializes therapeutics based on ribonucleic acid interference. It offers ONPATTRO and AMVUTTRA for hereditary transthyretin-mediated amyloidosis; GIVLAARI for acute hepatic porphyria; OXLUMO for primary hyperoxaluria type 1; and Leqvio for ..."
  },
  "INCY": {
    "name": "Incyte Corporation",
    "industry": "Biotechnology",
    "summary": "Incyte Corporation, a biopharmaceutical company, engages in the discovery, development, and commercialization of therapeutics in the United States, Europe, Canada, and Japan. The company offers JAKAFI (ruxolitinib) for the treatment of intermediate or high-risk myelofibrosis, polycythemia vera, and ..."
  },
  "TSN": {
    "name": "Tyson Foods, Inc.",
    "industry": "Farm Products",
    "summary": "Tyson Foods, Inc., together with its subsidiaries, operates as a food company worldwide. It operates through four segments: Beef, Pork, Chicken, and Prepared Foods. The company processes live fed cattle and hogs; fabricates dressed beef and pork carcasses into primal and sub-primal meat cuts, as wel..."
  },
  "AMZN": {
    "name": "Amazon.com, Inc.",
    "industry": "Internet Retail",
    "summary": "Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufact..."
  },
  "BLDP": {
    "name": "Ballard Power Systems, Inc.",
    "industry": "Electrical Equipment & Parts",
    "summary": "Ballard Power Systems Inc. engages in the design, development, manufacture, sale, and service of proton exchange membrane (PEM) fuel cell products. The company offers its products for power product comprising for bus, truck, rail, marine, stationary power, and emerging market, such as material handl..."
  },
  "FIG": {
    "name": "Figma, Inc.",
    "industry": "Software - Application",
    "summary": "Figma, Inc. develops a browser-based tool for designing user interfaces that helps design and development teams build various products. The company offers Figma Design, a collaborative design tool for teams that explore ideas and gather feedback, build realistic prototypes, and streamline product de..."
  },
  "ETN": {
    "name": "Eaton Corporation, PLC",
    "industry": "Specialty Industrial Machinery",
    "summary": "Eaton Corporation plc operates as a power management company in the United States, Canada, Latin America, Europe, and the Asia Pacific. It operates through Electrical Americas, Electrical Global, Aerospace, Vehicle, and eMobility segments. The company offers electrical components, industrial compone..."
  },
  "PKG": {
    "name": "Packaging Corporation of Americ",
    "industry": "Packaging & Containers",
    "summary": "Packaging Corporation of America manufactures and sells containerboard and uncoated freesheet (UFS) paper products in North America. The company operates through Packaging and Paper segments. The Packaging segment offers various containerboard and corrugated packaging products, such as conventional ..."
  },
  "VAL": {
    "name": "Valaris Limited",
    "industry": "Oil & Gas Equipment & Services",
    "summary": "Valaris Limited, together with its subsidiaries, provides offshore contract drilling services in Brazil, the United Kingdom, U.S. Gulf of Mexico, Australia, Angola, and internationally. It operates in four segments: Floaters, Jackups, ARO, and Other. The company owns an offshore drilling rig fleet, ..."
  },
  "LOW": {
    "name": "Lowe's Companies, Inc.",
    "industry": "Home Improvement Retail",
    "summary": "Lowe's Companies, Inc., together with its subsidiaries, operates as a home improvement retailer in the United States. It provides a line of products for construction, maintenance, repair, remodeling, and decorating. The company also offers home improvement products, such as appliances, seasonal and ..."
  },
  "MBLY": {
    "name": "Mobileye Global Inc.",
    "industry": "Auto Parts",
    "summary": "Mobileye Global Inc. develops and deploys advanced driver assistance systems (ADAS) and autonomous driving technologies and solutions worldwide. The company operates through Mobileye and Other segments. It offers a portfolio of end-to-end ADAS and autonomous driving solutions comprising Base ADAS, a..."
  },
  "UPS": {
    "name": "United Parcel Service, Inc.",
    "industry": "Integrated Freight & Logistics",
    "summary": "United Parcel Service, Inc., a package delivery and logistics provider, offers transportation and delivery services. It operates through two segments, U.S. Domestic Package and International Package. The U.S. Domestic Package segment offers time-definite delivery services for express letters, docume..."
  },
  "AGX": {
    "name": "Argan, Inc.",
    "industry": "Engineering & Construction",
    "summary": "Argan, Inc., through its subsidiaries, provides engineering, procurement, construction, commissioning, maintenance, project development, and technical consulting services to the power generation market in the United States, Republic of Ireland, and the United Kingdom. Its Power Industry Services seg..."
  },
  "SEDG": {
    "name": "SolarEdge Technologies, Inc.",
    "industry": "Solar",
    "summary": "SolarEdge Technologies, Inc., together with its subsidiaries, designs, develops, manufactures, and sells direct current (DC) optimized inverter systems for solar photovoltaic (PV) installations in the United States, Germany, the Netherlands, Italy, rest of Europe, and internationally. The company of..."
  },
  "RIO": {
    "name": "Rio Tinto Plc",
    "industry": "Other Industrial Metals & Mining",
    "summary": "Rio Tinto Group engages in exploring, mining, and processing mineral resources worldwide. The company operates through Iron Ore, Aluminium, Copper, and Minerals Segments. The Iron Ore segment engages in the iron ore mining, and salt and gypsum production in Western Australia. The Aluminum segment is..."
  },
  "CDE": {
    "name": "Coeur Mining, Inc.",
    "industry": "Gold",
    "summary": "Coeur Mining, Inc. operates as a gold and silver producer in the United States, Canada, and Mexico. It operates through Palmarejo, Rochester, Kensington, Wharf, Silvertip, and Las Chispas segments. The company explores for gold, silver, zinc, lead, and other related metals. It markets and sells its ..."
  },
  "OC": {
    "name": "Owens Corning Inc",
    "industry": "Building Products & Equipment",
    "summary": "Owens Corning provides residential and commercial building products in the United States, Europe, the Asia Pacific, and internationally. It operates through four segments: Roofing, Insulation, Doors, and Composites. The company offers laminate and strip asphalt roofing shingles, roofing components, ..."
  },
  "NTLA": {
    "name": "Intellia Therapeutics, Inc.",
    "industry": "Biotechnology",
    "summary": "Intellia Therapeutics, Inc., a clinical-stage gene editing company, focuses on the development of curative genome editing treatments. The company's in vivo programs include NTLA-2001, which is in Phase 1 clinical trial for the treatment of transthyretin amyloidosis; and NTLA-2002 that is in Phase 1/..."
  },
  "CPNG": {
    "name": "Coupang, Inc.",
    "industry": "Internet Retail",
    "summary": "Coupang, Inc., together with its subsidiaries, owns and operates retail business through its mobile applications and internet websites in South Korea and internationally. It operates through Product Commerce and Developing Offerings segments. The Product Commerce segment includes Korean retail and m..."
  },
  "DASH": {
    "name": "DoorDash, Inc.",
    "industry": "Internet Retail",
    "summary": "DoorDash, Inc., together with its subsidiaries, operates a commerce platform that connects merchants, consumers, and independent contractors in the United States and internationally. The company operates DoorDash Marketplace and Wolt Marketplace, which provide various services, such as customer acqu..."
  },
  "KVYO": {
    "name": "Klaviyo, Inc. Series A",
    "industry": "Software - Application",
    "summary": "Klaviyo, Inc., a technology company, provides a software-as-a-service platform in the United States, other Americas, the Asia-Pacific, Europe, the Middle East, and Africa. The company offers Klaviyo, a cloud-native platform for data store, segmentation engine, campaigns and flows, and messaging infr..."
  },
  "GIS": {
    "name": "General Mills, Inc.",
    "industry": "Packaged Foods",
    "summary": "General Mills, Inc. manufactures and markets branded consumer foods in the United States and internationally. The company operates through four segments: North America Retail; International; North America Pet; and North America Foodservice. It offers grain, ready-to-eat cereals, refrigerated yogurt,..."
  },
  "QXO": {
    "name": "QXO, Inc.",
    "industry": "Industrial Distribution",
    "summary": "QXO, Inc. distributes roofing, waterproofing, and other building products in the United States. It offers asphalt, metal roofing, wood roofing, tile roofing, slate roofing, roofing accessories, and roofing insulation products; vinyl siding, aluminum siding, steel siding, fiber cement siding, wood an..."
  },
  "RUN": {
    "name": "Sunrun Inc.",
    "industry": "Solar",
    "summary": "Sunrun Inc. designs, develops, installs, sells, owns, and maintains residential solar energy systems in the United States. It sells solar energy systems and products, such as panels and racking; and solar leads generated to customers. In addition, the company offers battery storage along with solar ..."
  },
  "CRML": {
    "name": "Critical Metals Corp.",
    "industry": "Other Industrial Metals & Mining",
    "summary": "Critical Metals Corp. operates as a mining exploration and development company in Austria and Southern Greenland. The company explores for lithium and rare earth element deposits. The company is based in Road Town, British Virgin Islands. Critical Metals Corp. is a subsidiary of European Lithium Lim..."
  },
  "LAES": {
    "name": "SEALSQ Corp",
    "industry": "Semiconductors",
    "summary": "SEALSQ Corp, together with its subsidiaries, designs, develops, and markets semiconductors in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. It offers semiconductors, such as VaultIC secure elements, post quantum, RISC-V chips, secure arm platform, and smart car..."
  },
  "MTH": {
    "name": "Meritage Homes Corporation",
    "industry": "Residential Construction",
    "summary": "Meritage Homes Corporation, together with its subsidiaries, designs and builds single-family attached and detached homes in the United States. It operates through two segments: Homebuilding and Financial Services. The company acquires and develops land; and constructs, markets, and sells homes for e..."
  },
  "LAD": {
    "name": "Lithia Motors, Inc.",
    "industry": "Auto & Truck Dealerships",
    "summary": "Lithia Motors, Inc. operates as an automotive retailer in the United States, the United Kingdom, and Canada. The company operates in two segments, Vehicle Operations and Financing Operations. It offers a range of products and services fulfilling the entire vehicle ownership lifecycle, including new ..."
  },
  "RTX": {
    "name": "RTX Corporation",
    "industry": "Aerospace & Defense",
    "summary": "RTX Corporation, an aerospace and defense company, provides systems and services for commercial, military, and government customers worldwide. It operates through three segments: Collins Aerospace (Collins), Pratt & Whitney, and Raytheon. The Collins segment offers aerospace and defense products, an..."
  },
  "ACHR": {
    "name": "Archer Aviation Inc.",
    "industry": "Aerospace & Defense",
    "summary": "Archer Aviation Inc., together with its subsidiaries, designs and develops aircraft and related technologies and services in the United States and internationally. It operates through the commercial and defense sectors. The company offers electric vertical takeoff and landing (eVTOL) aircraft for us..."
  },
  "NFLX": {
    "name": "Netflix, Inc.",
    "industry": "Entertainment",
    "summary": "Netflix, Inc. provides entertainment services worldwide. The company offers television (TV) series, documentaries, feature films, games, and live programming across various genres and languages. It also provides members the ability to receive streaming content through a host of internet-connected de..."
  },
  "AGCO": {
    "name": "AGCO Corporation",
    "industry": "Farm & Heavy Construction Machinery",
    "summary": "AGCO Corporation manufactures and distributes agricultural equipment and replacement parts worldwide. It offers horsepower tractors for row crop production, soil cultivation, planting, land leveling, seeding, and commercial hay operations; utility tractors for small- and medium-sized farms, as well ..."
  },
  "ULTA": {
    "name": "Ulta Beauty, Inc.",
    "industry": "Specialty Retail",
    "summary": "Ulta Beauty, Inc. operates as a specialty beauty retailer in the United States, Mexico, and Kuwait. The company offers branded and private label beauty products, including cosmetics, fragrance, haircare, skincare, bath and body products, professional hair products, and salon styling tools through it..."
  },
  "ADBE": {
    "name": "Adobe Inc.",
    "industry": "Software - Application",
    "summary": "Adobe Inc. operates as a technology company worldwide. The Digital Media segment offers products and services that enable individuals, teams, and enterprises to create, publish, and promote content. This segment serves photographers, video editors, graphic and experience designers, game developers, ..."
  },
  "AZN": {
    "name": "AstraZeneca PLC",
    "industry": "Drug Manufacturers - General",
    "summary": "AstraZeneca PLC, a biopharmaceutical company, focuses on the discovery, development, manufacture, and commercialization of prescription medicines. The company offers Imjudo, Datroway, Iressa, Tagrisso, Imfinzi, Lynparza, Calquence, Enhertu, Orpathys, Truqap, Zoladex, Faslodex, Farxiga, Brilinta, Cre..."
  },
  "ALM": {
    "name": "Almonty Industries Inc.",
    "industry": "Other Industrial Metals & Mining",
    "summary": "Almonty Industries Inc. engages in mining, processing, and shipping of tungsten concentrate. The company explores for tin and tungsten deposits. It holds a portfolio of projects and mines located in Spain, Portugal, and Republic of Korea. Almonty Industries Inc. is headquartered in Toronto, Canada."
  },
  "INTU": {
    "name": "Intuit Inc.",
    "industry": "Software - Application",
    "summary": "Intuit Inc. provides financial management, payments and capital, compliance, and marketing products and services in the United States. The company operates in four segments: Global Business Solutions, Consumer, Credit Karma, and ProTax. The Global Business Solutions segment provides QuickBooks servi..."
  },
  "POOL": {
    "name": "Pool Corporation",
    "industry": "Industrial Distribution",
    "summary": "Pool Corporation distributes swimming pool supplies, equipment, related leisure, irrigation, and landscape maintenance products in the United States and internationally. The company offers maintenance products, including chemicals, supplies, and pool accessories; repair and replacement parts for poo..."
  },
  "TENB": {
    "name": "Tenable Holdings, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Tenable Holdings, Inc. provides cyber exposure management solutions in the Americas, Europe, the Middle East, Africa, the Asia Pacific, and Japan. Its platforms include Tenable Vulnerability Management, a cloud-delivered software as a service that provides organizations with a risk-based view of tra..."
  },
  "KBH": {
    "name": "KB Home",
    "industry": "Residential Construction",
    "summary": "KB Home is one of the largest and most trusted homebuilders in the United States. We operate in 49 markets, have built over 700,000 quality homes in our nearly 70-year history, and are honored to be the No 1 customer-ranked national homebuilder based on third-party buyer surveys. What sets KB Home a..."
  },
  "IT": {
    "name": "Gartner, Inc.",
    "industry": "Information Technology Services",
    "summary": "Gartner, Inc. operates as a research and advisory company in the United States, Canada, Europe, the Middle East, Africa, and internationally. It operates through three segments: Research, Conferences, and Consulting. The Research segment delivers its research primarily through a subscription service..."
  },
  "ONTO": {
    "name": "Onto Innovation Inc.",
    "industry": "Semiconductor Equipment & Materials",
    "summary": "Onto Innovation Inc. engages in the design, development, manufacture, and support of process control tools that performs optical metrology and inspection worldwide. The company offers lithography systems and process control analytical software. It also provides process and yield management solutions..."
  },
  "IE": {
    "name": "Ivanhoe Electric Inc.",
    "industry": "Copper",
    "summary": "Ivanhoe Electric Inc., a mineral exploration company, focuses on developing mines from mineral deposits primarily in the United States. The company primarily explores for copper, gold, and silver deposits. Its flagship projects are the Santa Cruz Project, a copper exploration project that comprises ..."
  },
  "RBLX": {
    "name": "Roblox Corporation",
    "industry": "Electronic Gaming & Multimedia",
    "summary": "Roblox Corporation operates an immersive platform for connection and communication in the United States and internationally. It offers Roblox Client, an application that allows users to explore 3D experience; Roblox Studio, a free toolset that allows developers and creators to build, publish, and op..."
  },
  "IAG": {
    "name": "Iamgold Corporation",
    "industry": "Gold",
    "summary": "IAMGOLD Corporation, through its subsidiaries, operates as a gold producer and developer in Canada and Burkina Faso. The company owns 100% interest in the Westwood project that covers an area of 1,925 hectare and located in Quebec; 60% interest in the Côté gold project, which covers an area of 596 s..."
  },
  "CNH": {
    "name": "CNH Industrial N.V.",
    "industry": "Farm & Heavy Construction Machinery",
    "summary": "CNH Industrial N.V., an equipment and services company, engages in the design, production, marketing, sale, and financing of agricultural and construction equipment in North America, Europe, the Middle East, Africa, South America, and the Asia Pacific. The company operates through three segments: Ag..."
  },
  "QCOM": {
    "name": "QUALCOMM Incorporated",
    "industry": "Semiconductors",
    "summary": "QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segmen..."
  },
  "IP": {
    "name": "International Paper Company",
    "industry": "Packaging & Containers",
    "summary": "International Paper Company produces and sells renewable fiber-based packaging and pulp products in North America, Latin America, Europe, and North Africa. It operates through two segments, Industrial Packaging and Global Cellulose Fibers. The company offers linerboard, medium, whitetop, recycled li..."
  },
  "XYL": {
    "name": "Xylem Inc.",
    "industry": "Specialty Industrial Machinery",
    "summary": "Xylem Inc., together with its subsidiaries, engages in the design, manufacture, and servicing of engineered products and solutions for utility, industrial, and residential and commercial building services settings worldwide. It operates through four segments: Water Infrastructure; Applied Water; Mea..."
  },
  "BABA": {
    "name": "Alibaba Group Holding Limited",
    "industry": "Internet Retail",
    "summary": "Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. It operates digital retail platfo..."
  },
  "EA": {
    "name": "Electronic Arts Inc.",
    "industry": "Electronic Gaming & Multimedia",
    "summary": "Electronic Arts Inc. develops, markets, publishes, and delivers games, content, and services for game consoles, PCs, and mobile phones worldwide. It develops and publishes games and services across various genres, such as sports, racing, first-person shooter, action, role-playing, and simulation; an..."
  },
  "MRK": {
    "name": "Merck & Company, Inc.",
    "industry": "Drug Manufacturers - General",
    "summary": "Merck & Co., Inc. operates as a healthcare company worldwide. The company offers human health pharmaceutical for various areas under the Keytruda, Welireg, Gardasil, ProQuad, M-M-R II, Varivax, Vaxneuvance, RotaTeq, Pneumovax 23, Bridion, Dificid, Zerbaxa, Noxafil, Winrevair, Adempas, Verquvo, Lagev..."
  },
  "MTCH": {
    "name": "Match Group, Inc.",
    "industry": "Internet Content & Information",
    "summary": "Match Group, Inc. engages in the provision of digital technologies. It operates through four segments: Tinder, Hinge, Evergreen and Emerging, and Match Group Asia. The company's portfolio of brands includes Tinder, Hinge, Match, Meetic, OkCupid, Pairs, Plenty Of Fish, Azar, BLK, and other brands, bu..."
  },
  "AMAT": {
    "name": "Applied Materials, Inc.",
    "industry": "Semiconductor Equipment & Materials",
    "summary": "Applied Materials, Inc. provides materials engineering solutions, equipment, services, and software to the semiconductor and related industries in the United States, China, Korea, Taiwan, Japan, Southeast Asia, Europe, and internationally. The company operates through Semiconductor Systems and Appli..."
  },
  "PPTA": {
    "name": "Perpetua Resources Corp.",
    "industry": "Other Precious Metals & Mining",
    "summary": "Perpetua Resources Corp., a development-stage company, engages in the acquisition of mining properties in the United States. The company explores for gold, silver, and antimony deposits. Its principal mineral project is the 100% owned Stibnite Gold project, which includes 1,674 unpatented lode claim..."
  },
  "QBTS": {
    "name": "D-Wave Quantum Inc.",
    "industry": "Computer Hardware",
    "summary": "D-Wave Quantum Inc. develops and delivers quantum computing systems, software, and services worldwide. The company offers Advantage and Advantage 2 quantum computers; Ocean, a suite of open-source tools; and Leap quantum cloud service, a cloud-based service that provides real-time access to quantum ..."
  },
  "REGN": {
    "name": "Regeneron Pharmaceuticals, Inc.",
    "industry": "Biotechnology",
    "summary": "Regeneron Pharmaceuticals, Inc. discovers, invents, develops, manufactures, and commercializes medicines to treat various diseases worldwide. The company develops product candidates to treat eye, allergic and inflammatory, cardiovascular, metabolic, neurological, infectious, and rare diseases; and c..."
  },
  "BOX": {
    "name": "Box, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Box, Inc. provides a cloud content management platform that enables organizations of various sizes to manage and share their content from anywhere on any device in the United States and Japan. The company's Software-as-a-Service platform enables users to work with their content as they need from sec..."
  },
  "SHLS": {
    "name": "Shoals Technologies Group, Inc.",
    "industry": "Solar",
    "summary": "Shoals Technologies Group, Inc. provides electrical balance of system (EBOS) solutions and components in the United States and internationally. The company designs, manufactures, and sells various products used by the solar and battery storage industries, including solar big lead assembly (BLA) solu..."
  },
  "PH": {
    "name": "Parker-Hannifin Corporation",
    "industry": "Specialty Industrial Machinery",
    "summary": "Parker-Hannifin Corporation manufactures and sells motion and control technologies and systems for aerospace and defense, in-plant and industrial equipment, transportation, off-highway, energy, and HVAC and refrigeration markets in North America, Europe, Asia Pacific, and Latin America. The company ..."
  },
  "FANG": {
    "name": "Diamondback Energy, Inc.",
    "industry": "Oil & Gas E&P",
    "summary": "Diamondback Energy, Inc., an independent oil and natural gas company, acquires, develops, explores, and exploits unconventional, onshore oil and natural gas reserves in the Permian Basin in West Texas. It focuses on the development of the Spraberry and Wolfcamp formations of the Midland basin; and t..."
  },
  "UNH": {
    "name": "UnitedHealth Group Incorporated",
    "industry": "Healthcare Plans",
    "summary": "UnitedHealth Group Incorporated operates as a health care company in the United States and internationally. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services..."
  },
  "LITE": {
    "name": "Lumentum Holdings Inc.",
    "industry": "Communication Equipment",
    "summary": "Lumentum Holdings Inc. manufactures and sells optical and photonic products in the Americas, the Asia-Pacific, Europe, the Middle East, and Africa. It operates through two segments, Cloud & Networking and Industrial Tech. The Cloud & Networking segment offers optical and photonic chips, components, ..."
  },
  "GLXY": {
    "name": "Galaxy Digital Inc.",
    "industry": "Capital Markets",
    "summary": "Galaxy Digital Inc. engages in the digital asset and data center infrastructure businesses. The company's digital assets platform offers institutional access to trading, advisory, asset management, staking, self-custody, and tokenization technology. In addition, the company invests in and operates d..."
  },
  "HNGE": {
    "name": "Hinge Health, Inc.",
    "industry": "Health Information Services",
    "summary": "Hinge Health, Inc. focuses on scaling and automating the delivery of healthcare services. The company leverages AI-powered care model, wearable devices, and access to clinicians to deliver evidence-based care services for musculoskeletal conditions. It primarily serves self-insured employers. The co..."
  },
  "PHM": {
    "name": "PulteGroup, Inc.",
    "industry": "Residential Construction",
    "summary": "PulteGroup, Inc., through its subsidiaries, engages in the homebuilding business in the United States. The company is involved in the acquisition and development of land primarily for residential purposes, as well as construction of housing; and sale of single-family detached homes; and attached hom..."
  },
  "BILI": {
    "name": "Bilibili Inc.",
    "industry": "Internet Content & Information",
    "summary": "Bilibili Inc. provides online entertainment services for the young generations in the People's Republic of China. It offers a range of digital content, including professional user generated videos, mobile games, and value-added services, such as live broadcasting, occupationally generated videos, au..."
  },
  "CNP": {
    "name": "CenterPoint Energy, Inc (Holdin",
    "industry": "Utilities - Regulated Electric",
    "summary": "CenterPoint Energy, Inc. operates as a public utility holding company in the United States. The company operates in Electric and Natural Gas segments. The Electric segment provides electric transmission and distribution services to electric customers and electric generation assets, as well as optimi..."
  },
  "BBAI": {
    "name": "BigBear.ai, Inc.",
    "industry": "Information Technology Services",
    "summary": "BigBear.ai Holdings, Inc. provides artificial intelligence-powered decision intelligence solutions. The company offers national security, supply chain management, and digital identity and biometrics solutions. It also provides data ingestion, data enrichment, data processing, artificial intelligence..."
  },
  "EW": {
    "name": "Edwards Lifesciences Corporatio",
    "industry": "Medical Devices",
    "summary": "Edwards Lifesciences Corporation provides products and technologies to treat advanced cardiovascular diseases in the United States, Europe, Japan, and internationally. The company offers transcatheter heart valve replacement products for minimally invasive replacement of aortic heart valves under th..."
  },
  "IHF": {
    "name": "iShares U.S. Health Care Provid",
    "industry": "",
    "summary": "The index measures the performance of the healthcare providers sector of the U.S. equity market, as defined by SPDJI. The fund generally will invest at least 80% of its assets in the component securities of its index and in investments that have economic characteristics that are substantially identi..."
  },
  "LDOS": {
    "name": "Leidos Holdings, Inc.",
    "industry": "Information Technology Services",
    "summary": "Leidos Holdings, Inc., together with its subsidiaries, provides services and solutions for government and commercial customers in the United States and internationally. The National Security & Digital segment provides national security software; services by using artificial intelligence and machine ..."
  },
  "NG": {
    "name": "Novagold Resources Inc.",
    "industry": "Gold",
    "summary": "NovaGold Resources Inc. operates in the gold mining industry, focusing on the exploration and development of gold mineral properties in the United States. The company's principal asset owns 60% interest in the Donlin Gold project consisting of 493 mining claims covering an area of approximately 29,0..."
  },
  "SNY": {
    "name": "Sanofi",
    "industry": "Drug Manufacturers - General",
    "summary": "Sanofi engages in the research, development, manufacture, and marketing of therapeutic solutions. It provides immunology and inflammation, rare diseases, neurology, oncology, and other medicines and vaccines. It also offers poliomyelitis, pertussis, and haemophilus influenzae type b (Hib) pediatric ..."
  },
  "UMC": {
    "name": "United Microelectronics Corpora",
    "industry": "Semiconductors",
    "summary": "United Microelectronics Corporation operates as a semiconductor wafer foundry in Taiwan, China, Hong Kong, Japan, Korea, the United States, Europe, and internationally. The company manufactures and sells integrated circuits. It offers backend and design support services for mobile and wireless commu..."
  },
  "QUBT": {
    "name": "Quantum Computing Inc.",
    "industry": "Computer Hardware",
    "summary": "Quantum Computing Inc., an integrated photonics company, provides quantum machines to commercial and government markets in the United States. The company develops thin-film lithium niobate chips for optical devices, such as electro-optical modulators, periodically poled devices for frequency convers..."
  },
  "ENPH": {
    "name": "Enphase Energy, Inc.",
    "industry": "Solar",
    "summary": "Enphase Energy, Inc., together with its subsidiaries, designs, develops, manufactures, and sells home energy solutions for the solar photovoltaic industry in the United States and internationally. The company offers semiconductor-based microinverter that converts energy at the individual solar modul..."
  },
  "WMG": {
    "name": "Warner Music Group Corp.",
    "industry": "Entertainment",
    "summary": "Warner Music Group Corp. operates as a music entertainment company in the United States, the United Kingdom, Germany, and internationally. It operates through Recorded Music and Music Publishing segments. The company is involved in the discovery and development of recording artists, as well as relat..."
  },
  "TDOC": {
    "name": "Teladoc Health, Inc.",
    "industry": "Health Information Services",
    "summary": "Teladoc Health, Inc. provides virtual healthcare services worldwide. It operates through Teladoc Health Integrated Care and BetterHelp segments. The Integrated Care segment offers virtual medical services, including general medical, expert medical, specialty medical, chronic condition management, an..."
  },
  "PLUG": {
    "name": "Plug Power, Inc.",
    "industry": "Electrical Equipment & Parts",
    "summary": "Plug Power Inc. develops hydrogen fuel cells product solutions in North America, Europe, Asia, and internationally. The company offers GenDrive, a hydrogen fueled proton exchange membrane fuel cell system that provides power to material handling electric vehicles; GenSure, a stationary fuel cell sol..."
  },
  "RIOT": {
    "name": "Riot Platforms, Inc.",
    "industry": "Capital Markets",
    "summary": "Riot Platforms, Inc., together with its subsidiaries, operates as a Bitcoin mining company in the United States. The company operates in two segments, Bitcoin Mining and Engineering. It offers comprehensive and critical infrastructure for institutional-scale Bitcoin mining facilities in Rockdale and..."
  },
  "UPST": {
    "name": "Upstart Holdings, Inc.",
    "industry": "Credit Services",
    "summary": "Upstart Holdings, Inc., together with its subsidiaries, operates a cloud-based artificial intelligence (AI) lending platform in the United States. The company operates through three segments: Personal Lending, Auto Lending, and Other. Its platform includes personal loans, automotive retail and refin..."
  },
  "FE": {
    "name": "FirstEnergy Corp.",
    "industry": "Utilities - Regulated Electric",
    "summary": "FirstEnergy Corp., together with its subsidiaries, engages in the generation, distribution, and transmission of electricity in the United States. It operates through Distribution, Integrated, and Stand-Alone Transmission segments. The company owns and operates coal-fired, nuclear, hydroelectric, win..."
  },
  "FTI": {
    "name": "TechnipFMC plc",
    "industry": "Oil & Gas Equipment & Services",
    "summary": "TechnipFMC plc engages in the energy projects, technologies, systems, and services businesses in Europe, Central Asia, North America, Latin America, the Asia Pacific, Africa, the Middle East, and internationally. It operates through two segments, Subsea and Surface Technologies. The Subsea segment e..."
  },
  "ADI": {
    "name": "Analog Devices, Inc.",
    "industry": "Semiconductors",
    "summary": "Analog Devices, Inc. engages in the design, manufacture, testing, and marketing of integrated circuits (ICs), software, and subsystems products in the United States, rest of North and South America, Europe, Japan, China, and rest of Asia. It provides data converter products, which translate real-wor..."
  },
  "PSLV": {
    "name": "\"Sprott Physical Silver Trust\"",
    "industry": "",
    "summary": ""
  },
  "ITW": {
    "name": "Illinois Tool Works Inc.",
    "industry": "Specialty Industrial Machinery",
    "summary": "Illinois Tool Works Inc. provides industrial products and equipment in North America, Europe, the Middle East, Africa, the Asia Pacific, and South America. It operates through Automotive OEM; Food Equipment; Test & Measurement and Electronics; Welding; Polymers & Fluids; Construction Products; and S..."
  },
  "CRSP": {
    "name": "CRISPR Therapeutics AG",
    "industry": "Biotechnology",
    "summary": "CRISPR Therapeutics AG, a gene editing company, focuses on developing gene-based medicines for serious human diseases using its Clustered Regularly Interspaced Short Palindromic Repeats (CRISPR)/CRISPR-associated protein 9 (Cas9) platform. The company's CRISPR/Cas9 is a revolutionary technology for ..."
  },
  "FISV": {
    "name": "Fiserv, Inc.",
    "industry": "",
    "summary": ""
  },
  "PLG": {
    "name": "Platinum Group Metals Ltd.",
    "industry": "Other Precious Metals & Mining",
    "summary": "Platinum Group Metals Ltd. engages in the acquisition, exploration, and development of platinum and palladium properties. The company explores for palladium, platinum, gold, copper, nickel, and rhodium deposits. It also holds 50.16 % interest in the Waterberg project located on the Northern Limb of ..."
  },
  "CARR": {
    "name": "Carrier Global Corporation",
    "industry": "Building Products & Equipment",
    "summary": "Carrier Global Corporation provides intelligent climate and energy solutions in the United States, Europe, the Asia Pacific, and internationally. It operates through four segments: Climate Solutions Americas; Climate Solutions Europe; Climate Solutions Asia Pacific, Middle East & Africa; and Climate..."
  },
  "OKLO": {
    "name": "Oklo Inc.",
    "industry": "Utilities - Independent Power Producers",
    "summary": "Oklo Inc. develops advanced fission power plants to provide clean, reliable, and affordable energy at scale to the customers in the United States. It also commercializes nuclear fuel recycling technology that converts nuclear waste into useable fuel for its reactors. Oklo Inc. has an joint agreement..."
  },
  "UNP": {
    "name": "Union Pacific Corporation",
    "industry": "Railroads",
    "summary": "Union Pacific Corporation, through its subsidiary, Union Pacific Railroad Company, operates in the railroad business in the United States. It offers transportation services for grain and grain products, fertilizers, food and refrigerated products, and coal and renewables to grain processors, animal ..."
  },
  "SAIA": {
    "name": "Saia, Inc.",
    "industry": "Trucking",
    "summary": "Saia, Inc., together with its subsidiaries, operates as a transportation company in North America. The company provides less-than-truckload services for shipments between 100 and 10,000 pounds. It also offers other value-added services, including non-asset truckload, expedited, and logistics service..."
  },
  "COHR": {
    "name": "Coherent Corp.",
    "industry": "Scientific & Technical Instruments",
    "summary": "Coherent Corp. develops, manufactures, and markets engineered materials, optoelectronic components and devices, and laser systems for the use in the industrial, communications, electronics, and instrumentation markets worldwide. It operates through three segments: Networking, Materials, and Lasers. ..."
  },
  "TM": {
    "name": "Toyota Motor Corporation",
    "industry": "Auto Manufacturers",
    "summary": "Toyota Motor Corporation designs, manufactures, assembles, and sells passenger vehicles, minivans and commercial vehicles, and related parts and accessories in Japan, North America, Europe, Asia, Central and South America, Oceania, Africa, the Middle East, and internationally. It operates through Au..."
  },
  "NKE": {
    "name": "Nike, Inc.",
    "industry": "Footwear & Accessories",
    "summary": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic and casual footwear, apparel, equipment, accessories, and services for men, women, and kids in North America, Europe, the Middle East, Africa, Greater China, the Asia Pacific, and Latin America. The company of..."
  },
  "NUE": {
    "name": "Nucor Corporation",
    "industry": "Steel",
    "summary": "Nucor Corporation engages in the manufacture and sale of steel and steel products. The company operates in three segments: Steel Mills, Steel Products, and Raw Materials. The Steel Mills segment produces hot-rolled, cold-rolled, and galvanized sheet steel products; plate steel products; wide-flange ..."
  },
  "SYM": {
    "name": "Symbotic Inc.",
    "industry": "Specialty Industrial Machinery",
    "summary": "Symbotic Inc., an automation technology company, develops technologies to enhance operating efficiencies in modern warehouses. The company automates the processing of pallets, cases, and individual items in warehouses. Its systems enhance operations at the front end of the supply chain. The company ..."
  },
  "AEM": {
    "name": "Agnico Eagle Mines Limited",
    "industry": "Gold",
    "summary": "Agnico Eagle Mines Limited, a gold mining company, engages in the exploration, development, and production of precious metals. It explores for gold, silver, zinc, and copper. The company's mines are located in Canada, Australia, Finland, and Mexico; and with exploration and development activities in..."
  },
  "CVNA": {
    "name": "Carvana Co.",
    "industry": "Auto & Truck Dealerships",
    "summary": "Carvana Co., together with its subsidiaries, operates an e-commerce platform for buying and selling used cars in the United States. The company offers vehicle acquisition, inspection and reconditioning, online search and shopping experience, financing, complementary products, logistics network and d..."
  },
  "VZLA": {
    "name": "Vizsla Silver Corp.",
    "industry": "Other Industrial Metals & Mining",
    "summary": "Vizsla Silver Corp. engages in the acquisition, exploration, and development of mineral resource properties in Canada and Mexico. The company explores for gold, silver, and copper deposits. It owns 100% interest in the Panuco-Copala silver-gold project covering an area of 7,189.5 hectares located in..."
  },
  "MP": {
    "name": "MP Materials Corp.",
    "industry": "Other Industrial Metals & Mining",
    "summary": "MP Materials Corp., together with its subsidiaries, produces rare earth materials in the Western Hemisphere. The company operates in two segments, Materials and Magnetics. The Materials segment owns and operates the Mountain Pass Rare Earth Mine and Processing facility located near Mountain Pass, Sa..."
  },
  "MDGL": {
    "name": "Madrigal Pharmaceuticals, Inc.",
    "industry": "Biotechnology",
    "summary": "Madrigal Pharmaceuticals, Inc., a biopharmaceutical company, focuses on delivering novel therapeutics for metabolic dysfunction-associated steatohepatitis (MASH) in the United States. It offers Rezdiffra, a liver-directed thyroid hormone receptor beta agonist for treating MASH. The company is headqu..."
  },
  "STNG": {
    "name": "Scorpio Tankers Inc.",
    "industry": "Oil & Gas Midstream",
    "summary": "Scorpio Tankers Inc., together with its subsidiaries, engages in the seaborne transportation of crude oil and refined petroleum products worldwide. As of March 20, 2025, its fleet consisted of 99 owned and leased financed tankers, including 38 LR2, 47 MR, and 14 Handymax. Scorpio Tankers Inc. was in..."
  },
  "POWW": {
    "name": "Outdoor Holding Company",
    "industry": "Aerospace & Defense",
    "summary": "Outdoor Holding Company engages in online marketplace business. It owns and operates the GunBroker e-commerce marketplace, an auction site that supports the lawful sale of firearms, ammunition, and hunting/shooting accessories. The company is also involved in banner advertising campaign activities. ..."
  },
  "FRO": {
    "name": "Frontline Plc",
    "industry": "Oil & Gas Midstream",
    "summary": "Frontline plc, a shipping company, engages in the ownership and operation of oil and product tankers worldwide. The company owns and operates oil and product tankers, such as very large crude carriers (VLCCs), Suezmax tankers, and LR2/Aframax tankers. As of December 31, 2024, it operated a fleet of ..."
  },
  "BTBT": {
    "name": "Bit Digital, Inc.",
    "industry": "Capital Markets",
    "summary": "Bit Digital, Inc., together with its subsidiaries, engages in the institutional grade ethereum treasury and staking business. It also designs and operates data centers and cloud solutions for AI training and inference workloads supported by renewable energy in Canada and Iceland. Additionally, it en..."
  },
  "HYMC": {
    "name": "Hycroft Mining Holding Corporat",
    "industry": "Gold",
    "summary": "Hycroft Mining Holding Corporation, together with its subsidiaries, operates as a gold and silver exploration and development company in the United States. The company holds interests in the Hycroft mine that consists of 30 private parcels with patented claims comprising approximately 1,787 acres, a..."
  },
  "SBLK": {
    "name": "Star Bulk Carriers Corp.",
    "industry": "Marine Shipping",
    "summary": "Star Bulk Carriers Corp., a shipping company, engages in the ocean transportation of dry bulk cargoes through the ownership and operation of dry bulk carrier vessels worldwide. Its vessels transport a range of bulk commodities, including iron ores, minerals and grains, bauxite, fertilizers, and stee..."
  },
  "IBUY": {
    "name": "Amplify Online Retail ETF",
    "industry": "",
    "summary": "The fund will invest at least 80% of its net assets in global equity securities that comprise the index, which will primarily include common stocks and/or depositary receipts, such as ADRs and GDRs. The index seeks to measure the performance of global equity securities of publicly traded companies w..."
  },
  "XEL": {
    "name": "Xcel Energy Inc.",
    "industry": "Utilities - Regulated Electric",
    "summary": "Xcel Energy Inc., through its subsidiaries, engages in the generation, purchasing, transmission, distribution, and sale of electricity in the United States. It operates through Regulated Electric Utility and Regulated Natural Gas Utility segments. The company generates electricity through wind, nucl..."
  },
  "BEAM": {
    "name": "Beam Therapeutics Inc.",
    "industry": "Biotechnology",
    "summary": "Beam Therapeutics Inc., a biotechnology company, engages in the development of precision genetic medicines for patients suffering from serious diseases in the United States. It develops BEAM-101 for the treatment of sickle cell disease; BEAM-302, a liver-targeting LNP formulation to treat severe alp..."
  },
  "ARMN": {
    "name": "Aris Mining Corporation",
    "industry": "Gold",
    "summary": "Aris Mining Corporation, together with its subsidiaries, engages in the acquisition, exploration, development, and operation of gold properties in Canada, Colombia, and Guyana. It also explores for silver and copper deposits. The company was formerly known as GCM Mining Corp. and changed its name to..."
  },
  "EMAT": {
    "name": "Evolution Metals & Technologies",
    "industry": "Other Industrial Metals & Mining",
    "summary": "Evolution Metals & Technologies Corp. critical materials and advanced manufacturing company. It focuses on non-China-dependent supply chain for rare earth permanent magnets, battery materials, and related critical technologies. The company is based in West Palm Beach, Florida."
  },
  "VOYG": {
    "name": "Voyager Technologies, Inc.",
    "industry": "Aerospace & Defense",
    "summary": "Voyager Technologies, Inc. operates as a defense technology and space solutions company in the United States, Europe, the Middle East, and internationally. It operates through three segments: Defense & National Security, Space Solutions, and Starlab Space Stations. The Defense & National Security se..."
  },
  "BLDR": {
    "name": "Builders FirstSource, Inc.",
    "industry": "Building Products & Equipment",
    "summary": "Builders FirstSource, Inc., together with its subsidiaries, manufactures and supplies building materials, manufactured components, and construction services to professional homebuilders, sub-contractors, remodelers, and consumers in the United States. It offers manufactured products, such as wood fl..."
  },
  "AVY": {
    "name": "Avery Dennison Corporation",
    "industry": "Packaging & Containers",
    "summary": "Avery Dennison Corporation operates as a materials science and digital identification solutions company in the United States, Europe, the Middle East, North Africa, Asia, Latin America, and internationally. It provides pressure-sensitive label materials, which consist of papers, plastic films, and m..."
  },
  "BHP": {
    "name": "BHP Group Limited",
    "industry": "Other Industrial Metals & Mining",
    "summary": "BHP Group Limited operates as a resources company in Australia, Europe, China, Japan, India, South Korea, rest of Asia, North America, South America, and internationally. The company operates through Copper, Iron Ore, and Coal segments. It also engages in the mining of copper, uranium, gold, zinc, l..."
  },
  "DJT": {
    "name": "Trump Media & Technology Group ",
    "industry": "Internet Content & Information",
    "summary": "Trump Media & Technology Group Corp. engages in social media and streaming services in the United States. The company operates Truth Social, a social media platform for free expression; and Truth+, a streaming platform focusing on news, Christian content, and family friendly programming. It also off..."
  },
  "AMKR": {
    "name": "Amkor Technology, Inc.",
    "industry": "Semiconductor Equipment & Materials",
    "summary": "Amkor Technology, Inc. provides outsourced semiconductor packaging and test services in the United States, Japan, Europe, and the Asia Pacific. It offers turnkey packaging and test services, including semiconductor wafer bump, wafer probe, wafer back-grind, package design, packaging, system-level an..."
  },
  "VST": {
    "name": "Vistra Corp.",
    "industry": "Utilities - Independent Power Producers",
    "summary": "Vistra Corp., together with its subsidiaries, operates as an integrated retail electricity and power generation company in the United States. It operates through five segments: Retail, Texas, East, West, and Asset Closure. The company retails electricity and natural gas to residential, commercial, a..."
  },
  "HD": {
    "name": "Home Depot, Inc. (The)",
    "industry": "Home Improvement Retail",
    "summary": "The Home Depot, Inc. operates as a home improvement retailer in the United States and internationally. It sells various building materials, home improvement products, lawn and garden products, and décor products, as well as facilities maintenance, repair, and operations products. The company also of..."
  },
  "H": {
    "name": "Hyatt Hotels Corporation",
    "industry": "Lodging",
    "summary": "Hyatt Hotels Corporation operates as a hospitality company in the United States and internationally. It operates through Owned and Leased Hotels, Americas Management and Franchising, ASPAC Management and Franchising, EAME Management and Franchising, and Apple Leisure Group segments. The company mana..."
  },
  "FANUY": {
    "name": "Fanuc Corporation",
    "industry": "Specialty Industrial Machinery",
    "summary": "Fanuc Corporation engages in the development, manufacture, sale, and maintenance services of products used in automated production systems in Japan, the United States, Europe, China, the rest of Asia, and internationally. The company offers CNC series, robots, and robomachine products, such as servo..."
  },
  "ON": {
    "name": "ON Semiconductor Corporation",
    "industry": "Semiconductors",
    "summary": "ON Semiconductor Corporation provides intelligent sensing and power solutions in Hong Kong, Singapore, the United Kingdom, the United States, and internationally. It operates through three segments: Power Solutions Group, Analog and Mixed-Signal Group, and Intelligent Sensing Group. The Power Soluti..."
  },
  "FLR": {
    "name": "Fluor Corporation",
    "industry": "Engineering & Construction",
    "summary": "Fluor Corporation provides engineering, procurement, and construction (EPC); fabrication and modularization; and project management services worldwide. The company operates through three segments: Urban Solutions, Energy Solutions, and Mission Solutions. The Urban Solutions segment offers EPC and pr..."
  },
  "LASR": {
    "name": "nLIGHT, Inc.",
    "industry": "Semiconductors",
    "summary": "nLIGHT, Inc. designs, develops, manufactures, and sells semiconductor and fiber lasers for industrial, microfabrication, and aerospace and defense applications. The company operates through two segments, Laser Products and Advanced Development. It offers semiconductor lasers with various ranges of p..."
  },
  "BBY": {
    "name": "Best Buy Co., Inc.",
    "industry": "Specialty Retail",
    "summary": "Best Buy Co., Inc. offers technology products and solutions in the United States, Canada, and internationally. It provides computing and mobile phone products, such as desktops, notebooks, and peripherals; mobile phones comprising related mobile network carrier commissions; networking products; tabl..."
  },
  "ERO": {
    "name": "Ero Copper Corp.",
    "industry": "Copper",
    "summary": "Ero Copper Corp. engages in the exploration, development, and production of mining projects in Brazil. Its flagship asset includes Caraíba operations that comprise the production and sale of copper concentrates located in northeastern Bahia State, Brazil, as well as gold and silver produced and sold..."
  },
  "HOG": {
    "name": "Harley-Davidson, Inc.",
    "industry": "Recreational Vehicles",
    "summary": "Harley-Davidson, Inc. manufactures and sells motorcycles in the United States and internationally. The company operates in three segments: Harley-Davidson Motor Company, LiveWire, and Harley-Davidson Financial Services. The Harley-Davidson Motor Company segment designs, manufactures, and sells motor..."
  },
  "OXY": {
    "name": "Occidental Petroleum Corporatio",
    "industry": "Oil & Gas E&P",
    "summary": "Occidental Petroleum Corporation, together with its subsidiaries, engages in the acquisition, exploration, and development of oil and gas properties in the United States and internationally. It operates through three segments: Oil and Gas, Chemical, and Midstream and Marketing. The Oil and Gas segme..."
  },
  "VNET": {
    "name": "VNET Group, Inc.",
    "industry": "Information Technology Services",
    "summary": "VNET Group, Inc., an investment holding company, provides hosting and related services in China. The company offers managed hosting services consisting of managed retail services, such as colocation services that dedicate data center space to house customers' servers and networking equipment, as wel..."
  },
  "EQX": {
    "name": "Equinox Gold Corp.",
    "industry": "Gold",
    "summary": "Equinox Gold Corp. engages in the acquisition, exploration, development, and operation of mineral properties in the Americas. The company primarily explores gold and silver deposits. It holds interest in properties in California located in the United States; Guerrero State located in Mexico; Maranhã..."
  },
  "CAVA": {
    "name": "CAVA Group, Inc.",
    "industry": "Restaurants",
    "summary": "CAVA Group, Inc. owns and operates a chain of restaurants under the CAVA brand in the United States. It also offers dips, spreads, and dressings through grocery stores. In addition, the company provides online and mobile ordering platforms. The company was founded in 2006 and is headquartered in Was..."
  },
  "RIVN": {
    "name": "Rivian Automotive, Inc.",
    "industry": "Auto Manufacturers",
    "summary": "Rivian Automotive, Inc., together with its subsidiaries, designs, develops, manufactures, and sells electric vehicles and accessories. The company offers consumer vehicles, including a two-row, five-passenger pickup truck under the R1T brand, a three-row, seven-passenger sport utility vehicle under ..."
  },
  "OSK": {
    "name": "Oshkosh Corporation (Holding Co",
    "industry": "Farm & Heavy Construction Machinery",
    "summary": "Oshkosh Corporation provides purpose-built vehicles and equipment worldwide. The company operates through three segments: Access, Defense, and Vocational segment. The Access segment designs and manufactures aerial work platform and telehandlers for use in construction, industrial, and maintenance ap..."
  },
  "INSP": {
    "name": "Inspire Medical Systems, Inc.",
    "industry": "Medical Devices",
    "summary": "Inspire Medical Systems, Inc., a medical technology company, focuses on the development and commercialization of minimally invasive solutions for patients with obstructive sleep apnea (OSA) in the United States and internationally. The company offers Inspire system, a neurostimulation technology tha..."
  },
  "PRCT": {
    "name": "PROCEPT BioRobotics Corporation",
    "industry": "Medical Devices",
    "summary": "PROCEPT BioRobotics Corporation, a surgical robotics company, focuses on developing transformative solutions in urology in the United States and internationally. The company develops, manufactures, and sells AquaBeam Robotic System, an image-guided, surgical robotic system for use in minimally invas..."
  },
  "PWR": {
    "name": "Quanta Services, Inc.",
    "industry": "Engineering & Construction",
    "summary": "Quanta Services, Inc. offers infrastructure solutions for the electric and gas utility, renewable energy, communications, pipeline, and energy industries in the United States, Canada, Australia, and internationally. The company's Electric Power Infrastructure Solutions segment engages in the design,..."
  },
  "AAL": {
    "name": "American Airlines Group, Inc.",
    "industry": "Airlines",
    "summary": "American Airlines Group Inc., through its subsidiaries, operates as a network air carrier in the United States, Latin America, Atlantic, and Pacific. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas/Fort Worth, Los Ang..."
  },
  "NTAP": {
    "name": "NetApp, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "NetApp, Inc. provides a range of enterprise software, systems, and services that customers use to transform their data infrastructures in the United States, Canada, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. It operates through two segments, Hybrid Cloud and Public Cloud. ..."
  },
  "SONY": {
    "name": "Sony Group Corporation",
    "industry": "Consumer Electronics",
    "summary": "Sony Group Corporation designs, develops, produces, and sells electronic equipment, instruments, and devices for the consumer, professional, and industrial markets in Japan, the United States, Europe, China, the Asia-Pacific, and internationally. The company distributes software titles and add-on co..."
  },
  "TGT": {
    "name": "Target Corporation",
    "industry": "Discount Stores",
    "summary": "Target Corporation operates as a general merchandise retailer in the United States. The company offers apparel for women, men, young adults, kids, toddlers, and babies, as well as jewelry, accessories, and shoes; and beauty products, such as skin and bath care, cosmetics, hair care, oral care, deodo..."
  },
  "JBHT": {
    "name": "J.B. Hunt Transport Services, I",
    "industry": "Integrated Freight & Logistics",
    "summary": "J.B. Hunt Transport Services, Inc. provides surface transportation, delivery, and logistic services in the United States. It operates through five segments: Intermodal (JBI), Dedicated Contract Services (DCS), Integrated Capacity Solutions (ICS), Final Mile Services (FMS), and Truckload (JBT). The J..."
  },
  "MSTR": {
    "name": "Strategy Inc",
    "industry": "Software - Application",
    "summary": "Strategy Inc, together with its subsidiaries, operates as a bitcoin treasury company in the United States, Europe, the Middle East, Africa, and internationally. The company offers investors varying degrees of economic exposure to Bitcoin by offering a range of securities, including equity and fixed ..."
  },
  "GOOGL": {
    "name": "Alphabet Inc.",
    "industry": "Internet Content & Information",
    "summary": "Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ad..."
  },
  "CIBR": {
    "name": "First Trust NASDAQ Cybersecurit",
    "industry": "",
    "summary": "The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index includes securities of companies classified as \"cyber security\" companies by CTA. The fund is non-diversified."
  },
  "KLAC": {
    "name": "KLA Corporation",
    "industry": "Semiconductor Equipment & Materials",
    "summary": "KLA Corporation, together with its subsidiaries, designs, manufactures, and markets process control, process-enabling, and yield management solutions for the semiconductor and related electronics industries worldwide. The company operates through three segments: Semiconductor Process Control; Specia..."
  },
  "MVIS": {
    "name": "Microvision, Inc.",
    "industry": "Scientific & Technical Instruments",
    "summary": "MicroVision, Inc. develops and commercializes perception solutions for autonomy and mobility applications. It offers product suite, including perception software for industrial, automotive, and defense markets; MAVIN, a MEMS-based long-range sensor capable of small object detection; MOVIA, a flash-b..."
  },
  "BP": {
    "name": "BP p.l.c.",
    "industry": "Oil & Gas Integrated",
    "summary": "BP p.l.c., an integrated energy company, engages in the oil and gas business worldwide. The company operates through Gas & Low Carbon Energy, Oil Production & Operations, and Customers & Products segments. It engages in the production of natural gas, marketing, and trading activities, as well as sol..."
  },
  "OTIS": {
    "name": "Otis Worldwide Corporation",
    "industry": "Specialty Industrial Machinery",
    "summary": "Otis Worldwide Corporation engages in manufacturing, installation, and servicing of elevators and escalators in the United States, China, and internationally. The company operates in two segments, New Equipment and Service. The New Equipment segment designs, manufactures, sells, and installs a range..."
  },
  "SRPT": {
    "name": "Sarepta Therapeutics, Inc.",
    "industry": "Biotechnology",
    "summary": "Sarepta Therapeutics, Inc., a commercial-stage biopharmaceutical company, focuses on the discovery and development of RNA-targeted therapeutics, gene therapies, and other genetic therapeutic modalities for the treatment of rare diseases. It offers EXONDYS 51 injection to treat Duchenne muscular dyst..."
  },
  "CELH": {
    "name": "Celsius Holdings, Inc.",
    "industry": "Beverages - Non-Alcoholic",
    "summary": "Celsius Holdings, Inc. develops, processes, manufactures, markets, sells, and distributes functional energy drinks in the United States, North America, Europe, the Asia Pacific, and internationally. The company offers CELSIUS, a lifestyle and energy drink; CELSIUS Originals and Vibe, which are funct..."
  },
  "WULF": {
    "name": "TeraWulf Inc.",
    "industry": "Capital Markets",
    "summary": "TeraWulf Inc., together with its subsidiaries, operates as a digital asset technology company in the United States. The company develops, owns, and operates bitcoin mining facilities in New York and Pennsylvania. It is involved in the provision of miner hosting services to third-party entities. The ..."
  },
  "CP": {
    "name": "Canadian Pacific Kansas City Li",
    "industry": "Railroads",
    "summary": "Canadian Pacific Kansas City Limited, together with its subsidiaries, owns and operates a transcontinental freight railway in Canada, the United States, and Mexico. The transports bulk commodities, including grain, coal, potash, fertilizers, and sulphur; merchandise freight, such as forest products,..."
  },
  "WPM": {
    "name": "Wheaton Precious Metals Corp",
    "industry": "Gold",
    "summary": "Wheaton Precious Metals Corp. sells precious metals in North America, Europe, Africa, and South America. The company primarily produces and sells gold, silver, palladium, Platinum, and cobalt deposits. The company was formerly known as Silver Wheaton Corp. and changed its name to Wheaton Precious Me..."
  },
  "STLA": {
    "name": "Stellantis N.V.",
    "industry": "Auto Manufacturers",
    "summary": "Stellantis N.V. engages in the design, engineering, manufacturing, distribution, and sale of automobiles and light commercial vehicles, engines, transmission systems, metallurgical products, mobility services, and production systems worldwide. It provides luxury and premium vehicles; global sport ut..."
  },
  "TXN": {
    "name": "Texas Instruments Incorporated",
    "industry": "Semiconductors",
    "summary": "Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers in the United States, China, the rest of Asia, Europe, the Middle East, Africa, Japan, and internationally. It operates through Analog and Embedded Processing segments. The Analo..."
  },
  "DBX": {
    "name": "Dropbox, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Dropbox, Inc. provides a content collaboration platform in the United States and internationally. The company's platform allows individuals, families, teams, and organizations to collaborate and sign up for free through its website or app, as well as upgrade to a paid subscription plan for premium f..."
  },
  "FNV": {
    "name": "Franco-Nevada Corporation",
    "industry": "Gold",
    "summary": "Franco-Nevada Corporation operates as a royalty and stream company focused on precious metals in South America, Central America, Mexico, the United States, Canada, Australia, Europe, and internationally. It operates through Precious Metals, Other Mining and Energy segments. The company manages its p..."
  },
  "ETR": {
    "name": "Entergy Corporation",
    "industry": "Utilities - Regulated Electric",
    "summary": "Entergy Corporation, together with its subsidiaries, engages in the production and retail distribution of electricity in the United States. It generates, transmits, distributes, and sells electric power in portions of Arkansas, Louisiana, Mississippi, and Texas, including the City of New Orleans. It..."
  },
  "WDAY": {
    "name": "Workday, Inc.",
    "industry": "Software - Application",
    "summary": "Workday, Inc. provides enterprise cloud applications in the United States and internationally. The company offers a suite of financial management applications to maintain accounting information; manage financial processes, such as payables and receivables; identify real-time financial, operational, ..."
  },
  "SNPS": {
    "name": "Synopsys, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Synopsys, Inc. provides design IP solutions in the semiconductor and electronics industries. It operates in two segments, Design Automation and Design IP. The company offers Digital and Custom IC Design solution that provides digital design implementation solutions; Verification solution that offers..."
  },
  "GRAB": {
    "name": "Grab Holdings Limited",
    "industry": "Software - Application",
    "summary": "Grab Holdings Limited engages in the provision of superapps in Cambodia, Indonesia, Malaysia, Myanmar, the Philippines, Singapore, Thailand, and Vietnam. It operates through four segments: Deliveries, Mobility, Financial services, and Others. The company offers its Grab ecosystem, a single platform ..."
  },
  "PANW": {
    "name": "Palo Alto Networks, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Palo Alto Networks, Inc. provides cybersecurity solutions in the Americas, Europe, the Middle East, Africa, the Asia Pacific, and Japan. It offers Prisma Access, a secure access service edge solution; Strata Cloud Manager, a network security management solution; and Prisma AIRS to protect customers'..."
  },
  "ALAB": {
    "name": "Astera Labs, Inc.",
    "industry": "Semiconductors",
    "summary": "Astera Labs, Inc. designs, manufactures, and sells semiconductor-based connectivity solutions for cloud and AI infrastructure. It offers an intelligent connectivity platform, comprised of semiconductor-based, mixed-signal connectivity products that integrate a matrix of microcontrollers and sensors,..."
  },
  "BTCS": {
    "name": "BTCS Inc.",
    "industry": "Capital Markets",
    "summary": "BTCS Inc., a blockchain technology company, provides blockchain infrastructure services in the United States. The company operates a network of cloud-based validator nodes that perform essential roles in proof-of-stake and delegated proof-of-stake blockchain ecosystems. It also offers Builder+, an E..."
  },
  "NEE": {
    "name": "NextEra Energy, Inc.",
    "industry": "Utilities - Regulated Electric",
    "summary": "NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear, natural gas, and other clean energy. It also develops, constructs, and opera..."
  },
  "EME": {
    "name": "EMCOR Group, Inc.",
    "industry": "Engineering & Construction",
    "summary": "EMCOR Group, Inc. provides electrical and mechanical construction and facilities, building, and industrial services in the United States and the United Kingdom. It offers design, integration, installation, startup, operation, and maintenance services related to power transmission, distribution, and ..."
  },
  "PAA": {
    "name": "Plains All American Pipeline, L",
    "industry": "Oil & Gas Midstream",
    "summary": "Plains All American Pipeline, L.P., through its subsidiaries, engages in the pipeline transportation, terminaling, storage, and gathering of crude oil and natural gas liquids (NGL) in the United States and Canada. The company operates through two segments, Crude Oil and NGL. The Crude Oil segment of..."
  },
  "NTR": {
    "name": "Nutrien Ltd.",
    "industry": "Agricultural Inputs",
    "summary": "Nutrien Ltd. provides crop inputs and services. The company operates through four segments: Nutrien Ag Solutions, Potash, Nitrogen, and Phosphate. The Nutrien Ag Solutions segment distributes crop nutrients, crop protection products, seeds, and merchandise products; product application, soil and lea..."
  },
  "UVV": {
    "name": "Universal Corporation",
    "industry": "Tobacco",
    "summary": "Universal Corporation, a business-to-business agriproducts company, provides leaf tobacco and plant-based ingredients to food and beverage end markets worldwide. The company operates in two segments, Tobacco Operations and Ingredients Operations. The Tobacco Operations segment is involved in procuri..."
  },
  "GE": {
    "name": "GE Aerospace",
    "industry": "Aerospace & Defense",
    "summary": "General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and aircraft systems. The company operates through two segments, Commercial Engines & Services, and Defense & Propulsion Technologies...."
  },
  "COGT": {
    "name": "Cogent Biosciences, Inc.",
    "industry": "Biotechnology",
    "summary": "Cogent Biosciences, Inc., a biotechnology company, focuses on developing precision therapies for genetically defined diseases. Its lead product candidate includes bezuclastinib (CGT9486), a selective tyrosine kinase inhibitor in Phase 3 trial designed to target mutations within the KIT receptor tyro..."
  },
  "RRC": {
    "name": "Range Resources Corporation",
    "industry": "Oil & Gas E&P",
    "summary": "Range Resources Corporation operates as an independent natural gas, natural gas liquids (NGLs), and oil company in the United States. The company engages in the exploration, development, and acquisition of natural gas and oil properties located in the Appalachian region. It sells natural gas to util..."
  },
  "UMAC": {
    "name": "Unusual Machines, Inc.",
    "industry": "Computer Hardware",
    "summary": "Unusual Machines, Inc. engages in the commercial drone industry. The company offers small drones and essential components. It distributes their products through B2B sale, e-commerce site, and retail channel. The company was formerly known as AerocarveUS Corporation and changed its name to Unusual Ma..."
  },
  "PYPL": {
    "name": "PayPal Holdings, Inc.",
    "industry": "Credit Services",
    "summary": "PayPal Holdings, Inc. operates a technology platform that enables digital payments for merchants and consumers worldwide. The company operates a two-sided network at scale that connects merchants and consumers that enables its customers to connect, transact, and send and receive payments through onl..."
  },
  "WHD": {
    "name": "Cactus, Inc. Class A Common Sto",
    "industry": "Oil & Gas Equipment & Services",
    "summary": "Cactus, Inc., together with its subsidiaries, designs, manufactures, sells, and rents engineered pressure control and spoolable pipe technologies in the United States, Australia, Canada, the Middle East, and internationally. It operates in two segments, Pressure Control and Spoolable Technologies. T..."
  },
  "EXPE": {
    "name": "Expedia Group, Inc.",
    "industry": "Travel Services",
    "summary": "Expedia Group, Inc. operates as an online travel company in the United States and internationally. The company operates through B2C, B2B, and trivago segments. The B2C segment includes Brand Expedia, a full-service online travel brand offers various travel products and services; Hotels.com for lodgi..."
  },
  "EDIT": {
    "name": "Editas Medicine, Inc.",
    "industry": "Biotechnology",
    "summary": "Editas Medicine, Inc., a clinical stage genome editing company, focuses on developing transformative genomic medicines to treat a range of serious diseases. The company develops a proprietary gene editing platform based on CRISPR technology. It has a research collaboration with Juno Therapeutics, In..."
  },
  "MWH": {
    "name": "940",
    "industry": "",
    "summary": ""
  },
  "DE": {
    "name": "Deere & Company",
    "industry": "Farm & Heavy Construction Machinery",
    "summary": "Deere & Company engages in the manufacture and distribution of various equipment worldwide. The company operates through four segments: Production and Precision Agriculture, Small Agriculture and Turf, Construction and Forestry, and Financial Services. The Production and Precision Agriculture segmen..."
  },
  "SHEL": {
    "name": "Shell PLC",
    "industry": "Oil & Gas Integrated",
    "summary": "Shell plc operates as an energy and petrochemical company Europe, Asia, Oceania, Africa, the United States, and other Americas. It operates through Integrated Gas; Upstream; Marketing; Chemicals and Products; and Renewables and Energy Solutions segments. The company explores for and extracts natural..."
  },
  "WWR": {
    "name": "Westwater Resources, Inc.",
    "industry": "Other Industrial Metals & Mining",
    "summary": "Westwater Resources, Inc., an energy technology company, focuses on developing battery-grade natural graphite materials in the United States. It primarily holds interests in the Kellyton Graphite plant located near Kellyton, Alabama; and the Coosa Graphite project covering an area of approximately 4..."
  },
  "M": {
    "name": "Macy's Inc",
    "industry": "Department Stores",
    "summary": "Macy's, Inc., an omni-channel retail organization, operates stores, websites, and mobile applications in the United States. It sells a range of merchandise, such as apparel and accessories for men, women, and kids; cosmetics; home furnishings; and other consumer goods under the Macy's, Bloomingdale'..."
  },
  "WU": {
    "name": "Western Union Company (The)",
    "industry": "Credit Services",
    "summary": "The Western Union Company provides money movement and payment services in the United States and internationally. It operates through two segments, Consumer Money Transfer and Consumer Services. The Consumer Money Transfer segment facilitates money transfers for international cross-border and intra-c..."
  },
  "ALV": {
    "name": "Autoliv, Inc.",
    "industry": "Auto Parts",
    "summary": "Autoliv, Inc., through its subsidiaries, develops, manufactures, and supplies passive safety systems to the automotive industry in Europe, the Americas, China, Japan, and rest of Asia. The company offers passive safety systems, including modules and components for frontal-impact airbag protection sy..."
  },
  "GEHC": {
    "name": "GE HealthCare Technologies Inc.",
    "industry": "Medical Devices",
    "summary": "GE HealthCare Technologies Inc. engages in the development, manufacture, and marketing of products, services, and complementary digital solutions used in the diagnosis, treatment, and monitoring of patients in the United States, Canada, and internationally. The company operates through four segments..."
  },
  "TJX": {
    "name": "TJX Companies, Inc. (The)",
    "industry": "Apparel Retail",
    "summary": "The TJX Companies, Inc., together with its subsidiaries, operates as an off-price apparel and home fashions retailer worldwide. The company operates through four segments: Marmaxx, HomeGoods, TJX Canada, and TJX International. It offers family apparel comprising footwear; accessories, such as beauty..."
  },
  "SERV": {
    "name": "Serve Robotics Inc.",
    "industry": "Specialty Industrial Machinery",
    "summary": "Serve Robotics Inc. designs, develops, and operates low-emission robots that serve people in public spaces for food delivery activity in the United States. It builds self-driving delivery robots. Serve Robotics Inc. was founded in 2017 and is headquartered in Redwood City, California."
  },
  "CLF": {
    "name": "Cleveland-Cliffs Inc.",
    "industry": "Steel",
    "summary": "Cleveland-Cliffs Inc. operates as a steel producer in the in the United States and Canada. It offers hot-rolled, cold-rolled, and coated products, such as aluminized, electrogalvanized, and galvalume products, as well as galvanneal and hot-dipped galvanized products; stainless and electrical product..."
  },
  "ENTG": {
    "name": "Entegris, Inc.",
    "industry": "Semiconductor Equipment & Materials",
    "summary": "Entegris, Inc. provides advanced materials and process solutions for the semiconductor and other high-technology industries in North America, Taiwan, South Korea, Japan, China, Europe, and Southeast Asia. The company operates in two segments, Materials Solutions (MS) and Advanced Purity Solutions (A..."
  },
  "ORCL": {
    "name": "Oracle Corporation",
    "industry": "Software - Infrastructure",
    "summary": "Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning ERP, Oracle Fusion cloud ente..."
  },
  "LRCX": {
    "name": "Lam Research Corporation",
    "industry": "Semiconductor Equipment & Materials",
    "summary": "Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits in the United States, China, Korea, Taiwan, Japan, Southeast Asia, and Europe. The company offers ALTUS systems to deposit conformal or..."
  },
  "INTR": {
    "name": "Inter & Co. Inc.",
    "industry": "Banks - Regional",
    "summary": "Inter & Co, Inc., through its subsidiaries, engages in the banking and spending, investments, insurance brokerage, and inter shop businesses in Brazil and the United States. The company offers banking products and services, including checking accounts; cards; deposits; loans and advances; and other ..."
  },
  "LKQ": {
    "name": "LKQ Corporation",
    "industry": "Auto Parts",
    "summary": "LKQ Corporation engages in the distribution of replacement parts, components, and systems used in the repair and maintenance of vehicles and specialty vehicle aftermarket products and accessories. The company operates through four segments: Wholesale-North America, Europe, Specialty, and Self Servic..."
  },
  "AXON": {
    "name": "Axon Enterprise, Inc.",
    "industry": "Aerospace & Defense",
    "summary": "Axon Enterprise, Inc. provides public safety technology solutions in the United States and internationally. The company operates in two segments, Software and Sensors, and TASER. The Software and Sensors segment develops, manufactures, and sells integrated hardware and cloud-based software solutions..."
  },
  "KTOS": {
    "name": "Kratos Defense & Security Solut",
    "industry": "Aerospace & Defense",
    "summary": "Kratos Defense & Security Solutions, Inc., a technology company, provides technology, products, and system and software for the defense, national security, and commercial markets in the United States, other North America, the Asia Pacific, the Middle East, Europe, and Internationally. The company op..."
  },
  "KOPN": {
    "name": "Kopin Corporation",
    "industry": "Electronic Components",
    "summary": "Kopin Corporation, together with its subsidiaries, develops, manufactures, and sells microdisplays, subassemblies, and related components for defense, enterprise, industrial, and consumer products in the United States, the Asia-Pacific, Europe, and internationally. It offers miniature active-matrix ..."
  },
  "AVGO": {
    "name": "Broadcom Inc.",
    "industry": "Semiconductors",
    "summary": "Broadcom Inc. designs, develops, and supplies various semiconductor devices and infrastructure software solutions internationally. The company operates in two segments: Semiconductor Solutions and Infrastructure Software. The company offers networking connectivity, such as custom silicon solutions, ..."
  },
  "SVM": {
    "name": "Silvercorp Metals Inc.",
    "industry": "Silver",
    "summary": "Silvercorp Metals Inc., together with its subsidiaries, acquires, explores, develops, and mines mineral properties in China. It explores for copper, silver, gold, lead, and zinc metals. The company was formerly known as SKN Resources Ltd. and changed its name to Silvercorp Metals Inc. in May 2005. S..."
  },
  "LAZR": {
    "name": "Luminar Technologies, Inc.",
    "industry": "Auto Parts",
    "summary": "Luminar Technologies, Inc., an automotive technology company, provides sensor technologies and software for passenger cars and commercial trucks in North America, the Asia Pacific, Europe, and the Middle East. It operates in two segments, Autonomy Solutions and Advanced Technologies and Services. Th..."
  },
  "MCD": {
    "name": "McDonald's Corporation",
    "industry": "Restaurants",
    "summary": "McDonald's Corporation owns, operates, and franchises restaurants under the McDonald's brand in the United States and internationally. It offers food and beverages, including hamburgers and cheeseburgers, various chicken sandwiches, fries, shakes, desserts, sundaes, soft serve cones, cookies, pies, ..."
  },
  "MARA": {
    "name": "MARA Holdings, Inc.",
    "industry": "Capital Markets",
    "summary": "MARA Holdings, Inc. operates as a digital asset technology company in the United States and Europe. It also provides technology solutions to optimize data center operations, such as liquid immersion cooling and firmware for bitcoin miners. The company was formerly known as Marathon Digital Holdings,..."
  },
  "RCAT": {
    "name": "Red Cat Holdings, Inc.",
    "industry": "Aerospace & Defense",
    "summary": "Red Cat Holdings, Inc., together with its subsidiaries, provides products, services, and solutions to the drone industry in the United States. It integrates robotic hardware and software solutions for military, government, and commercial operations; and offers short range reconnaissance, med range r..."
  },
  "AXSM": {
    "name": "Axsome Therapeutics, Inc.",
    "industry": "Biotechnology",
    "summary": "Axsome Therapeutics, Inc., a biopharmaceutical company, develops and delivers novel therapies for the management of central nervous system (CNS) disorders in the United States. The company's commercial product portfolio includes Auvelity (dextromethorphan-bupropion), a N-methyl-D-aspartate receptor ..."
  },
  "QLYS": {
    "name": "Qualys, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Qualys, Inc. provides cloud-based platform delivering information technology (IT), security, and compliance solutions in the United States and internationally. It offers Qualys Cloud Apps, which include Cybersecurity Asset Management and External Attack Surface Management; Vulnerability Management, ..."
  },
  "TEAM": {
    "name": "Atlassian Corporation",
    "industry": "Software - Application",
    "summary": "Atlassian Corporation provides a collaboration software that enables organizations to connect all teams through a system of work that unlocks productivity at scale worldwide. Its product portfolio includes Jira, a project management platform for planning, tracking, and managing work; Confluence, a c..."
  },
  "WOLF": {
    "name": "Wolfspeed, Inc.",
    "industry": "Semiconductors",
    "summary": "Wolfspeed, Inc., a semiconductor company, focuses on silicon carbide and gallium nitride (GaN) technologies in Europe, Hong Kong, China, rest of Asia Pacific, the United States, and internationally. The company offers silicon carbide and GaN materials, including silicon carbide bare wafers, epitaxia..."
  },
  "SNOW": {
    "name": "Snowflake Inc.",
    "industry": "Software - Application",
    "summary": "Snowflake Inc. provides a cloud-based data platform for various organizations in the United States and internationally. The company's platform includes artificial intelligence (AI) Data Cloud, which enables customers to consolidate data into a single source of truth to drive meaningful business insi..."
  },
  "TERN": {
    "name": "Terns Pharmaceuticals, Inc.",
    "industry": "Biotechnology",
    "summary": "Terns Pharmaceuticals, Inc., a clinical-stage biopharmaceutical company, develops small-molecule product candidates for the treatment of oncology and obesity. The company develops TERN-701, an allosteric BCR-ABL tyrosine kinase inhibitor (TKI) that is in Phase 1 clinical trial for chronic myeloid le..."
  },
  "NOV": {
    "name": "NOV Inc.",
    "industry": "Oil & Gas Equipment & Services",
    "summary": "NOV Inc. designs, constructs, manufactures, and sells systems, components, and products for oil and gas drilling and production, and industrial and renewable energy sectors in the United States and internationally. It operates in two segments, Energy Equipment, and Energy Products and Services. The ..."
  },
  "TKO": {
    "name": "TKO Group Holdings, Inc.",
    "industry": "Entertainment",
    "summary": "TKO Group Holdings, Inc. operates as a sports and entertainment company. The company owns and manages sports and entertainment intellectual property; produces and licenses live events, programing, and long-form and short-form content, reality series, and other filmed entertainment on digital and lin..."
  },
  "MOD": {
    "name": "Modine Manufacturing Company",
    "industry": "Auto Parts",
    "summary": "Modine Manufacturing Company designs, engineers, tests, manufactures, and sells mission-critical thermal solutions in the United States, Canada, Italy, Hungary, the United Kingdom, China, and internationally. The company offers heat transfer products, including round tube plate fin construction; gas..."
  },
  "HPP": {
    "name": "Hudson Pacific Properties, Inc.",
    "industry": "REIT - Office",
    "summary": "Hudson Pacific Properties (NYSE: HPP) is a real estate investment trust serving dynamic tech and media tenants in global epicenters for these synergistic, converging and secular growth industries. Hudson Pacific's unique and high-barrier tech and media focus leverages a full-service, end-to-end valu..."
  },
  "EIX": {
    "name": "Edison International",
    "industry": "Utilities - Regulated Electric",
    "summary": "Edison International, through its subsidiaries, engages in the generation and distribution of electric power. The company supplies and delivers through its electrical infrastructure to an approximately 50,000 square-mile area of southern California. It serves residential, commercial, industrial, pub..."
  },
  "DXCM": {
    "name": "DexCom, Inc.",
    "industry": "Medical Devices",
    "summary": "DexCom, Inc., a medical device company, focuses on the design, development, and commercialization of continuous glucose monitoring (CGM) systems in the United States and internationally. The company provides its systems for the management of diabetes and metabolic health by patients, caregivers, and..."
  },
  "MNTS": {
    "name": "Momentus Inc.",
    "industry": "Aerospace & Defense",
    "summary": "Momentus Inc. operates as a commercial space company in the United States. The company offers satellites, satellite buses, and satellite technologies, including solar array and transportation and infrastructure services, such as space transportation, hosted payloads, and other in-orbit services to e..."
  },
  "RMD": {
    "name": "ResMed Inc.",
    "industry": "Medical Instruments & Supplies",
    "summary": "ResMed Inc. develops, manufactures, distributes, and markets medical devices and cloud-based software applications to diagnose, treat, and manage respiratory disorders in the United States and internationally. The company operates in two segments, Sleep and Breathing Health, and Residential Care Sof..."
  },
  "DECK": {
    "name": "Deckers Outdoor Corporation",
    "industry": "Footwear & Accessories",
    "summary": "Deckers Outdoor Corporation, together with its subsidiaries, designs, markets, and distributes footwear, apparel, and accessories for casual lifestyle use and high-performance activities in the United States and internationally. The company offers premium footwear, apparel, and accessories under the..."
  },
  "SGML": {
    "name": "Sigma Lithium Corporation",
    "industry": "Other Industrial Metals & Mining",
    "summary": "Sigma Lithium Corporation engages in the exploration and development of lithium deposits in Brazil. It holds a 100% interest in the Grota do Cirilo, Genipapo, Santa Clara, and São José properties comprising 29 mineral rights covering an area of approximately 185 square kilometers located in the Araç..."
  },
  "HUBS": {
    "name": "HubSpot, Inc.",
    "industry": "Software - Application",
    "summary": "HubSpot, Inc., together with its subsidiaries, provides a cloud-based customer relationship management (CRM) platform for businesses in the Americas, Europe, and the Asia Pacific. The company's CRM platform includes Marketing Hub, a toolset for marketing automation and email, social media, SEO, and ..."
  },
  "FDX": {
    "name": "FedEx Corporation",
    "industry": "Integrated Freight & Logistics",
    "summary": "FedEx Corporation, together with its subsidiaries, provides transportation, e-commerce, and business services in the United States and internationally. It operates through Federal Express and FedEx Freight segments. The company offers transportation services, including express, freight, less-than-tr..."
  },
  "VKTX": {
    "name": "Viking Therapeutics, Inc.",
    "industry": "Biotechnology",
    "summary": "Viking Therapeutics, Inc., a clinical-stage biopharmaceutical company, focuses on the development of novel therapies for metabolic and endocrine disorders. The company's lead drug candidate is VK2809, an orally available tissue and receptor-subtype selective agonist of the thyroid hormone receptor b..."
  },
  "JNJ": {
    "name": "Johnson & Johnson",
    "industry": "Drug Manufacturers - General",
    "summary": "Johnson & Johnson, together with its subsidiaries, engages in the research and development, manufacture, and sale of various products in the healthcare field worldwide. It operates in two segments, Innovative Medicine and MedTech. The Innovative Medicine segment offers products for various therapeut..."
  },
  "BSX": {
    "name": "Boston Scientific Corporation",
    "industry": "Medical Devices",
    "summary": "Boston Scientific Corporation develops, manufactures, and markets medical devices for use in various interventional medical specialties worldwide. It operates in two segments, MedSurg and Cardiovascular. The company offers devices to diagnose and treat a range of gastrointestinal conditions, such as..."
  },
  "CCL": {
    "name": "Carnival Corporation",
    "industry": "Travel Services",
    "summary": "Carnival Corporation & plc, a cruise company, provides leisure travel services in North America, Australia, Europe, and internationally. The company operates through four segments: North America Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destina..."
  },
  "CIEN": {
    "name": "Ciena Corporation",
    "industry": "Communication Equipment",
    "summary": "Ciena Corporation, a network technology company, provides hardware, software, and services for various network operators in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and India. It operates through Networking Platforms, Platform Software and Services, Blue Planet Automat..."
  },
  "SCCO": {
    "name": "Southern Copper Corporation",
    "industry": "Copper",
    "summary": "Southern Copper Corporation engages in mining, exploring, smelting, and refining copper and other minerals in Peru, Mexico, Argentina, Ecuador, and Chile. The company is involved in the mining, milling, and flotation of copper ore to produce copper and molybdenum concentrates; smelting of copper con..."
  },
  "TDG": {
    "name": "Transdigm Group Incorporated",
    "industry": "Aerospace & Defense",
    "summary": "TransDigm Group Incorporated designs, produces, and supplies aircraft components in the United States and internationally. The Power & Control segment offers mechanical/electro-mechanical actuators and controls, ignition systems and engine technology, specialized pumps and valves, power conditioning..."
  },
  "GPK": {
    "name": "Graphic Packaging Holding Compa",
    "industry": "Packaging & Containers",
    "summary": "Graphic Packaging Holding Company, together with its subsidiaries, designs, produces, and sells consumer packaging products to brands in food, beverage, foodservice, household, and other consumer products in the Americas, Europe, and the Asia Pacific. It operates through three segments: Americas Pap..."
  },
  "FRMI": {
    "name": "Fermi Inc.",
    "industry": "",
    "summary": ""
  },
  "IESC": {
    "name": "IES Holdings, Inc.",
    "industry": "Engineering & Construction",
    "summary": "IES Holdings, Inc. designs and installs integrated electrical and technology systems and provides infrastructure products and services in the United States. The Communications segment designs, builds, and maintains communications infrastructure within data centers for co-location and managed hosting..."
  },
  "ATRO": {
    "name": "Astronics Corporation",
    "industry": "Aerospace & Defense",
    "summary": "Astronics Corporation, through its subsidiaries, designs and manufactures products for the aerospace, defense, and electronics industries in the United States, rest of North America, Asia, Europe, South America, and internationally. It operates in two segments, Aerospace and Test Systems. The Aerosp..."
  },
  "STRL": {
    "name": "Sterling Infrastructure, Inc.",
    "industry": "Engineering & Construction",
    "summary": "Sterling Infrastructure, Inc. engages in the provision of e-infrastructure, transportation, and building solutions in the United States. It operates through three segments: E-Infrastructure Solutions, Transportation Solutions, and Building Solutions. The E-Infrastructure Solutions segment provides s..."
  },
  "VERX": {
    "name": "Vertex, Inc.",
    "industry": "Software - Application",
    "summary": "Vertex, Inc., together with its subsidiaries, provides enterprise tax technology solutions for retail trade, wholesale trade, and manufacturing industries in the United States and internationally. The company offers tax determination; compliance and reporting, including workflow management tools; ta..."
  },
  "LEN": {
    "name": "Lennar Corporation",
    "industry": "Residential Construction",
    "summary": "Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding South Central, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments...."
  },
  "LII": {
    "name": "Lennox International, Inc.",
    "industry": "Building Products & Equipment",
    "summary": "Lennox International Inc., together with its subsidiaries, designs, manufactures, and markets products for the heating, ventilation, air conditioning, and refrigeration markets in the United States, Canada, and internationally. The Home Comfort Solutions segment provides furnaces, air conditioners, ..."
  },
  "NXT": {
    "name": "Nextpower Inc.",
    "industry": "Solar",
    "summary": "Nextpower Inc. provides solar tracker technologies and solutions for utility-scale and distributed generation solar applications in the United States and internationally. The company offers tracking solutions, including NX Horizon, a solar tracking solution; NX Horizon-XTR, a terrain-following track..."
  },
  "DOCU": {
    "name": "DocuSign, Inc.",
    "industry": "Software - Application",
    "summary": "DocuSign, Inc. provides electronic signature solution in the United States and internationally. The company offers AI-powered intelligent agreement management (IAM) platform to optimize the agreement management process and provides e-signature solution that enables sending and signing of agreements ..."
  },
  "BKNG": {
    "name": "Booking Holdings Inc. Common St",
    "industry": "Travel Services",
    "summary": "Booking Holdings Inc., together with its subsidiaries, provides online and traditional travel and restaurant reservations and related services in the United States, the Netherlands, and internationally. The company operates Booking.com, which offers online accommodation reservations; and Priceline, ..."
  },
  "TT": {
    "name": "Trane Technologies plc",
    "industry": "Building Products & Equipment",
    "summary": "Trane Technologies plc designs, manufactures, sells, and services of solutions for heating, ventilation, air conditioning, and custom and transport refrigeration. It offers air conditioners, exchangers, and handlers; airside and terminal devices; air sourced heat pumps; chillers; coils and condenser..."
  },
  "ENVX": {
    "name": "Enovix Corporation",
    "industry": "Electrical Equipment & Parts",
    "summary": "Enovix Corporation designs, develops, and manufactures lithium-ion battery cells in the United States and internationally. It serves wearables and IoT, smartphone, computing, electrical vehicles, and original equipment manufacturers. The company was founded in 2007 and is headquartered in Fremont, C..."
  },
  "VYM": {
    "name": "Vanguard High Dividend Yield ET",
    "industry": "",
    "summary": "The manager employs an indexing investment approach designed to track the performance of the index, which consists of common stocks of companies that pay dividends that generally are higher than average. The adviser attempts to replicate the target index by investing all, or substantially all, of th..."
  },
  "AFRM": {
    "name": "Affirm Holdings, Inc.",
    "industry": "Credit Services",
    "summary": "Affirm Holdings, Inc. operates payment network in the United States, Canada, and internationally. Its platform includes point-of-sale payment solution for consumers, merchant commerce solutions, and a consumer-focused app. The company's commerce platform, agreements with originating banks, and capit..."
  },
  "LI": {
    "name": "Li Auto Inc.",
    "industry": "Auto Manufacturers",
    "summary": "Li Auto Inc. operates in the energy vehicle market in the People's Republic of China. It designs, develops, manufactures, and sells premium smart electric vehicles. The company's product line comprises multi-purpose vehicles and sport utility vehicles. It offers sales and after sales management, and..."
  },
  "ACMR": {
    "name": "ACM Research, Inc.",
    "industry": "Semiconductor Equipment & Materials",
    "summary": "ACM Research, Inc., together with its subsidiaries, develops, manufactures, and sells capital equipment worldwide. It also develops, manufactures, and sells a range of packaging tools to wafer assembly and packaging customers. The company provides Wet Cleaning Equipment for Front End Production Proc..."
  },
  "WH": {
    "name": "Wyndham Hotels & Resorts, Inc.",
    "industry": "Lodging",
    "summary": "Wyndham Hotels & Resorts, Inc. operates as a hotel franchisor in the United States and internationally. The company licenses its lodging brands; and provides related services to third-party hotel owners and others, as well as full-service international managed business services. It is also involved ..."
  },
  "MELI": {
    "name": "MercadoLibre, Inc.",
    "industry": "Internet Retail",
    "summary": "MercadoLibre, Inc. operates online commerce platforms in Brazil, Mexico, Argentina, and internationally. The company operates Mercado Libre Marketplace, an online commerce platform that can be accessed through mobile app or website; and Mercado Pago, a financial technology solution platform, which o..."
  },
  "GGB": {
    "name": "Gerdau S.A.",
    "industry": "Steel",
    "summary": "Gerdau S.A., together with its subsidiaries, operates as a steel producer company. The company operates through Brazil Business, North America Business, South America Business, and Special Steel Business segments. It provides semi-finished products, including billets, blooms, and slabs; common long-..."
  },
  "BTI": {
    "name": "British American Tobacco  Indus",
    "industry": "Tobacco",
    "summary": "British American Tobacco p.l.c. provides tobacco and nicotine products to consumers in the Americas, Europe, the Asia-Pacific, the Middle East, Africa, and the United States. It offers vapour, heated, and modern oral nicotine products; combustible cigarettes; and traditional oral products, such as s..."
  },
  "NVT": {
    "name": "nVent Electric plc",
    "industry": "Electrical Equipment & Parts",
    "summary": "nVent Electric plc designs, manufactures, markets, installs, and services electrical connection and protection solutions in North America, Europe, the Middle East, Africa, the Asia Pacific, and internationally. It operates in two segments, Enclosures, and Electrical & Fastening Solutions. The Enclos..."
  },
  "NNE": {
    "name": "Nano Nuclear Energy Inc.",
    "industry": "Specialty Industrial Machinery",
    "summary": "NANO Nuclear Energy Inc. operates as a nuclear energy company. The company is developing KRONOS MMR Energy System, a high-temperature gas-cooled reactor; LOKI MMR, a compact microreactor designed for remote and specialized applications; ZEUS, a solid core battery reactor; and ODIN, a low-pressure sa..."
  },
  "UTHR": {
    "name": "United Therapeutics Corporation",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "summary": "United Therapeutics Corporation, a biotechnology company, engages in the development and commercialization of products to address the unmet medical needs of patients with chronic and life-threatening diseases in the United States and internationally. The company offers Tyvaso DPI, an inhaled dry pow..."
  },
  "ONDS": {
    "name": "Ondas Inc",
    "industry": "Communication Equipment",
    "summary": "Ondas Inc. provides private wireless, drone, and automated data solutions in the United States and internationally. It operates through two segments: Ondas Networks and Ondas Autonomous Systems. The company designs, develops, manufactures, sells, and supports FullMAX, a software defined radio (SDR) ..."
  },
  "RGC": {
    "name": "Regencell Bioscience Holdings L",
    "industry": "Drug Manufacturers - Specialty & Generic",
    "summary": "Regencell Bioscience Holdings Limited operates as a Traditional Chinese medicine (TCM) bioscience company in Hong Kong. It focuses on the research, development, and commercialization of TCM for the treatment of neurocognitive disorders and degeneration, primarily for attention deficit hyperactivity ..."
  },
  "COMP": {
    "name": "Compass, Inc.",
    "industry": "Real Estate Services",
    "summary": "Compass, Inc. provides real estate brokerage services in the United States. It operates the Compass Platform, a technology platform that provides an integrated suite of cloud-based software for customer relationship management, marketing, client service, brokerage services, and other functionalities..."
  },
  "XOM": {
    "name": "Exxon Mobil Corporation",
    "industry": "Oil & Gas Integrated",
    "summary": "Exxon Mobil Corporation engages in the exploration and production of crude oil and natural gas in the United States, Guyana, Canada, the United Kingdom, Singapore, France, and internationally. It operates through Upstream, Energy Products, Chemical Products, and Specialty Products segments. The Upst..."
  },
  "KOD": {
    "name": "Kodiak Sciences Inc",
    "industry": "Biotechnology",
    "summary": "Kodiak Sciences Inc., a clinical stage biopharmaceutical company, engages in the research, development, and commercialization of therapeutics to treat retinal diseases. Its lead product candidate is tarcocimab tedromer (KSI-301), an anti-vascular endothelial growth factor (VEGF) antibody biopolymer ..."
  },
  "CZR": {
    "name": "Caesars Entertainment, Inc.",
    "industry": "Resorts & Casinos",
    "summary": "Caesars Entertainment, Inc. operates as a gaming and hospitality company. The company owns, leases, brands, or manages domestic properties in 18 states with slot machines, video lottery terminals and e-tables, and hotel rooms, as well as table games, including poker. It also operates and conducts re..."
  },
  "DPZ": {
    "name": "Domino's Pizza Inc",
    "industry": "Restaurants",
    "summary": "Domino's Pizza, Inc. operates as a pizza company in the United States and internationally. The company operates through three segments: U.S. Stores, International Franchise, and Supply Chain. It offers pizzas under the Domino's brand name through company-owned and franchised stores. It provides brea..."
  },
  "GFS": {
    "name": "GlobalFoundries Inc.",
    "industry": "Semiconductors",
    "summary": "GlobalFoundries Inc., a semiconductor foundry, provides range of mainstream wafer fabrication services and technologies worldwide. It offers semiconductor devices, including microprocessors, mobile application processors, baseband processors, network processors, radio frequency modems, microcontroll..."
  },
  "IONQ": {
    "name": "IonQ, Inc.",
    "industry": "Computer Hardware",
    "summary": "IonQ, Inc. develops quantum computers and networks in the United States. It sells access to quantum computers of various qubit capacities. The company also makes access to its quantum computers through cloud platforms, such as Amazon Web Services (AWS) Amazon Braket, Microsoft's Azure Quantum, and G..."
  },
  "RELY": {
    "name": "Remitly Global, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Remitly Global, Inc. engages in the provision of digital financial services in the United States, Canada, and internationally. It offers cross-border remittances and complementary financial services through mobile application and website. Remitly Global, Inc. was incorporated in 2011 and is headquar..."
  },
  "APLD": {
    "name": "Applied Digital Corporation",
    "industry": "Information Technology Services",
    "summary": "Applied Digital Corporation designs, develops, and operates digital infrastructure solutions to high-performance computing (HPC) and artificial intelligence industries in North America. It operates through: Data Center Hosting Business, and HPC Hosting Business. The company offers infrastructure ser..."
  },
  "XLU": {
    "name": "State Street Utilities Select S",
    "industry": "",
    "summary": "In seeking to track the performance of the index, the fund employs a replication strategy. It generally invests substantially all, but at least 95%, of its total assets in the securities comprising the index. The index includes securities of companies from the following industries: electric utilitie..."
  },
  "RGTI": {
    "name": "Rigetti Computing, Inc.",
    "industry": "Computer Hardware",
    "summary": "Rigetti Computing, Inc., through its subsidiaries, builds quantum computers and the superconducting quantum processors the United States, the United Kingdom, rest of Europe, Asia, and internationally. The company offers quantum processing units (QPUs) and quantum computing systems through the cloud ..."
  },
  "LBRT": {
    "name": "Liberty Energy Inc.",
    "industry": "Oil & Gas Equipment & Services",
    "summary": "Liberty Energy Inc.,an integrated energy services and technology company, provides hydraulic fracturing services and related technologies onshore oil, natural gas, and enhanced geothermal exploration and production companies in North America. It offers wireline services, proppant delivery solutions,..."
  },
  "ENB": {
    "name": "Enbridge Inc",
    "industry": "Oil & Gas Midstream",
    "summary": "Enbridge Inc., together with its subsidiaries, operates as an energy infrastructure company. The company operates through four segments: Liquids Pipelines, Gas Transmission, Gas Distribution and Storage, and Renewable Power Generation. The Liquids Pipelines segment operates pipelines and related ter..."
  },
  "SBSW": {
    "name": "D/B/A Sibanye-Stillwater Limite",
    "industry": "Other Precious Metals & Mining",
    "summary": "Sibanye Stillwater Limited, together with its subsidiaries, operates as a precious metals mining company in South Africa, the United States, Europe, and Australia. The company produces gold; platinum group metals (PGMs), including palladium, platinum, rhodium, iridium, and ruthenium; chrome; lithium..."
  },
  "RCL": {
    "name": "Royal Caribbean Cruises Ltd.",
    "industry": "Travel Services",
    "summary": "Royal Caribbean Cruises Ltd. operates as a cruise company worldwide. The company operates cruises under the Royal Caribbean International, Celebrity Cruises, and Silversea Cruises brands, which comprise a range of itineraries. As of February 12, 2025, it operated 67 ships. Royal Caribbean Cruises Lt..."
  },
  "VALE": {
    "name": "VALE S.A.",
    "industry": "Other Industrial Metals & Mining",
    "summary": "Vale S.A., together with its subsidiaries, produces iron ore and nickel in Asia, the Americas, Europe, and internationally. It operates through Iron Solutions and Energy Transition Materials segments. The company extracts and produces iron ore, iron ore pellets, briquettes, and other ferrous product..."
  },
  "WB": {
    "name": "Weibo Corporation",
    "industry": "Internet Content & Information",
    "summary": "Weibo Corporation, through its subsidiaries, operates as a social media platform for people to create, discover, and distribute content in the People's Republic of China. It operates through two segments, Advertising and Marketing Services; and Value-Added Services. The company offers discovery prod..."
  },
  "SLV": {
    "name": "iShares Silver Trust",
    "industry": "",
    "summary": "The Trust seeks to reflect such performance before payment of the Trust's expenses and liabilities. It is not actively managed. The Trust does not engage in any activities designed to obtain a profit from, or to ameliorate losses caused by, changes in the price of silver."
  },
  "HPE": {
    "name": "Hewlett Packard Enterprise Comp",
    "industry": "Communication Equipment",
    "summary": "Hewlett Packard Enterprise Company, together with its subsidiaries, develops intelligent solutions in the United States, the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and internationally. It operates in five segments: Server, Hybrid Cloud, Networking, Financial Services, an..."
  },
  "STNE": {
    "name": "StoneCo Ltd.",
    "industry": "Software - Infrastructure",
    "summary": "StoneCo Ltd. provides financial technology and software solutions to merchants and integrated partners to conduct electronic commerce across in-store, online, and mobile channels in Brazil. The company offers financial services, including payment, prepayment, digital banking, and credit solutions. I..."
  },
  "ABNB": {
    "name": "Airbnb, Inc.",
    "industry": "Travel Services",
    "summary": "Airbnb, Inc., together with its subsidiaries, operates a platform that enables hosts to offer stays and experiences to guests worldwide. Its marketplace connects hosts and guests online or through mobile devices to book spaces and experiences. It also offers gift cards. The company was formerly know..."
  },
  "EMR": {
    "name": "Emerson Electric Company",
    "industry": "Specialty Industrial Machinery",
    "summary": "Emerson Electric Co., a technology and software company, provides various solutions in the Americas, Asia, the Middle East, Africa, and Europe. It operates through Final Control, Measurement & Analytical, Discrete Automation, Safety & Productivity, Control Systems & Software, and Test & Measurement ..."
  },
  "EQNR": {
    "name": "Equinor ASA",
    "industry": "Oil & Gas Integrated",
    "summary": "Equinor ASA, an energy company, engages in the exploration, production, transportation, refining, and marketing of petroleum and other forms of energy in Norway and internationally. It operates through Exploration & Production Norway; Exploration & Production International; Exploration & Production ..."
  },
  "PRIM": {
    "name": "Primoris Services Corporation",
    "industry": "Engineering & Construction",
    "summary": "Primoris Services Corporation provides infrastructure services primarily in the United States and Canada. The company operates in two segments, Utilities and Energy. The Utilities segment offers installation and maintenance of new and existing natural gas and electric utility distribution and transm..."
  },
  "ANF": {
    "name": "Abercrombie & Fitch Company",
    "industry": "Apparel Retail",
    "summary": "Abercrombie & Fitch Co., through its subsidiaries, operates as an omnichannel retailer in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. The company offers an assortment of apparel, personal care products, and accessories for men, women, and kids under the Abercrombie & Fitch, ..."
  },
  "NVO": {
    "name": "Novo Nordisk A/S",
    "industry": "Drug Manufacturers - General",
    "summary": "Novo Nordisk A/S, together with its subsidiaries, engages in the research and development, manufacture, and distribution of pharmaceutical products. It operates through two segments, Obesity and Diabetes Care, and Rare Disease. The Obesity and Diabetes care segment provides products for diabetes, ob..."
  },
  "MNST": {
    "name": "Monster Beverage Corporation",
    "industry": "Beverages - Non-Alcoholic",
    "summary": "Monster Beverage Corporation, through its subsidiaries, engages in development, marketing, sale, and distribution of energy drink beverages and concentrates in the United States and internationally. The company operates through four segments: Monster Energy Drinks, Strategic Brands, Alcohol Brands, ..."
  },
  "EC": {
    "name": "Ecopetrol S.A.",
    "industry": "Oil & Gas Integrated",
    "summary": "Ecopetrol S.A. operates as an integrated energy company. It operates through four segments: Exploration and Production; Transport and Logistics; Refining and Petrochemicals; and Electric Power Transmission and Toll Roads Concessions. The Exploration and Production segment engages in the exploration ..."
  },
  "ARQQ": {
    "name": "Arqit Quantum Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Arqit Quantum Inc. provides cybersecurity services through satellite and terrestrial platforms in the United Kingdom. It offers QuantumCloud, a Platform as a Service that creates unbreakable software encryption keys. The company also provides maintenance and support, and professional services. Arqit..."
  },
  "BITO": {
    "name": "ProShares Bitcoin ETF",
    "industry": "",
    "summary": "The fund adviser seeks to achieve its investment objective primarily through managed exposure to bitcoin futures contracts. The fund does not invest directly in bitcoin. The fund adviser will generally hold its bitcoin futures contracts during periods in which the value of bitcoin and bitcoin future..."
  },
  "RACE": {
    "name": "Ferrari N.V.",
    "industry": "Auto Manufacturers",
    "summary": "Ferrari N.V., through its subsidiaries, engages in design, engineering, production, and sale of luxury performance sports cars worldwide. The company offers sports, track, one-off, and road cars, as well as supercars. It also provides spare parts and engines, as well as after sales, repair, maintena..."
  },
  "SYK": {
    "name": "Stryker Corporation",
    "industry": "Medical Devices",
    "summary": "Stryker Corporation operates as a medical technology company. It operates through two segments, MedSurg and Neurotechnology, and Orthopaedics. The MedSurg and Neurotechnology segment offers surgical equipment, and surgical navigation systems, endoscopic and communications systems, patient handling, ..."
  },
  "DUOL": {
    "name": "Duolingo, Inc.",
    "industry": "Software - Application",
    "summary": "Duolingo, Inc. operates as a mobile learning platform in the United States, the United Kingdom, and internationally. The company offers courses in 40 different languages, including Spanish, English, French, German, Italian, Portuguese, Japanese, and Chinese through its Duolingo app. It also provides..."
  },
  "FSLR": {
    "name": "First Solar, Inc.",
    "industry": "Solar",
    "summary": "First Solar, Inc., a solar technology company, provides photovoltaic (PV) solar energy solutions in the United States, France, India, Chile, and internationally. The company manufactures and sells PV solar modules with a thin film semiconductor technology that provides a lower-carbon alternative to ..."
  },
  "UEIC": {
    "name": "Universal Electronics Inc.",
    "industry": "Consumer Electronics",
    "summary": "Universal Electronics Inc. designs, develops, manufactures, ships, and supports home entertainment control products, technology and software solutions, climate control solutions, wireless sensors and smart home control products, and audio-video accessories. The company offers radio frequency (RF) ca..."
  },
  "AAPL": {
    "name": "Apple Inc.",
    "industry": "Consumer Electronics",
    "summary": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising Ai..."
  },
  "WDC": {
    "name": "Western Digital Corporation",
    "industry": "Computer Hardware",
    "summary": "Western Digital Corporation develops, manufactures, and sells data storage devices and solutions based on hard disk drive (HDD) technology in the United States, Asia, Europe, the Middle East, and Africa. The company offers internal HDDs, data center drives, data center platforms, external drives, po..."
  },
  "VRT": {
    "name": "Vertiv Holdings, LLC",
    "industry": "Electrical Equipment & Parts",
    "summary": "Vertiv Holdings Co designs, manufactures, and services critical digital infrastructure technologies and life cycle services for data centers, communication networks, and commercial and industrial environments in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. The company offers ..."
  },
  "SAIC": {
    "name": "Science Applications Internatio",
    "industry": "Information Technology Services",
    "summary": "Science Applications International Corporation provides technical, engineering, and enterprise information technology (IT) services in the United States. It operates in two segments, Defense and Intelligence, and Civilian. The company offers IT modernization services for defense, intelligence, and c..."
  },
  "GEV": {
    "name": "GE Vernova Inc.",
    "industry": "Specialty Industrial Machinery",
    "summary": "GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrific..."
  },
  "PBR": {
    "name": "Petroleo Brasileiro S.A. Petrob",
    "industry": "Oil & Gas Integrated",
    "summary": "Petróleo Brasileiro S.A. - Petrobras explores, produces, and sells oil and gas in Brazil and internationally. It operates through three segments: Exploration and Production; Refining, Transportation & Marketing; and Gas & Low Carbon Energies. The Exploration and Production segment explores, develops..."
  },
  "DLTR": {
    "name": "Dollar Tree, Inc.",
    "industry": "Discount Stores",
    "summary": "Dollar Tree, Inc. operates retail discount stores under the Dollar Tree and Dollar Tree Canada brands in the United States and Canada. The company offers consumable merchandise comprising everyday consumables, such as household paper and chemicals, food, candy, health, personal care products, and fr..."
  },
  "SWKS": {
    "name": "Skyworks Solutions, Inc.",
    "industry": "Semiconductors",
    "summary": "Skyworks Solutions, Inc., together with its subsidiaries, develops, manufactures, and markets analog and mixed-signal semiconductor products and solutions in the United States, Taiwan, China, South Korea, Europe, the Middle East, Africa, and the Asia Pacific. The company offers amplifiers, antenna t..."
  },
  "SATS": {
    "name": "EchoStar Corporation",
    "industry": "Telecom Services",
    "summary": "EchoStar Corporation, together with its subsidiaries, provides networking technologies and services in the United States and internationally. It operates through four segments: Pay-TV, Retail Wireless, 5G Network Deployment, Broadband and Satellite Services. The Pay-TV segment offers a direct broadc..."
  },
  "LUV": {
    "name": "Southwest Airlines Company",
    "industry": "Airlines",
    "summary": "Southwest Airlines Co. operates as a passenger airline company that provides scheduled air transportation services in the United States and internationally. It also provides Rapid Rewards loyalty program; SWABIZ, an online booking tool; and inflight entertainment platform that includes movies-on-dem..."
  },
  "XYZ": {
    "name": "Block, Inc.",
    "industry": "Software - Infrastructure",
    "summary": "Block, Inc., together with its subsidiaries, builds ecosystems focused on commerce and financial products and services in the United States and internationally. It operates through two segments: Square and Cash App. The Square segment offers commerce products for restaurants, appointments, retail, p..."
  },
  "ANET": {
    "name": "Arista Networks, Inc.",
    "industry": "Computer Hardware",
    "summary": "Arista Networks, Inc. engages in the development, marketing, and sale of data-driven, client to cloud networking solutions for AI, data center, campus, and routing environments in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. Its cloud networking solutions consist of Extensibl..."
  },
  "TPR": {
    "name": "Tapestry, Inc.",
    "industry": "Luxury Goods",
    "summary": "Tapestry, Inc. provides accessories and lifestyle brand products in North America, Greater China, rest of Asia, and internationally. The company operates in three segments: Coach, Kate Spade, and Stuart Weitzman. It offers women's handbags, fashion designs, business cases, computer bags, messenger s..."
  },
  "VMC": {
    "name": "Vulcan Materials Company (Holdi",
    "industry": "Building Materials",
    "summary": "Vulcan Materials Company produces and supplies construction aggregates in the United States. It operates through three segments: Aggregates, Asphalt, and Concrete. The company provides crushed stone, sand and gravel, sand, riprap and jetty stones, and other aggregates for use in construction and mai..."
  },
  "STM": {
    "name": "STMicroelectronics N.V.",
    "industry": "Semiconductors",
    "summary": "STMicroelectronics N.V., together with its subsidiaries, designs, develops, manufactures, and sells semiconductor products in Europe, the Middle East, Africa, the Americas, and the Asia Pacific. The company operates through Analog products, MEMS and Sensors Group (AM&S); Power and Discrete products ..."
  },
  "MDLZ": {
    "name": "Mondelez International, Inc.",
    "industry": "Confectioners",
    "summary": "Mondelez International, Inc., through its subsidiaries, manufactures, markets, and sells snack food and beverage products in Latin America, North America, Asia, the Middle East, Africa, and Europe. The company provides biscuits and baked snacks, including cookies, crackers, salted snacks, snack bars..."
  },
  "BTDR": {
    "name": "Bitdeer Technologies Group",
    "industry": "Software - Application",
    "summary": "Bitdeer Technologies Group operates as a technology company for blockchain and high-performance computing (HPC) in Singapore, the United States, Bhutan, and Norway. The company offers hash rate sharing solutions, including Cloud hash rate and Hash rate marketplace; and a one-stop mining rig hosting ..."
  },
  "ISRG": {
    "name": "Intuitive Surgical, Inc.",
    "industry": "Medical Instruments & Supplies",
    "summary": "Intuitive Surgical, Inc. develops, manufactures, and markets products that enable physicians and healthcare providers to enhance the quality of and access to minimally invasive care in the United States and internationally. It offers the da Vinci Surgical System that enables surgical procedures usin..."
  },
  "WEC": {
    "name": "WEC Energy Group, Inc.",
    "industry": "Utilities - Regulated Electric",
    "summary": "WEC Energy Group, Inc., through its subsidiaries, provides regulated natural gas and electricity, and renewable and nonregulated renewable energy services in the United States. It operates through Wisconsin, Illinois, Other States, Electric Transmission, and Non-Utility Energy Infrastructure segment..."
  },
  "TSM": {
    "name": "Taiwan Semiconductor Manufactur",
    "industry": "Semiconductors",
    "summary": "Taiwan Semiconductor Manufacturing Company Limited, together with its subsidiaries, manufactures, packages, tests, and sells integrated circuits and other semiconductor devices in Taiwan, China, Europe, the Middle East, Africa, Japan, the United States, and internationally. It provides various wafer..."
  },
  "KMX": {
    "name": "CarMax Inc",
    "industry": "Auto & Truck Dealerships",
    "summary": "CarMax, Inc., through its subsidiaries, operates as a retailer of used vehicles and related products in the United States. The company operates in two segments: CarMax Sales Operations and CarMax Auto Finance. The CarMax Sales Operations segment offers customers a range of makes and models of used v..."
  },
  "CLS": {
    "name": "Celestica, Inc.",
    "industry": "Electronic Components",
    "summary": "Celestica Inc., together with its subsidiaries, provides supply chain solutions in Asia, North America, and internationally. It operates through two segments, Advanced Technology Solutions, and Connectivity and Cloud Solutions. The company offers a range of product manufacturing and related supply c..."
  },
  "HEI": {
    "name": "Heico Corporation",
    "industry": "Aerospace & Defense",
    "summary": "HEICO Corporation provides aerospace, defense, and electronic related products and services in the United States and internationally. Its Flight Support Group segment offers jet engine and aircraft component replacement parts; thermal insulation blankets and parts; renewable/reusable insulation syst..."
  },
  "MU": {
    "name": "Micron Technology, Inc.",
    "industry": "Semiconductors",
    "summary": "Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Japan, Mainland China, Hong Kong, Europe, and internationally. It operates through the Cloud Memory Business Unit; Core Data Center Business Unit; Mobile and Client Business U..."
  },
  "NGD": {
    "name": "New Gold Inc.",
    "industry": "Gold",
    "summary": "New Gold Inc., an intermediate gold mining company, engages in the development and operation of mineral properties in Canada. It primarily explores for gold, silver, and copper deposits. The company's principal operating properties include 100% interest in the Rainy River mine located in Northwester..."
  },
  "APD": {
    "name": "Air Products and Chemicals, Inc",
    "industry": "Specialty Chemicals",
    "summary": "Air Products and Chemicals, Inc. provides atmospheric gases, process and specialty gases, equipment, and related services in the Americas, Asia, Europe, the Middle East, India, and internationally. The company produces atmospheric gases, including oxygen, nitrogen, and argon; process gases, such as ..."
  },
  "NBIS": {
    "name": "Nebius Group N.V.",
    "industry": "Internet Content & Information",
    "summary": "Nebius Group N.V., a technology company, engages in building full-stack infrastructure to service the global AI industry in the Netherlands, Europe, North America, and Israel. The company offers Nebius builds full-stack infrastructure for AI, including large-scale GPU clusters, cloud platforms, and ..."
  },
  "HSY": {
    "name": "The Hershey Company",
    "industry": "Confectioners",
    "summary": "The Hershey Company, together with its subsidiaries, engages in the manufacture and sale of confectionery products and pantry items in the United States and internationally. The company operates through three segments: North America Confectionery, North America Salty Snacks, and International. It of..."
  },
  "RKLB": {
    "name": "Rocket Lab Corporation",
    "industry": "Aerospace & Defense",
    "summary": "Rocket Lab Corporation, a space company, provides launch services and space systems solutions in the United States, Canada, Japan, and internationally. The company provides launch services, spacecraft design services, spacecraft components, spacecraft manufacturing, and other spacecraft and on-orbit..."
  },
  "OSCR": {
    "name": "Oscar Health, Inc.",
    "industry": "Healthcare Plans",
    "summary": "Oscar Health, Inc. operates as a healthcare technology company in the United States. The company offers health plans to individuals, families, employees, and small group markets. It also provides +Oscar platform that power others throughout the healthcare system; Campaign Builder platform, an engage..."
  },
  "PSN": {
    "name": "Parsons Corporation",
    "industry": "Information Technology Services",
    "summary": "Parsons Corporation provides integrated solutions and services in the defense, intelligence, and critical infrastructure markets in North America, the Middle East, and internationally. It operates through Federal Solutions and Critical Infrastructure segments. The Federal Solutions segment offers cr..."
  },
  "CMS": {
    "name": "CMS Energy Corporation",
    "industry": "Utilities - Regulated Electric",
    "summary": "CMS Energy Corporation operates as an energy company primarily in Michigan. The company operates through three segments: Electric Utility; Gas Utility; and NorthStar Clean Energy. The Electric Utility segment is involved in the generation, purchase, distribution, and sale of electricity. This segmen..."
  },
  "LYV": {
    "name": "Live Nation Entertainment, Inc.",
    "industry": "Entertainment",
    "summary": "Live Nation Entertainment, Inc. operates as a live entertainment company worldwide. It operates through Concerts, Ticketing, and Sponsorship & Advertising segments. The Concerts segment promotes live music events in its owned or operated venues, and in rented third-party venues. This segment operate..."
  },
  "CRDO": {
    "name": "Credo Technology Group Holding ",
    "industry": "Semiconductors",
    "summary": "Credo Technology Group Holding Ltd provides various high-speed connectivity solutions for optical and electrical Ethernet, and PCIe applications in the United States, Taiwan, Mainland China, Hong Kong, and internationally. It provides HiWire active electrical cables solutions, including HiWire CLOS,..."
  },
  "CMI": {
    "name": "Cummins Inc.",
    "industry": "Specialty Industrial Machinery",
    "summary": "Cummins Inc. offers various power solutions worldwide. It operates through five segments: Engine, Distribution, Components, Power Systems, and Accelera. The company offers diesel and natural gas-powered engines; and drivetrain systems, including axles, drivelines, brakes, and suspension systems; tru..."
  },
  "SAP": {
    "name": "SAP  SE",
    "industry": "Software - Application",
    "summary": "SAP SE, together with its subsidiaries, provides enterprise application and business solutions worldwide. It offers SAP S/4HANA that provides software capabilities for finance, risk and project management, procurement, manufacturing, supply chain and asset management, and research and development; S..."
  },
  "WMB": {
    "name": "Williams Companies, Inc. (The)",
    "industry": "Oil & Gas Midstream",
    "summary": "The Williams Companies, Inc., together with its subsidiaries, operates as an energy infrastructure company primarily in the United States. It operates through Transmission & Gulf of America, Northeast G&P, West, and Gas & NGL Marketing Services segments. The Transmission & Gulf of America segment co..."
  },
  "AME": {
    "name": "AMETEK, Inc.",
    "industry": "Specialty Industrial Machinery",
    "summary": "AMETEK, Inc. manufactures and sells electronic instruments (EIG) and electromechanical (EMG) devices in the United States and internationally. The company's EIG segment offers advanced instruments for the process, aerospace, power, and industrial markets; process and analytical instruments for the o..."
  },
  "RDDT": {
    "name": "Reddit, Inc.",
    "industry": "Internet Content & Information",
    "summary": "Reddit, Inc. operates a digital community in the United States and internationally. The company's platform enables user to engage in conversations, explore passions, research new hobbies, exchange goods and services, create new communities and experiences, share laughs, and find belonging. It also o..."
  },
  "VSAT": {
    "name": "ViaSat, Inc.",
    "industry": "Communication Equipment",
    "summary": "Viasat, Inc. provides broadband and communications products and services in the United States and internationally. It operates through Communication Services; and Defense and Advanced Technologies segments. The company offers satellite-based broadband and narrowband communications solutions; broadba..."
  },
  "WYNN": {
    "name": "Wynn Resorts, Limited",
    "industry": "Resorts & Casinos",
    "summary": "Wynn Resorts, Limited designs, develops, and operates integrated resorts. It operates through four segments: Wynn Palace, Wynn Macau, Las Vegas Operations, and Encore Boston Harbor. The Wynn Palace segment operates private gaming salons and sky casinos; a luxury hotel tower with suites, and villas, ..."
  },
  "GM": {
    "name": "General Motors Company",
    "industry": "Auto Manufacturers",
    "summary": "General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts worldwide. It operates through GM North America, GM International, and GM Financial segments. The company markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling bran..."
  },
  "PAG": {
    "name": "Penske Automotive Group, Inc.",
    "industry": "Auto & Truck Dealerships",
    "summary": "Penske Automotive Group, Inc., a diversified transportation services company, operates automotive and commercial truck dealerships worldwide. The company operates through four segments: Retail Automotive, Retail Commercial Truck, Other, and Non-Automotive Investments. It operates dealerships under f..."
  },
  "KC": {
    "name": "Kingsoft Cloud Holdings Limited",
    "industry": "Software - Application",
    "summary": "Kingsoft Cloud Holdings Limited provides cloud services to businesses and organizations primarily in China. The company's product portfolio includes cloud products, such as infrastructure as a service (IaaS) infrastructure, platform as a service (PaaS) middleware, and software as a service (SaaS) ap..."
  },
  "ERAS": {
    "name": "Erasca, Inc.",
    "industry": "Biotechnology",
    "summary": "Erasca, Inc., a clinical-stage precision oncology company, focuses on discovering, developing, and commercializing therapies for patients with RAS/MAPK pathway-driven cancers. The company's lead product is naporafenib which is in SEACRAFT-2 pivotal Phase 3 trial for patients with NRAS-mutated (NRASm..."
  },
  "MKC": {
    "name": "McCormick & Company, Incorporat",
    "industry": "Packaged Foods",
    "summary": "McCormick & Company, Incorporated manufactures, markets, and distributes herbs, spices, seasoning mixes, condiments, and other flavorful products to the food industry. It operates in two segments, Consumer and Flavor Solutions. The Consumer segment offers spices, herbs, and seasonings, as well as co..."
  },
  "FLNC": {
    "name": "Fluence Energy, Inc.",
    "industry": "Utilities - Renewable",
    "summary": "Fluence Energy, Inc., through its subsidiaries, provides energy storage and optimization software for renewables and storage applications in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. It sells energy storage products with integrated hardware, software, and digital intellige..."
  },
  "AMD": {
    "name": "Advanced Micro Devices, Inc.",
    "industry": "Semiconductors",
    "summary": "Advanced Micro Devices, Inc. operates as a semiconductor company internationally. It operates in three segments: Data Center, Client and Gaming, and Embedded. The company offers artificial intelligence (AI) accelerators, microprocessors, and graphics processing units (GPUs) as standalone devices or ..."
  },
  "CTVA": {
    "name": "Corteva, Inc.",
    "industry": "Agricultural Inputs",
    "summary": "Corteva, Inc. operates in the agriculture business. It operates through two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce optimum yield for farms. It offers trait technologies that enhance resistance to weather, disease, insects..."
  },
  "BWXT": {
    "name": "BWX Technologies, Inc.",
    "industry": "Aerospace & Defense",
    "summary": "BWX Technologies, Inc. manufactures and sells nuclear components in the United States, Canada, and internationally. It operates through two segments, Government Operations and Commercial Operations. The company manufactures precision naval nuclear components, reactors, and nuclear fuel; close-tolera..."
  },
  "AEIS": {
    "name": "Advanced Energy Industries, Inc",
    "industry": "Electrical Equipment & Parts",
    "summary": "Advanced Energy Industries, Inc. provides precision power conversion, measurement, and control solutions in the United States and internationally. The company's plasma power products offer solutions to enable innovation for semiconductor and thin film plasma processes, such as dry etch and depositio..."
  },
  "CART": {
    "name": "Maplebear Inc.",
    "industry": "Internet Retail",
    "summary": "Maplebear Inc., doing business as Instacart, engages in the provision of online grocery shopping services to households in North America. Its service can be provided through company's mobile application or website. The company also provides advertising services; and software-as-a-service solutions. ..."
  },
  "PSTG": {
    "name": "Pure Storage, Inc.",
    "industry": "Computer Hardware",
    "summary": "Pure Storage, Inc. provides data storage and management technologies, products, and services in the United States and internationally. Its Purity software is shared across its products and provides enterprise-class data services, such as always-on data reduction, data protection, and encryption, as ..."
  },
  "ET": {
    "name": "Energy Transfer LP",
    "industry": "Oil & Gas Midstream",
    "summary": "Energy Transfer LP, together with its subsidiaries, provides energy-related services in the United States. It operates through Intrastate Transportation and Storage; Interstate Transportation and Storage; Midstream; Natural Gas Liquid (NGL) and Refined Products Transportation and Services; Crude Oil..."
  },
  "KDP": {
    "name": "Keurig Dr Pepper Inc.",
    "industry": "Beverages - Non-Alcoholic",
    "summary": "Keurig Dr Pepper Inc. owns, manufactures, and distributors beverages and single serve brewing systems in the United States and internationally. It operates through three segments: U.S. Refreshment Beverages, U.S. Coffee, and International. The company manufactures and distributes branded concentrate..."
  },
  "A": {
    "name": "Agilent Technologies, Inc.",
    "industry": "Diagnostics & Research",
    "summary": "Agilent Technologies, Inc. provides application focused solutions to the life sciences, diagnostics, and applied chemical markets worldwide. The company operates through three segments: Life Sciences and Diagnostics Markets, Agilent CrossLab, and Applied Markets. The Life Sciences and Diagnostics Ma..."
  },
  "YUM": {
    "name": "Yum! Brands, Inc.",
    "industry": "Restaurants",
    "summary": "Yum! Brands, Inc., together with its subsidiaries, develops, operates, and franchises quick service restaurants worldwide. It operates through four segments: KFC Division, Taco Bell Division, Pizza Hut Division, and Habit Burger & Grill Division segments. The company also operates restaurants under ..."
  },
  "CHRW": {
    "name": "C.H. Robinson Worldwide, Inc.",
    "industry": "Integrated Freight & Logistics",
    "summary": "C.H. Robinson Worldwide, Inc., together with its subsidiaries, provides freight transportation and related logistics and supply chain services in the United States and internationally. It operates in two segments, North American Surface Transportation and Global Forwarding. The company offers transp..."
  },
  "PSNY": {
    "name": "Polestar Automotive Holding UK ",
    "industry": "Auto Manufacturers",
    "summary": "Polestar Automotive Holding UK PLC engages in the research and development, marketing, commercialization, and sale of battery electric vehicles and related technology solutions. The company offers battery electric vehicles, including Polestar 2 (PS2), a fast-back sedan; Polestar 3 (PS3), an aero spo..."
  },
  "XLV": {
    "name": "State Street Health Care Select",
    "industry": "",
    "summary": "In seeking to track the performance of the index, the fund employs a replication strategy. It generally invests substantially all, but at least 95%, of its total assets in the securities comprising the index. The index includes companies from the following industries: pharmaceuticals; health care eq..."
  },
  "AEP": {
    "name": "American Electric Power Company",
    "industry": "Utilities - Regulated Electric",
    "summary": "American Electric Power Company, Inc., an electric public utility holding company, engages in the generation, transmission, and distribution of electricity for sale to retail and wholesale customers in the United States. It operates through Vertically Integrated Utilities, Transmission and Distribut..."
  }
}